{
    "She's My Kind Of Girl by ABBA official": [
        "Me encanta escucharlos cantar juntos a Bjorn y Benny.",
        "Though I'm listening to this band from my boyhood but this one is simply unparalleled to me.Because it touches my heart ️",
        "Foot taps to song. First time I ever heard it. I love it. ",
        "This has kinda Beach boys vibes and I like it :D",
        "名曲は永遠に",
        "久しぶりに聞きたくなりました",
        "***MISS THE GOOD OLD DAYS***",
        "Reminds me good old days. Don’t know why I became like it. Something very attractive.",
        "love it",
        "Timeless!.. nice",
        "Min skogsnuva! My sweetheart!",
        "",
        "Lyrics:\n\nLook at her face, it's a wonderful face\nAnd it means something special to me\nLook at the way that she smiles when she sees me\nHow lucky can one fellow be?\n\nShe's just my kind of girl, she makes me feel fine\nWho could ever believe that she would be mine?\nShe's just my kind of girl, without her I'm blue\nAnd if she ever leaves me what could I do, what could I do?\n\nAnd when we go for a walk in the park\nThen she holds me and squeezes my hand\nWe'll go on walking for hours and talking\nAbout all the things that we plan\n\nShe's just my kind of girl, she makes me feel fine\nWho could ever believe that she would be mine?\nShe's just my kind of girl, without her I'm blue\nAnd if she ever leaves me what could I do, what could I do?\n\nShe's just my kind of girl, she makes me feel fine\nWho could ever believe that she would be mine?\nShe's just my kind of girl, without her I'm blue\nAnd if she ever leaves me what could I do?\n\nShe's just my kind of girl, she makes me feel fine\nWho could ever believe that she would be mine?",
        "木枯らしの少女　イントロおきにいり",
        "大好き！！！",
        "weird to hear the guys sing not the same without the girls.  ABBA=Gals",
        "昔聞いていたはずの曲。\n突然「She's just my kind of girl～」のメロディが頭に浮かんできて誰だったかなぁ、と検索したらABBAだった。\n久しぶりにABBA GOLDを聞こう。",
        "Просто супер:)",
        "RELEASE IN JAPAN AS A SIDE SINGLE!!!!",
        "Hibbie A, which Doodle Do Song samples This song",
        "Hello",
        "This song was a theme in a porn movie in the early 70's \"The Seduction of Inga\""
    ],
    "As Good As New by ABBA official": [
        "One of the most underrated songs ever",
        "Never tire listening to this song",
        "I love ABBA ",
        "Abba is one of my favorites since the late 70s, 80s… and till now. No replacement for good music, lyrics, vocals, performance, Abba has the whole package",
        "Abba at its best with sublime vocals by Agnetha",
        "All the ABBA music is timeless , immortal and masterpieces forever . The most beautiful music , songs and voices in the World . Absolute perfection in all aspect ever !!!!",
        "This song is to a whole other level",
        "Génial...les harmonies et la voix d'Agnetha font fureur",
        "Just like eating a peanut or potato chip one ABBA song isn't enough.",
        "Really glad to finally find this song after 3 decades of a seemingly endless curiosity. All I could remember was just the extremely catchy \"mamamamama...\" part. I was too embarrassed to ask and googling only gave me Mamma Mia instead.\nI've been looping it everyday since I found it last week. The more I listen to it, the more it makes my day. Still no plan to stop so far. Never had this experience with any other song before. ABBA = magic.",
        "Aren't they just the best,  but this album was pure brilliance",
        "Timeless...the best!",
        "Another album track as good or even better than the singles ,   Gotta love Abba ",
        "Two gorgeous, talented female singers with two competent and creative musicians who understood perfectly the winning formula for the trending music style of the time. How could ABBA not succeed?",
        "Some mighty vocals on this one. Another classic from ABBA. Should have been released as a single everywhere not only in handful of countries.",
        "And so finally after roughly 40 years Ive found a violin that will play the cha cha inwaltz time? Thank you Abba for this delihhtful light jig!  You know what? It was all worth it!",
        "Abba is timeless",
        "",
        "La alegria que me da está canción...desde chica,hoy con 43 años me sigue dando la misma sensación, increíble sonido y voces increíbles.como se perdió la magia y el talento con el tiempo.hermoso Abba 🩵",
        "*****LOVE ABBA EVER SINCE IT STARTED******",
        "What a track, that slap bass line gets me every time. ",
        "Beginning with a little quasi-Mozart string ensemble, slamming into a nice disco, heavy bass vamp, then a wailing soprano solo.... WOW...!!!  This song has everything...!!!!  Including that ABBA wall-of-sound...!!!   I love it...!!!  Thanks for posting.",
        "One of the best lead vocals Agnetha",
        "Loucura imaginar que essa é a primeira faixa.",
        "Agnetha is powerful and very beautiful voice , she's a soprano and high tunes voice ever .\nExcellent , extraordinary !!!! Very beautiful angelic and powerful voice !!!",
        "Engels von himmlisch stimmen und schönes musik .\n\nABBA YOU'RE ONLY PURE HIGH EXCELLENCE IN ALL ASPECT .\n\nABBA IST EIN MOZART VON POP MUSIK DER WELT .",
        "As Good as New\" is a song recorded in 1979 by Swedish group ABBA,\n and was used as the opening track on their Voulez-Vous album. The lead \nvocals are by Agnetha Fältskog. The song was released as a single in \nMexico as a double A-side with \"I Have a Dream\", where it became ABBA's \nninth number-one hit.",
        "ABBA ",
        "All my love for ABBA !!!\nABBA IS A MOZART LEVEL OF POP MUSIC IN THE WORLD !!! ",
        "my  love for this album and for Abba in general  !!!!",
        "Such a remarkable album!",
        "Abba from Sweden",
        "That's music from another time.",
        "ABBA forever!",
        "Strong Vocals , Brilliant Soprano",
        "I love this song. Thank you for the music.  Congratulations to your 50 years ago Sweden won With Waterloo ",
        "A great album abba at their best",
        "it smells of polyester in some places, but when it gets to the Chorus with the vocals and strings...\nit's just lovely, almost magical !  : )\nthe intro is just so spot on.\nsuch great arrangements on these songs.",
        "I was 9 years old when I first heard a song of ABBA.I was inlove with them at once.",
        "Timeless!... thank you ",
        "Thank you Eurovision for ABBA",
        "Agnetha por Dios que voz tenias , la más bella , alta , clara y potente como maravillosa que jamás antes ni después de ti se ha escuchado otra vez nuevamente , sus carácteristicas própias la hacen inimitable , insuperable , inigualable e irrepetible .\nPor eso eres mi cantante favorita y número uno por siempre y de toda la vida igual .",
        "ABBA 2023 ",
        "I work in an Abba tribute and this one only gets played when we do a set over 1hr 30min, but it's up there with their best. Quite hard to play though! My other \"underdog\" favourites are People Need Love and When All is Said and Done :)",
        "Funkie y disco excelente de ABBA siempre con mucha calidad así escuchando ABBA desde Argentina año 2024 🇸🇪🇦🇷",
        "ABBA AS GOOD AS NEW 1979",
        "Time of great music production comparing to this misery time we are in ….what an artists ..what a songs ….",
        "The  best for  kareoke....",
        "The \"Ma-ma-ma-ma\" bit is ABBA's little tribute to The Beatles' \"Back in the U.S.S.R.\"",
        "I was struggling to remember the name of this song, but I'm glad it eventually came back to me. I love ABBA",
        "Love this song",
        "FRIDA  mais quelle voix .THE VOIX ",
        "I thought that my love for ABBA was at an end but here I am again..",
        "Abba, måste vara kompis med Mozart.!!! Väldigt bra..",
        "Those violins. Wow!",
        "how precise this bass is.....",
        "Que voces angelicales!!!!!Abba NUMERO UNO!!!!NO HAY COMO ESTA EPOCA!!!!LOS QUE VIENEN DESPUES SON IMITADORES!!!!",
        "Sooo good",
        "fantastic",
        "Voulez Vous is ABBA's best album.",
        "A song wonderful",
        "2:38.Агнета зажигает) ",
        "ABBA LO MÁS GRANDE Y LO MÁXIMO POR SIEMPRE EN MÚSICA POP !!!!!",
        "Los adoro . Creo que son las voces mas maravillosas y una música que será perenne",
        "A song many  people are not familiar with .From the smash hit 1979 album Voulez  Vous .The violins..the disco feel .Not many ABBA songs got a complete finish, this one does...most of their songs fade out to finish..",
        "THE BAAASSSS ",
        "gran voz de Agnetha",
        "I remember listening to this on vinyl... <3",
        "Zwei fantastisch frauen mit hervorragenden und himmlisch stimmen .\nEinfach perfekt und magik !!!\n\nThe new generations like love ABBA music .\nA very special and super pop group in all aspect .",
        "MY FAVORYTE SONG-",
        "Et puis un jours , se passe un truc plutôt simpa ,que je ne raconte pas ici , je ne vais pas tout révéler mais se qui arriva cette après midi là était digne d un évènement , d une apparition bien innatendue autant que simpatique .  A suivre .",
        "ABBA +++agnetha sing very good",
        "My niece's wedding in 2022. She said, \"I know you love ABBA and I want the DJ to play an ABBA song at the reception.  Which song would you suggest?\" I said, \"NO DANCING QUEEN!\" (because that is always the obvious choice).  I wanted a song that the average casual ABBA listener most likely had never heard of, and one I loved. 'As Good As new' was it!  Also, my niece and her boyfriend had been together for 10 years, so this wedding was to make their relationship 'as good as new.'  During the reception, the music was pretty lame. An hour later, my niece approached us and said, \"He has not played your song yet?\" I said no. She marched over to the DJ.....and within 5 minutes, the strings we know and love came on.  Everyone stopped. What was this???  Then the strings stopped and the song hit!  I knew people would jump. I dragged my niece (still in her wedding gown!) and my partner to the dance floor and we let it loose.  And the dance floor, which was almost empty until now, was suddenly full.  People loved this!  And it forced the DJ to finally start playing great music to follow.  I have known and loved this song since 1979 and now, every time I hear it, I think of Gabrielle's wedding.",
        "ABBA",
        "Side A of the vinyl record..Too bad my vinyl was ruined by time. Never gets old all music on this ALBUM.",
        "Já to viciada nessa também ",
        "@IThinkYouLookLarvely Do you do Move On. Very sad no actual recording of an ABBA performance. However there is a great video of this with perfectly matched pictures to the song. A great view and listen. Look out for the waterfall.",
        "  #ABBA  #AsGoodAsNew",
        "Listening to this at age 11, I always remember thinking, \"Tell her to go to hell!!!\" Adored the song, though.",
        "****STILL HAVE ALBUM****",
        "When I was at school in the late 70’s and early 80’s I always liked ABBA but they were ridiculed and considered about as un-hip and unfashionable as was possible. Nice to know I was right at the time and ABBA are now considered one of the all time great pop music bands, and Benny and Bjorn are also quite rightly mentioned in the same song-writing genius level as Lennon and McCartney.",
        "Why such low views? It’s great",
        "Awesome.My childhood",
        "JEEZ.",
        "ABBA Por siempre!!!",
        "Jejejejeje temazo temazo temazo\nABBA lo mejor\nVoulez-vous el mejor álbum de la historia pop",
        "This is the first album I bought... I was 11 or 12 ",
        "love to all xxx",
        "maravilhosos",
        "",
        "omg mi infancia :D",
        "Should have been a world wide single release.... but only released in 1 maybe 2 countries on 7\"",
        "I like it",
        "I️ Abba",
        "This music is funny",
        "Yah, shurre gut!",
        "This is perfect for when I make up fake scenarios in my head.",
        "tres horas de la mañana.",
        "I'll never know why I had to go\nWhy I had to put up such a lousy rotten show\nBoy, I was tough, packin' all my stuff\nSayin' I don't need you anymore, I've had enough\nAnd now, look at me standing here again 'cause I found out that\nMa-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma my life is here\nGotta have you near\n\nAs good as new, my love for you\nAnd keepin' it that way is my intention\nAs good as new and growin' too\nYes, I think it's takin' on a new dimension\nIt's as good as new, my love for you\nJust like it used to be and even better\nAs good as new, thank God it's true\nDarling, we were always meant to stay together\n\nFeel like a creep, never felt so cheap\nNever had a notion that my love could be so deep\nHow could I make such a dumb mistake\nNow I know I'm not entitled to another break\nBut please, baby, I beg you to forgive 'cause I found out that\nMa-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma-Ma my life is here\nGotta have you near\n\nAs good as new, my love for you\nAnd keeping it that way is my intention\nAs good as new and growing too\nYes, I think it's taking on a new dimension\nIt's as good as new, my love for you\nJust like it used to be and even better\nAs good as new, thank God it's true\nDarling, we were always meant to stay together\n\nI thought that our love was at an end but here I am again\n\nAs good as new, my love for you\nAnd keeping it that way is my intention\nAs good as new and growing too\nYes, I think it's taking on a new dimension\nIt's as good as new, my love for you\nJust like it used to be and even better\nAs good as new, thank God it's true\nDarling, we were always meant to stay together\n\nYes the love I have for you feels as good as new\nDarling, we were always meant to stay together",
        "I do have the LP."
    ],
    "Bang by ABBA official": [
        "Dont ever forget this guys where born in sweden, english wasnt their mother lenguage and they made worldwide music hits, they deserve the double of respect",
        "That must have been a fun little song to sing for ABBA. They look like they had so much fun singing it.",
        "MAN those guys wrote the most stunning melodies ever. The two girls are gorgeous and WOW could they sing ! ABBA were and will remain the high water mark for pop music",
        "I think this is their happiest song. Even the lyrics are the happiest. Even the video itself, where they seem the happiest.",
        "Biorn's eyes are full of love",
        "Fun fact: this short film was one of many directed by Lasse Hallstrom, who went on to direct such features as MR. HOLLAND’S OPUS starring Richard Dreyfuss. “Bang-A-Boomerang” was ABBA at their bubbliest.",
        "You can tell that ABBA truly enjoyed singing and performing.  Their kind of enthusiasm couldn't be faked or an act.",
        "My favorite ABBAABBA album tune !!!",
        "Musik für die Ewigkeit",
        "This is not song .\nThis is timeless masterpiece .",
        "I really doubt that any other band has as many hits as this band. This has to be one of the greatest bands in history.",
        "I feel happy when I see ABBA singing happily.",
        "This is my favorite ABBA song + video.  Pure happiness!",
        "Девушки  ОГОНЬ,а их талан и музичка ,как будто подливают масла в огонь ,и народ прлсто балдееееееееееет ,и так 40 лет уже не перестает балдеть от них.Браво ,браво ребятаЖивите,долгооооо на радость людям",
        "Frida is a treasure!…She’s bubbly, she’s pretty, and she has a great voice!..I love watching her on these videos!!",
        "AbbA forever!",
        "ABBA  rocks!",
        "I love how Bjorn looks at Agnetha.",
        "ABBA was a fantastic group",
        "Abba certainly changed pop music fantastic group.",
        "Август 2024... И так будет вечно! Мы уйдём а музыка АББА будет звучать всегда!",
        "One of their most underrated songs! God, I love it!!!",
        "This is probably the video on which ABBA is most happy. The way Björn looks at Agnetha is so sweet. <3",
        "There will never be a super group like abba ever again",
        "Back then they were 2 great couples. They truly loved each other and being together. They belonged together",
        "Underrated ABBA Classic,",
        "Такого больше не будет никогда! Наслаждайтесь 70-80 ыми !!!",
        "Lasse Hallstrom is a genius. He created an unique Abba Style.",
        "A MILLION STARS !!!!!",
        "Yup! This is definitely 70’s",
        "The wish is that this music come back. It never went anywhere. It’s here for all of us who are lucky enough to want to hear it and hear it again. If it’s good it has a life of its own. The music never left and it’s not going anywhere. Thank heaven that you got to hear it, know it,and enjoy it. It’s not going anywhere.",
        "I think part of the reason why ABBA's singing of love songs were so believable because they were real couples and they felt every note and word they sang.",
        "The way that Bjorn looks Agnetha, is so lovely",
        "Timeless. Innocent. Joyful. The Earth needs ABBA...for ever!",
        "An homage to Australia too. The country that fell in love with Abba like no other.",
        "THE BEGINNING OF A LEGEND!!!THEN ABBA WAS A SIMPLE BAND AND THEY COULD  WALK IN THE STREET,LATER THEY WOULD NEED A COMPANY OF SECURITY JUST  TO GET OUT OF THEIR HOUSES!!!ABBA FAN FOR EVER!!!",
        "What a great message to the world!",
        "Abba, you four are immortal!",
        "you can easily look in the way they smile, they look at each other, the way they enjoy his music that this guys reallly really loved music and what they were doing, money was not their goal, only make people feel good",
        "They are so adorable here!! At their peak popularity and giving so much positivity and pop ‘bang’ to their fans!!",
        "These songs sound simple but are really sophisticated; plus there is a lot of work in voices and arrangements; it's musical excellence.",
        "I can`t help smiling when I listen to ABBA",
        "You can see how much Bjorn is appreciating Agnetha's beauty and talent here and rightfully so! She was a blonde swedish Goddess",
        "Been an ABBA fan for 45 years. Out of all of their songs, I love this one the best. Love the harmony.",
        "Always the same thing, waking up after watching ABBA videos for several hours. Dangerous to start watching an Abba video, then time disappears...",
        "ever notice that Anni-Frid & Agnetha sound like an entire choir singing?  They are the only ones to ever have that ability.  The sound like 4, 5, 6 people singing at times.  Their  talent is so off the charts its not possible to describe in words.  Nobody has come even remotely close since these two.  Nobody ever will.",
        "This is definitely my favourite music group by far in all history of music",
        "They wrote this song for their Aussie fan’s as they were very successful in Australia",
        "This song is as good as big hits \nBest abba song for me",
        "This is what I've heard about the people of Sweden. They are very kind and caring people!",
        "Now im 57 I come to realize all ABBA songs were great!",
        "how many people out wish this music would comeback",
        "Agnetha is a dream.",
        "I have always thought that everything ever done by ABBA was a well written well sung song. From the up lifting Bang a Boomerang to the melodic Chiquita. No group today can compare to them. Most in the past would be hard to find.  Been a fan since I was 17 , now I’m 60. Hail \nHail to ABBA.",
        "ABBA FAN FOR EVER!!!",
        "C'était une autre époque. Une époque heureuse, insouciante avec la musique d'un groupe mythique, intemporel, inoubliable. 4 jeunes gens géniaux. Merci ABBA d'avoir égayé mes journées et de continuer à le faire. ",
        "Abba still blows me away after all these years.",
        "This is the most beautiful song from ABBA why do they not play it on the radio???? TO MUCH HAPPINESS AND LOVE IN IT???? it would clear all negativity from the world...",
        "Anni-Frid is so wow here...just wow ",
        "I love Frida’s happy smile!! ",
        "ABBA's Tribute to Their OZ Fans. A Boomerang of Love, eh Guys.",
        "ABBA are pure class.  every song they write and sing is pure quality",
        "Bands such as Abba, Queen, David Bowie, Elton John, and The Beatles changed the boundaries of music history. Such musical gold.",
        "This song used to transport me to an otherworldy place when I was a little kid. ABBA took me out of my mundane existence for 3 minutes or so.",
        "Abba really has no bad song",
        "This would have won Eurovision any year.",
        "Frida and Agnetha were so bubbly  and so fantastically beautiful  how could anyone not love them or fall for them",
        "ABBA war, ist und bleibt einzigartig! Die sensationellste Pop-Gruppe aller Zeiten! Und dieser Song gehört zu meinen absoluten Favoriten!!",
        "Ritm,antren,optimism,bang.... Emană tinerețe că voi,titanii muzicii europene.",
        "No clue why this song popped into my head today. Haven't thought of it in decades. ",
        "Oh my goodness I love this song and it is such funny and nice to hear that abba song now",
        "Abba magia lat 70-tych !",
        "ABBA: a band that marked an era. Incomparable!",
        "The likes of ABBA will never be seen again.  Pop music at it's ultimate.",
        "ABBA an iconic band.\nThey were loved by everyone.",
        "You have the most melodic music in the world, with lyrics that draw you in so intimately, and you have these great, GREAT superstars.",
        "Aaaaah look at how Bjorn looks at Agnetha, such love! LOVE Frida's dancing at 1.20!! Top tune, top band",
        "Beautiful, smiling people",
        "Ich liebe ABBA und ihre herrliche Musik, denn ABBA lebt und liebt gelebte Lebensfreude !!!",
        "They are so much in love in this song !!!",
        "The GREATEST  GROUP  of all time  !",
        "After a crappy 18 months ABBA come back and make us forget our worries and smile again thank you!!! ",
        "I discovered this tune in the Greatest Hits album of 1976! Still brilliant!",
        "Abba was so much fun when Agnetha was always happy and smiling all the times before the birth of her second child.  She looked so much different since then even when she tried to smile and be happy.  We really missed those days.",
        "They are amazing performers.. especially  Agnetha",
        "This music is timeless",
        "ABBA will be on a music pedestal forever️",
        "Brilliant group and Bjorn and Benny were sensational song writers.",
        "Yeah Baby! I'm here in 2024 with all you glorious ABBA fans!! Viva ABBA!",
        "So glad my childhood was filled with ABBA. \nABBA-mania was huge.",
        "Just look at the excitement and energy in this video it's fantantic",
        "It's so carefree and happy - Annafried is a delight!",
        "One of the best ABBA songs from 1975.",
        "Man, I love Abba!",
        "This is actually a mega blockbuster hit in my ears.\nSo incredibly catchy and full of sparkling energy and pure happiness.\nWhat a joy.",
        "They look like they're having so much fun in this one!",
        "Thank You For The Music ~ ABBA ~\nThank You Annifrid Lyngstad ~ Thank You Benny Andersson \nThank You Agnetha Faltskog ~ Thank You Bjorn Ulvaeus",
        "Great Pop Song...As a Bassist a perfect and Great 70s Pop Bass line....",
        "The best group that ever lived",
        "In Sweden there's a common joke that Björn looks like he should be named Benny, and Benny looks like he should be named Björn. The reason being that Björn (\"bear\") is beardless and always so happy looking, while Benny (just a jovial sounding name) has a beard."
    ],
    "Bang-A-Boomerang by ABBA official": [
        "Dont ever forget this guys where born in sweden, english wasnt their mother lenguage and they made worldwide music hits, they deserve the double of respect",
        "That must have been a fun little song to sing for ABBA. They look like they had so much fun singing it.",
        "MAN those guys wrote the most stunning melodies ever. The two girls are gorgeous and WOW could they sing ! ABBA were and will remain the high water mark for pop music",
        "I think this is their happiest song. Even the lyrics are the happiest. Even the video itself, where they seem the happiest.",
        "Biorn's eyes are full of love",
        "Fun fact: this short film was one of many directed by Lasse Hallstrom, who went on to direct such features as MR. HOLLAND’S OPUS starring Richard Dreyfuss. “Bang-A-Boomerang” was ABBA at their bubbliest.",
        "You can tell that ABBA truly enjoyed singing and performing.  Their kind of enthusiasm couldn't be faked or an act.",
        "My favorite ABBAABBA album tune !!!",
        "Musik für die Ewigkeit",
        "This is not song .\nThis is timeless masterpiece .",
        "I really doubt that any other band has as many hits as this band. This has to be one of the greatest bands in history.",
        "I feel happy when I see ABBA singing happily.",
        "This is my favorite ABBA song + video.  Pure happiness!",
        "Девушки  ОГОНЬ,а их талан и музичка ,как будто подливают масла в огонь ,и народ прлсто балдееееееееееет ,и так 40 лет уже не перестает балдеть от них.Браво ,браво ребятаЖивите,долгооооо на радость людям",
        "Frida is a treasure!…She’s bubbly, she’s pretty, and she has a great voice!..I love watching her on these videos!!",
        "AbbA forever!",
        "ABBA  rocks!",
        "I love how Bjorn looks at Agnetha.",
        "ABBA was a fantastic group",
        "Abba certainly changed pop music fantastic group.",
        "Август 2024... И так будет вечно! Мы уйдём а музыка АББА будет звучать всегда!",
        "One of their most underrated songs! God, I love it!!!",
        "This is probably the video on which ABBA is most happy. The way Björn looks at Agnetha is so sweet. <3",
        "There will never be a super group like abba ever again",
        "Back then they were 2 great couples. They truly loved each other and being together. They belonged together",
        "Underrated ABBA Classic,",
        "Такого больше не будет никогда! Наслаждайтесь 70-80 ыми !!!",
        "Lasse Hallstrom is a genius. He created an unique Abba Style.",
        "A MILLION STARS !!!!!",
        "Yup! This is definitely 70’s",
        "The wish is that this music come back. It never went anywhere. It’s here for all of us who are lucky enough to want to hear it and hear it again. If it’s good it has a life of its own. The music never left and it’s not going anywhere. Thank heaven that you got to hear it, know it,and enjoy it. It’s not going anywhere.",
        "I think part of the reason why ABBA's singing of love songs were so believable because they were real couples and they felt every note and word they sang.",
        "The way that Bjorn looks Agnetha, is so lovely",
        "Timeless. Innocent. Joyful. The Earth needs ABBA...for ever!",
        "An homage to Australia too. The country that fell in love with Abba like no other.",
        "THE BEGINNING OF A LEGEND!!!THEN ABBA WAS A SIMPLE BAND AND THEY COULD  WALK IN THE STREET,LATER THEY WOULD NEED A COMPANY OF SECURITY JUST  TO GET OUT OF THEIR HOUSES!!!ABBA FAN FOR EVER!!!",
        "What a great message to the world!",
        "Abba, you four are immortal!",
        "you can easily look in the way they smile, they look at each other, the way they enjoy his music that this guys reallly really loved music and what they were doing, money was not their goal, only make people feel good",
        "They are so adorable here!! At their peak popularity and giving so much positivity and pop ‘bang’ to their fans!!",
        "These songs sound simple but are really sophisticated; plus there is a lot of work in voices and arrangements; it's musical excellence.",
        "I can`t help smiling when I listen to ABBA",
        "You can see how much Bjorn is appreciating Agnetha's beauty and talent here and rightfully so! She was a blonde swedish Goddess",
        "Been an ABBA fan for 45 years. Out of all of their songs, I love this one the best. Love the harmony.",
        "Always the same thing, waking up after watching ABBA videos for several hours. Dangerous to start watching an Abba video, then time disappears...",
        "ever notice that Anni-Frid & Agnetha sound like an entire choir singing?  They are the only ones to ever have that ability.  The sound like 4, 5, 6 people singing at times.  Their  talent is so off the charts its not possible to describe in words.  Nobody has come even remotely close since these two.  Nobody ever will.",
        "This is definitely my favourite music group by far in all history of music",
        "They wrote this song for their Aussie fan’s as they were very successful in Australia",
        "This song is as good as big hits \nBest abba song for me",
        "This is what I've heard about the people of Sweden. They are very kind and caring people!",
        "Now im 57 I come to realize all ABBA songs were great!",
        "how many people out wish this music would comeback",
        "Agnetha is a dream.",
        "I have always thought that everything ever done by ABBA was a well written well sung song. From the up lifting Bang a Boomerang to the melodic Chiquita. No group today can compare to them. Most in the past would be hard to find.  Been a fan since I was 17 , now I’m 60. Hail \nHail to ABBA.",
        "ABBA FAN FOR EVER!!!",
        "C'était une autre époque. Une époque heureuse, insouciante avec la musique d'un groupe mythique, intemporel, inoubliable. 4 jeunes gens géniaux. Merci ABBA d'avoir égayé mes journées et de continuer à le faire. ",
        "Abba still blows me away after all these years.",
        "This is the most beautiful song from ABBA why do they not play it on the radio???? TO MUCH HAPPINESS AND LOVE IN IT???? it would clear all negativity from the world...",
        "Anni-Frid is so wow here...just wow ",
        "I love Frida’s happy smile!! ",
        "ABBA's Tribute to Their OZ Fans. A Boomerang of Love, eh Guys.",
        "ABBA are pure class.  every song they write and sing is pure quality",
        "Bands such as Abba, Queen, David Bowie, Elton John, and The Beatles changed the boundaries of music history. Such musical gold.",
        "This song used to transport me to an otherworldy place when I was a little kid. ABBA took me out of my mundane existence for 3 minutes or so.",
        "Abba really has no bad song",
        "This would have won Eurovision any year.",
        "Frida and Agnetha were so bubbly  and so fantastically beautiful  how could anyone not love them or fall for them",
        "ABBA war, ist und bleibt einzigartig! Die sensationellste Pop-Gruppe aller Zeiten! Und dieser Song gehört zu meinen absoluten Favoriten!!",
        "Ritm,antren,optimism,bang.... Emană tinerețe că voi,titanii muzicii europene.",
        "No clue why this song popped into my head today. Haven't thought of it in decades. ",
        "Oh my goodness I love this song and it is such funny and nice to hear that abba song now",
        "Abba magia lat 70-tych !",
        "ABBA: a band that marked an era. Incomparable!",
        "The likes of ABBA will never be seen again.  Pop music at it's ultimate.",
        "ABBA an iconic band.\nThey were loved by everyone.",
        "You have the most melodic music in the world, with lyrics that draw you in so intimately, and you have these great, GREAT superstars.",
        "Aaaaah look at how Bjorn looks at Agnetha, such love! LOVE Frida's dancing at 1.20!! Top tune, top band",
        "Beautiful, smiling people",
        "Ich liebe ABBA und ihre herrliche Musik, denn ABBA lebt und liebt gelebte Lebensfreude !!!",
        "They are so much in love in this song !!!",
        "The GREATEST  GROUP  of all time  !",
        "After a crappy 18 months ABBA come back and make us forget our worries and smile again thank you!!! ",
        "I discovered this tune in the Greatest Hits album of 1976! Still brilliant!",
        "Abba was so much fun when Agnetha was always happy and smiling all the times before the birth of her second child.  She looked so much different since then even when she tried to smile and be happy.  We really missed those days.",
        "They are amazing performers.. especially  Agnetha",
        "This music is timeless",
        "ABBA will be on a music pedestal forever️",
        "Brilliant group and Bjorn and Benny were sensational song writers.",
        "Yeah Baby! I'm here in 2024 with all you glorious ABBA fans!! Viva ABBA!",
        "So glad my childhood was filled with ABBA. \nABBA-mania was huge.",
        "Just look at the excitement and energy in this video it's fantantic",
        "It's so carefree and happy - Annafried is a delight!",
        "One of the best ABBA songs from 1975.",
        "Man, I love Abba!",
        "This is actually a mega blockbuster hit in my ears.\nSo incredibly catchy and full of sparkling energy and pure happiness.\nWhat a joy.",
        "They look like they're having so much fun in this one!",
        "Thank You For The Music ~ ABBA ~\nThank You Annifrid Lyngstad ~ Thank You Benny Andersson \nThank You Agnetha Faltskog ~ Thank You Bjorn Ulvaeus",
        "Great Pop Song...As a Bassist a perfect and Great 70s Pop Bass line....",
        "The best group that ever lived",
        "In Sweden there's a common joke that Björn looks like he should be named Benny, and Benny looks like he should be named Björn. The reason being that Björn (\"bear\") is beardless and always so happy looking, while Benny (just a jovial sounding name) has a beard."
    ],
    "Burning My Bridges by ABBA official": [
        "Love this peppy Country tune beat. Leave it to Bjorn he was Mega talented and could pull off anything.Too bad it wasn't finished.. I love it  anyway!!  Thanks for sharing. ️",
        "Love that!!!",
        "My favorite Bjorn lead. Sad that it was not released nor completed.",
        "They really couldnt do much more with this in July 1980 when it was recorded around the same time as The Winner Takes It All and Our Last Summer. Pleasant enough little tune but absolutely no way it lived up to what the group were creating at that time.",
        "Thx",
        "God is he singing about what he ultimately felt about Agnetha? ",
        "If anyone really is listening this was recorded 2 years ago his voice is older and he just split from Lena."
    ],
    "Cassandra by ABBA official": [
        "There will NEVER be another ABBA  The genius of Benny and Bjorn,  our beautiful girls blending like no  others ever will, so overjoyed to be here at 74 years of age and have passed their music onto my Grand and Great grandchildren who live as much as I do it will always be Thank you for the music ABBA ",
        "Well done ABBA for receiving the highest award from the King of Sweden, it is more than well deserved and about time you had something so great to show for all the love, happiness, joy and beautiful music you have given to milllions of people around the world.  There will never, ever be another ABBA.  Thank you for the music ",
        "More than 40 years supporting their music. The greatest pop band ever Never will be nothing compared to them",
        "One of the most beautiful records ever recorded and no other group could sing this song as such Abba. They certainly change music for ever, music today is just junk",
        "They sound incredible. never have two voices meshed so well.",
        "Such a powerful ballad",
        "Einfach ein wunderschönes Lied von Annifrid und Agnetha. Perfekt. ",
        "How it just builds up to that fragile ending 'Blue eyes, filled with pain.' is how you tell a story. ABBA's lyricism and gift to tell stories is severly underrated.",
        "ABBA es eterna",
        "Anni-Frid, bravo!!! Angelic voice!!! ",
        "ABBA ES TAN FANTASTICO , MAGICO , MARAVILLOSO Y ÚNICO QUE NO ES POSIBLE COMPARARLO CON NINGUNA OTRA BANDA O GRUPO DE MÚSICA POP EN TODO EL MUNDO .\nSOY FAN DE ABBA Y ESCUCHO SU MUY BELLA MÚSICA , VOCES Y CANCIONES DESDE MI NIÑEZ EN LOS AÑOS 70'S HASTA HOY , NUNCA ME CANSO DE ESCUCHAR , CADA VEZ ES COMO LA PRIMERA VEZ .",
        "Love this , Frida gets a chance to be heard, as with many songs on The Visitors love you Frida for your warmth and kindness to all fans. ",
        "I love this song. Such an under played and underrated ABBA song.",
        "This song is wonderful example of polyrhythm in a Pop song. It starts out with a 6/8 feel in the verse in the Tamborine before the disguised waltz 3/4 feel comes in for the chorus. If you want have some fun yourself, clap the one two three, waltz feel for the verse or stay with 6/8 Tamborine feel for the chorus.",
        "The day before you came/Cassandra - the best single of Abba.",
        "Abba musical Treasure of Humanity.\nGod bless them",
        "One of those hidden gems of Abba. What a wonderfull melodic piece of music. Timeless. Benny sure was gifted  as a songwriter.",
        "No matter what language the comment is in we all know what it says: we love ABBA and the music will never die",
        "Their B - Sides back then had been way much better than most of the crap that is released today, this song is stunning  !",
        "This most beautiful of women with a voice to match.",
        "I love so much ABBA. The best pop group ever",
        "Some of ABBA's songs have this strange quality where they're very upbeat but you feel an intense melancholy feeling behind them.",
        "my favorite abba song. i always loved greek and roman mythology, & cassandra's story is so sad. given the gift of prophecy but the curse that no one would believe her. warned of the trojan invasion but not believed and she and her family killed. taken as a sex slave and murdered by her kidnapper's wife. amazed that benny & bjorn wrote this so beautifully in english.\nfrida had a more outgoing & fun stage persona, & it was so wonderful to see her singing lead. rare for her in their early days. ",
        "I just love this song, I can listen it for ever",
        "THE ABBA POP GROUP IS A REAL DIVINE GIFT OF MUSIC TO HUMANITY FOR ALL TIMES .\nABBA'S THE BIGGEST ICONIC LIVING LEGEND OF ALL TIMES IN THE WORLD POP MUSIC .",
        "One of the most underrated songs of this wonderful band. \"Cassandra\" portrays the mythical War of Troy, present in \"Iliad\", from Homer. As an academic history student, I've done some research work about this wonderful song, displaying the suffering of the wonderful daughter of the king Priam of Troy, Cassandra, which beauty ressembled Aphrodite.",
        "Це просто чудово! Голоси, музика, душевний грудний тембр Фріди, паліфонія голосів Фріди з Агнетою і вічна історія Касандри!",
        "Excellent song! A great harmonic and rhythmic solution. Some kind of heavenly sound in the choruses. This is a real artwork!",
        "Абба, вы лучшие из всех групп!!  Ваши песни как бальзам!! Слушая их, душа получает истинное наслаждение!!",
        "Brilliant music ",
        "ABBA has stolen my heart.May their days be long on earth.",
        "Heed to warnings of great souls like Cassandra. War is evil. But that doesn't mean we shouldn't be prepared to fight for a rightful cause. ",
        "Great song. It was never on an original album. It was the B side of the single \"The Day Before You Came\". Even their B songs were better than most groups' best songs, so I never understood why the had songs which never officially appeared on an album.",
        "Best Group ever, The Women had such great voices, They had it all, thank you fore the Music ABBA",
        "'Cassandra' should have been an A-Side this is classic ABBA and its such a beautiful song, parts of the melody of the 1980 song 'Put On Your White Sombrero' were used in this song, it would have been included on ABBA's 9th album that was never completed.",
        "A truely wonderful SONG and sO overlooked by the vast majority of people.",
        "This is beyond tuneful -- it's bliss, musically. The story? Not so blissful. But Cassandra deserved this -- she's a prime example of what happens when somebody speaks truth and nobody listens. In fact, like  they're often lynched for it.",
        "I like Abba they can sing any song",
        "Skvělá hudba a texty od mé milované a nádherné ABBY vyrůstal jsem ,,na nich,, a doprovází mně její hudba po celý můj život Annetta,AniFrid ,Bjorn a Benny skvélé jen tak díále Milan Halfar Praha 4. Lhotka",
        "Сите членови на АББА се сместени во моето големо срце и секогаш ке останати.",
        "A B B A ...nadčasová,skvělá,milovaná a nádherná musika,texty a jejich nápady mně prostě provází po celý můj život.Miluji ABBA a nyní vydaný jejich nový písničky ...jsem v ůžasu a budu pořád .Děkuji za pěkný pohlazení po duši  Milan Halfar Praha 4. Lhotka 142 00 I LOVE Agnetha,AniFrid ,BENNY a Bjern.(dříve Vřesina u Hlučína)",
        "Timeless!... beautiful song ",
        "This is way too underrated",
        "I love love this song",
        "Amo de mais! Estou com 32 anos, comecei a ouvir música através do ABBA ️️️️",
        "Down in the street they're all singing and shouting\nStaying alive though the city is dead\nHiding their shame behind hollow laughter\nWhile you are crying alone on your bed\nPity Cassandra that no one believed you\nBut then again you were lost from the start\nNow we must suffer and sell our secrets\nBargain, playing smart, aching in our hearts\nSorry Cassandra I misunderstood\nNow the last day is dawning\nSome of us wanted but none of us would\nListen to words of warning\nBut on the darkest of nights\nNobody knew how to fight\nAnd we were caught in our sleep\nSorry Cassandra I didn't believe\nYou really had the power\nI only saw it as dreams you would weave\nUntil the final hour\nSo in the morning your ship will be sailing\nNow that your father and sister are gone\nThere is no reason for you to linger\nYou're grieving deeply but still moving on\nYou know the future is casting a shadow\nNo one else sees it but you know your fate\nPacking your bags, being slow and thorough\nKnowing, though you're late, that ship is sure to wait\nSorry Cassandra I misunderstood\nNow the last day is dawning\nSome of us wanted but none of us would\nListen to words of warning\nBut on the darkest of nights\nNobody knew how to fight\nAnd we were caught in our sleep\nSorry Cassandra I didn't believe\nYou really had the power\nI only saw it as dreams you would weave\nUntil the final hour\nI watched the ship leaving harbor at sunrise\nSails almost slack in the cool morning rain\nShe stood on deck, just a tiny figure\nRigid and restrained, blue eyes filled with pain\nSorry Cassandra I misunderstood\nNow the last day is dawning\nSome of us wanted but none of us would\nListen to words of warning\nBut on the darkest of nights\nNobody knew how to fight\nAnd we were caught in our sleep\nSorry Cassandra I didn't believe\nYou really had the power\nI only saw it as dreams you would weave\nUntil the final hour\nI'm sorry Cassandra\nI'm sorry Cassandra\nI'm sorry Cassandra\nI'm sorry Cassandra",
        "The authentic royalty of pop music in the world .\nThis song remember me the epic past history .\nThe bright's big genius minds of the ABBA members .",
        "Another incredible song from the legendary Abba. Finding songs like this is why I love YouTube!",
        "LEGENDS  ",
        "hidden gem of ABBA",
        "Abba, felicitaciones, excelente interpretación, saludos",
        "Simplesmente demais ",
        "TODAY - All hear HER !  The curse is gone.............over...we are SAVED..!",
        "Hello Everyone here,I have to contribute, too, and I write that Anni-Frid is a divine being, and together with his group ABBA and with colleagues are just beautiful and for me the best music group that I already know from the games - you can tell school years - I grew up on them, and to accompany me to their sklatby and arrangements of my entire life ....faithful subscriber and listener Milan Halfar Prague 4 Lhotka....I love Frida Anneta Bjorn Benny...GREAT arrangement",
        "This  song on the face B of the single : the day before you came ,IS a Real jewel,but so sad too.\nABBA,it was really over.",
        "i love it since i´ve heard it the 1 time. i´m   55 jears old, thats  along time, thx abba :)))",
        "Everyone is talking about Abba and how the song is beautiful, and while I agree, I think that the story behind this song (the myth of Cassandra and Apollo) is also beautiful. I love how tragic the story is, BUT this song managed to make it sad WHILE creating a melody who kind of sounds happy and calming. Definately my favorite Abba song. (Also, justice for my girl Cassandra)",
        "Voz exuberante de Frida...",
        "The lead of Frida is amazing, like always. Agneta was maybe more famous, but I like the voice of Frida more. Of course their harmonies were epic!",
        "Few groups or singers were able to bring together so many extremely good and strong songs on each album that they could create a single, in fact even today this happens, almost no one has as many fantastic songs on an album as ABBA had!",
        "Каждый мой день начинается с Кассандры. Заряд на весь день.",
        "My favorite from abba!!!",
        "this is the one song were the voices of A+A melt in a perfect way together",
        "АББА ве сакам ги сакам вашите изведби на вашите прекрасни песни кои ги слушам секој ден и секогаш додека сум жива је ги слушам",
        "Это шедевр.",
        "Aj lavju veri mach veri veri mach Agneta Ani Frid Beni Brion vie ste naj uspeshni na\nsvetot na site vreminja vashite pesni mi pridonesoa mir vo dushata za cel zivot.\nTenkju veri much.",
        "ABBA sempre ABBA, é dificil dizer qual a musica mais bonita, todas. são;.",
        "One od their best ",
        "Amazing ",
        "Best b side ever produced",
        "100% TALENT , BEAUTY , HARMONY AND PURE HIGH QUALITY POP GROUP AND MUSIC FOREVER .\nTHE MOST WONDERFUL SONGS AND VOICES .\nABBA YOU'RE THE BIGGEST POP BAND OF ALL TIMES IN THE WORLD .\nI LOVE ABBA AND THOSE TWO VERY BEAUTIFUL , ENCHANTING AND TALENTED LADIES SINGERS .\nTHANK YOU ABBA SO MUCH FOR THE VERY BEST TIMELESS CLASSICS POP MASTERPIECES .",
        "2:19 is amazing!!",
        "Fernando who? When this banger existed ",
        "Love it ",
        "Wow my name is Cassandra and yet all of this sounds so familiar TROY!!!!!",
        "Reminds me to the movie \"Cassandra's Dream\". This song would perfectly match the mood of that movie besides its title.",
        "AAAAAAAAAH ABBA SUNG MY NAME",
        "sehr schön",
        "Great!",
        "Danke. Ich kenne eine Cassandra. Ich dachte, sie wäre eine Freundin. Im Nachgang bleibt nur zu sagen: Ich wünsche ihr alles erdenklich Gute. Für sie und ihre Familie.",
        "Wow. Bjorn  went to the age of mythology and put to words what  Cassandra  may have felt.",
        "Named my beautiful cat after this song xo",
        "Обожаю!",
        "I like The actions that went with The song",
        "What words can you use to describe how beautiful this song is, only Abba can sing such a beautiful song such as this. No other girl group has come close to Abba not even the Spice Girls",
        "Very ABBA no questions",
        "This song portrays the Cassandra Metaphor ",
        "Tão linda!",
        "",
        "Frida's finest moment.",
        "Omg I can’t be the only one who came here after listening to Taylor Swift’s “Cassandra”\nI knew this song reminded me of something, but I didn’t know what at the time… then I was like: ABBA made a song with the same title and the lyrics are so similar. I’m now sure that Taylor either got inspiration from ABBA or just the overall mythology behind Cassandra herself. Could be both, though! I’m not complaining one bit btw because Taylor is my favorite solo artist and ABBA is my favorite band, so this is a very interesting piece of information to me :)",
        "Hello Everyone here,I have to contribute, too, and I write that Anni-Frid is a divine being, and together with his group ABBA and with colleagues are just beautiful and for me the best music group that I already know from the games - you can tell school years - I grew up on them, and to accompany me to their sklatby and arrangements of my entire life ....faithful subscriber and listener Milan Halfar Prague 4 Lhotka....I love Frida Anneta Bjorn Benny...GREAT arrangement",
        "Merece todos os likes do mundo!",
        "Gr8 Song this one. Andrew Lloyd Webber & Tim Rice wud be proud to have Written this Song.",
        "",
        "Thank you for your post",
        "Abba Comeback please",
        "Cute song.",
        "Remember my birth home",
        "lagu cakep gini kenapa underrated ya, cakep bgt coiii"
    ],
    "Chiquitita by ABBA official": [
        "4:46 the whole song is amazing but I cannot get over this piano",
        "the last part of the piano is so indescribably magnetic. it sounds like happiness feels",
        "The piano at the end Is just pure magic",
        "The fact that ABBA gave this song to UNICEF and that they have raised several million over the years from this song to help small children makes this already wonderful song even more emotional. ABBA will probably remain unique in music history forever.",
        "I could listen to that piano at the end for hours, it’s so beautiful and happy but there’s also something in it that makes me want to cry.",
        "Life is kicking my ass right now, and no joke this song is helping me get though it, soothing me through my stress and worry. I swear I’m convinced ABBA is a religious experience ️",
        "the ending is literally everything. it sounds and feels like happiness and living the best live.",
        "This is the kindest and most supportive song of all times. It makes my cry from sadness, hope and happiness it evokes at the same time. Incredible",
        "when your listening at then the last minutes of piano is so wonderful.....",
        "A song that no one else can sing like ABBA",
        "\"You'll be dancing once again and the pain will end\"\n\nIt touched my heart. I know Abba got the fame they deserved, but I still think they are underrated. Their composition and arrangements are in another whole level. Look how colorfull their songs are. Same level as Beatles...? (Ready for the critics)",
        "Lyrics \n\nChiquitita, tell me what's wrong\nYou're enchained by your own sorrow\nIn your eyes there is no hope for tomorrow\nHow I hate to see you like this\nThere is no way you can deny it\nI can see that you're oh so sad, so quiet\n\nChiquitita, tell me the truth\nI'm a shoulder you can cry on\nYour best friend, I'm the one you must rely on\nYou were always sure of yourself\nNow I see you've broken a feather\nI hope we can patch it up together\n\nChiquitita, you and I know\nHow the heartaches come and they go and the scars they're leaving\nYou'll be dancing once again and the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky and shining above you\nLet me hear you sing once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita\n\nSo the walls came tumbling down\nAnd your love's a blown out candle\nAll is gone and it seems too hard to handle\nChiquitita, tell me the truth\nThere is no way you can deny it\nI see that you're oh so sad, so quiet\n\nChiquitita, you and I know\nHow the heartaches come and they go and the scars they're leaving\nYou'll be dancing once again and the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky and shining above you\nLet me hear you sing once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita",
        "The piano at the end always got me... ",
        "CHIQUITITA\nChiquitita, tell me what's wrong\nYou're enchained by your own sorrow\nIn your eyes there is no hope for tomorrow\nHow I hate to see you like this\nThere is no way you can deny it\nI can see that you're oh so sad, so quiet\nChiquitita, tell me the truth\nI'm a shoulder you can cry on\nYour best friend, I'm the one you must rely on\nYou were always sure of yourself\nNow I see you've broken a feather\nI hope we can patch it up together\nChiquitita, you and I know\nHow the heartaches come and they go and the scars they're leaving\nYou'll be dancing once again and the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky and shining above you\nLet me hear you sing once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita\nSo the walls came tumbling down\nAnd your love's a blown out candle\nAll is gone and it seems too hard to handle\nChiquitita, tell me the truth\nThere is no way you can deny it\nI see that you're oh so sad, so quiet\nChiquitita, you and I know\nHow the heartaches come and they go and the scars they're leaving\nYou'll be dancing once again and the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky and shining above you\nLet me hear you sing once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita",
        "この曲口ずさみながら辛さ耐えて子供のために頑張ってたんだなあいつ",
        "4:46 the piano part is wonderful, it makes you think about life and how great it is.",
        "hear me out , not only the last part of the piano is magical, BUT EVEN THE WHOLE SONG!",
        "My mom had cancer arround 2012-2014 and she was a happy person, dynamic. But when she got sick in her face I only saw sadness and depression, so when I heard the parts that says \"You'll be dancing once again and the pain will ends\" I imagine here dancing, singing, laughing again not in this live, in heaven, she is now with our God without grievings, just like I imagine her when I saw in her sickness. It may be that I never had hope that she would overcome cancer, but I always had the hope that she would be happy as I know she is now, not earthly but her soul is.",
        "Лучшая группа всех времен! Вместе с вами поет душа!",
        "Abba is a band that transcends generations. It's impossible to not like them",
        "There aren't nearly enough songs with a blistering piano outtro these days.  Benny is a musical genius.",
        "It's sad that it ended and there won't be anyone making songs like this.",
        "Once again a masterpiece, which shows the high class of their voices ....perfect and alive for ever",
        "Every aspect of this song is so perfect, so incredibly harmonious!!!",
        "People are complaining that people are now finding this song and the ending on tiktok, but as someone who has listened to this song and the ending and has loved it so much for over two years now, i am so happy people are finding joy in it as I did the first time two years ago.",
        "That last piano solo hits soooo hard... Man, I can't believe how powerful music can be",
        "Music of that time... forever.",
        "Lyrics \n\n\n[Verse 1]\nChiquitita, tell me what's wrong\nYou're enchained by your own sorrow\nIn your eyes, there is no hope for tomorrow\nHow I hate to see you like this\nThere is no way you can deny it\nI can see that you're oh, so sad, so quiet\n\n[Verse 2]\nChiquitita, tell me the truth\nI'm a shoulder you can cry on\nYour best friend, I'm the one you must rely on\nYou were always sure of yourself\nNow, I see you've broken a feather\n(How it hurts to see you cry)\n(And how it hurts to see you sad)\nI hope we can patch it up together\n\n[Chorus]\nChiquitita, you and I know\nHow the heartaches come and they go\nAnd the scars they're leaving\nYou'll be dancing once again\nAnd the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky\nAnd shining above you\n(Even though you cry)\n(The sun is shining in the sky)\nLet me hear you sing once more\n(So let me hear you sing some more)\nLike you did before\n(The way you used to do before)\nSing a new song, Chiquitita\nTry once more, like you did before\nSing a new song, Chiquitita\n\n\n[Verse 3]\nSo the walls came tumbling down\nAnd your love's a blown-out candle\nAll is gone, and it seems too hard to handle\nChiquitita, tell me the truth\nThere is no way you can deny it\nI see that you're oh, so sad, so quiet\n\n[Chorus]\nChiquitita, you and I know\nHow the heartaches come and they go\nAnd the scars they're leaving\n(You and I, we know)\n(How all the heartaches come and go)\nYou'll be dancing once again\n(You’ll be dancing once again)\nAnd the pain will end\n(And all the pain you take will end)\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky\nAnd shining above you\n(Even though you cry)\n(The sun is shining in the sky)\nLet me hear you sing once more\n(So let me hear you sing some more)\nLike you did before\n(The way you used to do before)\nSing a new song, Chiquitita\nTry once more, like you did before\nSing a new song, Chiquitita\n\n[Outro]\nTry once more, like you did before\nSing a new song, ChiquitiA",
        "[Verse 1]\nChiquitita, tell me what's wrong\nYou're enchained by your own sorrow\nIn your eyes, there is no hope for tomorrow\nHow I hate to see you like this\nThere is no way you can deny it\nI can see that you're oh, so sad, so quiet\n\n[Verse 2]\nChiquitita, tell me the truth\nI'm a shoulder you can cry on\nYour best friend, I'm the one you must rely on\nYou were always sure of yourself\nNow, I see you've broken a feather\n(How it hurts to see you cry)\n(And how it hurts to see you sad)\nI hope we can patch it up together\n\n[Chorus]\nChiquitita, you and I know\nHow the heartaches come and they go\nAnd the scars they're leaving\nYou'll be dancing once again\nAnd the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky\nAnd shining above you\n(Even though you cry)\n(The sun is shining in the sky)\nLet me hear you sing once more\n(So let me hear you sing some more)\nLike you did before\n(The way you used to do before)\nSing a new song, Chiquitita\nTry once more, like you did before\nSing a new song, Chiquitita\n\n[Verse 3]\nSo the walls came tumbling down\nAnd your love's a blown-out candle\nAll is gone, and it seems too hard to handle\nChiquitita, tell me the truth\nThere is no way you can deny it\nI see that you're oh, so sad, so quiet\n\n[Chorus]\nChiquitita, you and I know\nHow the heartaches come and they go\nAnd the scars they're leaving\n(You and I, we know)\n(How all the heartaches come and go)\nYou'll be dancing once again\n(You’ll be dancing once again)\nAnd the pain will end\n(And all the pain you take will end)\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky\nAnd shining above you\n(Even though you cry)\n(The sun is shining in the sky)\nLet me hear you sing once more\n(So let me hear you sing some more)\nLike you did before\n(The way you used to do before)\nSing a new song, Chiquitita\nTry once more, like you did before\nSing a new song, Chiquitita\n\n[Outro]\nTry once more, like you did before\nSing a new song, Chiquitita",
        "Какой кайф слушать такие песни, и вспоминать свою молодость, которая к сожалению давно прошла. Хоть бы на неделю лет на сорок назад.",
        "My favorite ABBA song.  Amazing how they can take a subject like debilitating depression and turn it into something so joyful and full of hope.",
        "that ending piano is truly something else. it cannot be explained, such a combination of happiness and sadness.",
        "Abba is \ntimeless.",
        "Come on, folks. That harmony will never be repeated",
        "I'm in my 70s, and this is still one of my favorite songs. It holds up so well!!",
        "I haven't been feeling good lately. I have the sensation that i can't cry even though i want to so bad. \nEverytime i hear this song it makes me tear up and I feel loved and heard. Thank you so much ABBA. I wasn't even born when this song came out, but your music and your love transcends time ️",
        "This song always feels like it’s telling me, “You can cry. No one here is going to judge you. You have the right to feel, dear.” It’s nearly impossible for me to hold back tears when listening. Especially the piano at the end, my goodness! Thank you, ABBA. You always bring me comfort.",
        "Esto te da una sensacion indescriptible, como si sufrieras de nostalgia y enojo por haberte perdido esa hermosa epoca ",
        "Abba: makes an incredible song with beautiful lyrics\n\nTikTok: ",
        "The piano.  The guitar.  The vocal.  Just everything about this song is beautiful.",
        "I'm so glad that ABBA is getting more recognition from younger audiences! \"Chiquitita\" is one of their most iconic songs along with \"Dancing Queen\" and \"Mamma Mia\", but do check out the rest of their discography!",
        "the piano is literally just. amazing.",
        "Abba - Chiquitita Lyrics : Chiquitita, tell me what's wrong\nYou're enchained by your own sorrow\nIn your eyes there is no hope for tomorrow\nHow I hate to see you like this\nThere is no way you can deny it\nI can see that you're oh so sad, so quiet\nChiquitita, tell me the truth\nI'm a shoulder you can cry on\nYour best friend, I'm the one you must rely on\nYou were always sure of yourself\nNow I see you've broken a feather\nI hope we can patch it up together\nChiquitita, you and I know\nHow the heartaches come and they go and the scars they're leaving\nYou'll be dancing once again and the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky and shining above you\nLet me hear you sing once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita\nSo the walls came tumbling down\nAnd your love's a blown out candle\nAll is gone and it seems too hard to handle\nChiquitita, tell me the truth\nThere is no way you can deny it\nI see that you're oh so sad, so quiet\nChiquitita, you and I know\nHow the heartaches come and they go and the scars they're leaving\nYou'll be dancing once again and the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky and shining above you\nLet me hear you sing once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita",
        "I had the fortune to be a teenager at that time!!",
        "In my opinion the best song ABBA has ever released",
        "This song is about to be played at my mother's funeral  she absolutely adored ABBA ",
        "I'm crying. I missed this song, and by that, the nostalgic feeling of happiness. Man, days were simpler and happier way back. ",
        "I'm still listening and crying. Then I was a child, my grandparents were alive, my mother...... Memories.... And this music.....",
        "THE HARMONY OF AGNETHA & ANNA FRIDA IS ABSOLUTELY FANTASTIC!!!! ONE OF MY ALLTIME FAVORITE GROUPS !!!!! SONGS WILL LAST 100 YEARS FROM NOW !!!!!!!",
        "Lyrics:\nChiquitita tell me what's wrong\nYou're enchained by your own sorrow\nIn your eyes there is no hope for tomorrow\nHow I hate to see you like this\nThere is no way you can deny it\nI can see that you're oh so sad, so quiet\n\nChiquitita, tell me the truth\nI'm a shoulder you can cry on\nYour best friend, I'm the one you must rely on\nYou were always sure of yourself\nNow I see you've broken a feather\nI hope we can patch it up together\n\nChiquitita, you and I know\nHow the heartaches come and they go and the scars they're leaving\nYou'll be dancing once again and the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky and shining above you\nLet me hear you sing once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita\n\nSo the walls came tumbling down\nAnd your love's a blown out candle\nAll is gone and it seems too hard to handle\nChiquitita, tell me the truth\nThere is no way you can deny it\nI see that you're oh so sad, so quiet\n\nChiquitita, you and I know\nHow the heartaches come and they go and the scars they're leaving\nYou'll be dancing once again and the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky and shining above you\nLet me hear you sing once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita",
        "I have to admit this band is LEGENDARY",
        "The piano guy did wonders. You'll get goose bumps . Nostalgic.",
        "I pride myself in finding gems and I can’t believe I missed this one. It’s perfect ",
        "I swear the piano at the last part gives life",
        "Even if you don’t like ABBA, the ending is absolutely incredible. This is just talent",
        "This song literally pulled me out of my depression.  It was wonderful to finally see the light again after so many years of struggling",
        "ABBA is the best! Number 1 on my Spotify wrapped since 2020.",
        "Mom passed away this morning…this was her favorite song.  A toast to the best mom ever…love you mom",
        "This song has carried me through some of the darkest, loneliest moments of my life. “Chiquita, you and I cry, but the sun is still in the sky and shining above you” if you’re reading this, just know there will be both good & bad days. Just keep your head up xx",
        "In a terrible postpartum depression, this song helped me like you can't imagine, to the point of asserting my own life.\n  Thank you ABBA ",
        ".... The unearthly outstanding ability from Agnetha, throughout all of her breathtaking performances, to sing directly into ones heart....     ...and in harmony with the jUst as fabulous singing Annifrid even more...    These women, AND the band as a whole, will never be surpassed!",
        "My grandfather used to sing this to my mother when she was younger.",
        "Doesn't matter if you like ABBA or not, that ending is something else",
        "This is the happiest sad song ever created",
        "These harmonies are simply outstanding!",
        "The vocal range, harmonies, and music composition, in this song make it one of my favourites along with \"The Winner Takes It All \". From an Aussie that will never forget ABBA.",
        "Someone said there won't be anyone making songs like this again,well here we go again,the greatest comeback!!",
        "It’s 2021 December, and I’m still listening to it. This song never gets old.\n\nEdit: omg ty for 1k likes. I’ve never had more than 200 likes. TYSM",
        "В чём секрет этой прекрасной группы ? Может в том что они хороши для души?",
        "Why does this song make me cry and feel fantastic at the same time??  LOVE ABBA forever.",
        "100% pure talent,\n101% pure music\n\n\nOld, but gold.",
        "People on TikTok are just mixing this song with different songs, but they need to hear the whole song! It's just amazing",
        "4:48 The best part is when the music comes back at the end --- I can't help but start dancing around",
        "When u start listening to one ABBA song, believe me, it will be followed by a chain of ABBA songs",
        "No other group does it like ABBA. The voices these group have is just phenomenal.",
        "and now this song will be a dandadan reference",
        "For English being their second language they harmonized their voices perfectly. I love Abba",
        "There will never be another group like Abba. Very artistic, unique, wonderful, pure gold. The piano playing at the ending just makes the song more amazing. Keeps me speechless. Miss this kind of music. It will forever be in my heart. 70s and 80s music will always be my top favorite era.\n\nThanks for the comments. Do appreciate the likes too ;0)",
        "I used to think this song was annoying as a kid when my grandpa loved it... Now hes gone and im an adult and I understand each note and each feeling in this song... And I can't avoid sheding a tear when I hear it... I love ABBA ",
        "Dandadan!!!!",
        "abba is just so nostalgic. thank you for the music. honey honey. it’s just summer days with my parents playing this and dancing with their friends when i was little.",
        "4:49 The most beautifully majestic OUTRO ever CREATED of all TIME",
        "can we just appreciate the whole song not just the ending",
        "Agnetha is absolutely enchanting. Look at her eyes. Magical lady with a gorgeous voice.",
        "My mother use to sing this song to me when I was a young teen as I battled deep sadness & depression. May she rest in peace in heaven forever until we meet again, you will see. The memories of your singing keeps me going.",
        "4:45..........take your joy....",
        "That piano so lovely, the voices in the background, every detail fits so perfectly, this is real art!!!",
        "Music for all the times .\nWell done ABBA genius .",
        "4:51 they are so genius in created music",
        "Agnetha's voice and Frida's complimented each other to create the most beautiful blending in all of music industry anywhere in the world.",
        "Just incase anyone wants to sing along \n\nChiquitita, tell me what's wrong\nYou're enchained by your own sorrow\nIn your eyes there is no hope for tomorrow\nHow I hate to see you like this\nThere is no way you can deny it\nI can see that you're oh so sad, so quiet\n\nChiquitita, tell me the truth\nI'm a shoulder you can cry on\nYour best friend, I'm the one you must rely on\nYou were always sure of yourself\nNow I see you've broken a feather\nI hope we can patch it up together\n\nChiquitita, you and I know\nHow the heartaches come and they go and the scars they're leaving\nYou'll be dancing once again and the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky and shining above you\nLet me hear you sing once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita\n\nSo the walls came tumbling down\nAnd your love's a blown out candle\nAll is gone and it seems too hard to handle\nChiquitita, tell me the truth\nThere is no way you can deny it\nI see that you're oh so sad, so quiet\n\nChiquitita, you and I know\nHow the heartaches come and they go and the scars they're leaving\nYou'll be dancing once again and the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky and shining above you\nLet me hear you sing once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita",
        "I have fond memories of fighting an extraterrestrial crab whilst singing this banger ",
        "Chiquitita, tell me what's wrong\nYou're enchained by your own sorrow\nIn your eyes there is no hope for tomorrow\nHow I hate to see you like this\nThere is no way you can deny it\nI can see that you're oh so sad, so quiet\n\nChiquitita, tell me the truth\nI'm a shoulder you can cry on\nYour best friend, I'm the one you must rely on\nYou were always sure of yourself\nNow I see you've broken a feather\nI hope we can patch it up together\n\nChiquitita, you and I know\nHow the heartaches come and they go and the scars they're leaving\nYou'll be dancing once again and the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky and shining above you\nLet me hear you sing once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita\n\nSo the walls came tumbling down\nAnd your love's a blown out candle\nAll is gone and it seems too hard to handle\nChiquitita, tell me the truth\nThere is no way you can deny it\nI see that you're oh so sad, so quiet\n\nChiquitita, you and I know\nHow the heartaches come and they go and the scars they're leaving\nYou'll be dancing once again and the pain will end\nYou will have no time for grieving\nChiquitita, you and I cry\nBut the sun is still in the sky and shining above you\nLet me hear you sing once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita\nTry once more like you did before\nSing a new song, Chiquitita",
        "My mother used to call me \"Chiquitita.\"  Our family is Mexican American.  She went to Heaven in March 2014.  I miss her so very much.  I feel like she is talking to me in through this song.   It makes me cry so hard every single time that I hear it.",
        "My favourite Abba’s song.  I’m not able to express how beautiful this song is. Thank God for ABBA. ",
        "This song always makes me cry for some reason. There is a certain sadness in Agnetha's eyes which is heartbreaking to watch.",
        "My mother would sing this to me when I was upset.\n\nAnd in turn, I would sing this to my daughter when she was little and she got upset.\nThis is the most beautiful song ever written, and I often cry when I listen to this song and think of my daughter when she's sad.\n\nSuch a wonderful and beautiful song. Masterfully written, full of heart, and filled with both heartache and hope.",
        "Such powerful, distinctive, unique and enjoyable vocals.",
        "To everyone who are looking the best part 4:44",
        "One guitar + one piano + two vocals + one giant snowman = masterpiece! Love it"
    ],
    "Crazy World by ABBA official": [
        "Hole in your soul? Fill it with ABBA ",
        "This song is magical and I don’t know why it’s not famous",
        "I don’t know how so many people don’t know about this song - ever since I heard it has become my favourite song. Singing along to this when I’m alone in my room just does something to me. I will never Not love this song. Wish I was alive when they used to do concerts, as being able to see this song in person would have been such a magical experience.",
        "The first time I listened to this song I couldn't believe it was ABBA. I had to check out the album to make sure. It's probably the only song in which Bjorn is the lead and it sounds fantastic!",
        "This song is so special to me for many reasons. It's such a beautiful song I've been listening to for over 40 years and never get tired of hearing!!",
        "Yes,the world has gone crazy.",
        "I loved playing abba music",
        "One of best song of Björn,i just happen to hear that 1st time since last week,what i came to know that it was a unreleased track of ABBA album.got addicted  to his song and his voice..i am ABBA fan since start when i was born in 1982.",
        "Such a great bass line",
        "Extremely Underrated song",
        "I added this song to his playlist and he loves it therefore I love this song even more now.",
        "That song reminds me of my childhood. I can almost see in front of my eyes my old gramophone and the record on it, turning.. ",
        "Я фанат аба у меня есть альбомы, а эту песню я услышал впервые. Она великолепна.",
        "In the United States of America, this selection was the song on Side B of the \"Money, Money, Money\" 45 rpm single from 1977.",
        "Wow this song was way ahead of its time ",
        "Tolles Lied, perfekte Drums",
        "The world is crazy, people can’t get along and let their difference go, everything is a threat, and everyone is sad, or ignoring the problems. We all need more love and compassion, it’s a crazy world",
        "most favorite song",
        "This is such a beautiful deep cut?!?",
        "I love this song and I love abba songs",
        "Even more true today , than in 1976.",
        "Found it:)",
        " Love the lyrics, and can picture it in a soundtrack",
        "I used to listen to this song a long time ago and it's  great to find it again!",
        "Crazy banger",
        "I haven’t heard this since the 70s. I had this on single I think.",
        "It was on the b side when Abba brought out Money Money Money on a UK 45!!",
        "  #ABBA  #CrazyWorld",
        "I was out with the morning sun\nCouldn't sleep, so I thought I'd take a walk\nI was thinking of you and me\nAnd I went to your house, 'cause I had to talk\nI could hardly believe my eyes\nWhen I saw this guy closing your front door\nHad the feeling of emptiness like I never had before\nAnd I closed my eyes, will you leave me girl\nThen I realized, it's a crazy world\n\nAs he disappeared in his car\nI was stunned, and I didn't know what to do\nEverything I had ever dreamed\nEverything in my life's part of you\nAnd I just couldn't move my feet\nSo I stood on the pavement as you came out\nYou acted as you didn't know what it was all about\nAnd I closed my eyes, will you leave me girl\nThen I realized, it's a crazy world\n\nBaby, how could you do it\nYou just told me lies\nAnd you meet behind my back\nWith other guys\nBaby, how could you tell me\nThere was only me\nI was stupid to believe you\nI was blind but now I see\n\nThen you smiled and you took my hand\n\"There is something\", you said, \"that you may not know\nThere's a couple of men in my life\nAnd one of them is my brother Joe\nHe's been gone for a long, long time\nBut he's back and I think he's gonna stay\nYou'll be seeing a lot of him, he's so nice in every way\"\n\nThen I closed my eyes, never leave me girl\nThen I realized, it's a crazy world\nSo I closed my eyes, never leave me girl\nThen I realized, it's a crazy world\nSo I closed my eyes, never leave me girl\nThen I realized, it's a crazy world",
        "As I recall this song was the B side to one of the other songs off the Album, but that being true I must question that there were any B songs on this album, yes it was really that good all of it.",
        "just one of many great songs of ABBA that never got to see the light of day for whatever reason that only Benny and Bjorn know. If there's one fault they have is being to picky. The songs they write are for us the fans, not for themselves. we don't care if there's a tiny flaw in the song nor would we even notice it, just give us the song.",
        "Эта песня по стилю очень напоминает группу America.",
        "Is there any EXPERT please? I wonder what type of voice Bjorn is? I don't think he was baritone, but I don't actually know what does it mean. I would say tenor, but... I am not a musician :) Thanks",
        "",
        "It shame that they don’t make good music anymore",
        "Song “what’s up with the world?”https://youtu.be/xPqeN2TGd4I",
        "Who's here from the \"The Tortured Poets Department\" ????",
        "Это моя молодость моя юнность время когда не подозревая я жила в раюу",
        "My favourite song"
    ],
    "Givin' A Little Bit More by ABBA official": [
        "I did this extended version, along with every other track on ABBA Undeleted way back in 1994...just with a CD recorder and a \"pause\" button!    -  Alex",
        "Possibly the best remix of the 'Givin A Little Bit More' snippet from ABBA Undeleted ever created on youtube.",
        "Bjorn you are still the amazing and awesome legendary songwriter ever  and still handsome at 78  keep.up the great songs that you and Benny write absolute legends Love u Heaps ",
        "What a beautiful song have heard it before the lyrics are so memorable and will always be treasured by all the Abba fans around the world Thank u Abba Lots and Lots of Love to you All ",
        "J'aime beaucoup cette chanson et les photos du groupe ABBA qui l'accompagne sont très belles ",
        "A beautiful song that I listen to for the first Time  ABBA everlasting great",
        "I wish this song had been developed and completed. There is a lot of potential here.",
        "A brilliant ABBA melody so wish it had been on voyage",
        "This is a great song. To bad they never officially released it. Very catchy and fun to listen too.",
        "Great song... so many great elements to it! Love the lyrics! \nAlways enjoy all the Fantastic pics! \nHappy Tuesday ️ thank you for sharing! ",
        "Wonderful song ! Fantastic pics ! Thanks for sharing ️️",
        "I'm imagining Agnetha and Frida singing new verses in addition to Björn's singing current verses. A great band like ABBA has more to offer than released, and not complaining.",
        "Never heard before...thanks",
        "This is so good Elin  :) Should have got a proper release \nFab pics of Björn.",
        "Howdy Elin. I've always liked Bjorn's singing. One of my favorites is Two for the Price of One.",
        "Parts of the song were re-used in the 1987 song 'TLC' by Gemini.",
        "Hermosa canción con una buena melodía que no figura en los discos de ABBA.",
        "gute alte schöne Zeit komm zurück",
        "An extended version of the demo was NOT released in 1994 as part of \"ABBA Undeleted\". On Undeleted you only hear a snippet of the song. An Abbafan copied some parts of the song to make a longer version of it :-)",
        "Една богиня, до нея още една, агнета, фрида,",
        "I think this is great with Bjorn singing it, as much I love the ladies singing anything.",
        "Got quiet a Beatles vibe to it",
        "Bjorn Ulvaeus - the Norse god of pop music.",
        "А, още и боговете , бьорн и бени,",
        "The vocals should always be the girls.",
        "АВВА , all memВеrs are cosmopolitans."
    ],
    "Gonna Sing You My Lovesong by ABBA official": [
        "You are torn between wanting more people to hear and appreciate this track and at the same time keep it hidden for true ABBA lovers as our little secret.",
        "ABBA have so many great deep cuts. This is definitely one of them.",
        "Heard it for the first time when I was 14 (1974) and still enjoy it at 63.",
        "Роскошная композиция! Здорово АВВА!",
        "...the best of ABBA, how can those days be relived, when the world was innocent..",
        "beautiful song, ABBA in their early stages :)",
        "Every member contributes to the peak of their considerable ability, but this song deserves a huge shout out to Benny. Melodically and rythmically a masterclass of songwriting!",
        "Beautiful melody, one of my favorite songs from them. Such a underrated song...",
        "Every ABBA song is a miracle",
        "J'aime beaucoup la chanson de Frida ,elle est vraiment magnifique , elle a une très jolie voix",
        "wonderful and hugely underrated song really should have been an a side",
        "A lot of the lower Vocal energy you hear from ABBA was from Frida. Agnetha handled most of the high Vocals that are gloriously high frequencies. The rich lower tone from Frida's wonderful vocal gave the solid foundation for the trademark ABBA vocal Harmonies. ABBA really nailed it not only with their crazy Song Writing Talent, they nailed it too with the 2 amazing Female Vocalists who were born to perform and record together. \n\nTheir vocals were so matching, they are like a Glove covering the Hand. It fits perfectly!",
        "You say she's been mad at you\nThen you say you'll be patient, ooh\nStill I see that she makes you blue\nCome on, I'll give you consolation\nGonna sing you my love song, gonna bring you some light\nWanna make you feel happy every day of your life\nGonna sing you my love song, gonna make it all right\nYou're all I ever need, my darling\nJust to be where you want to be\nSo much fun we could have then, hmm\nTo be yours for eternity\nWhat a miracle to happen\nGonna sing you my love song, wanna sing it for you\nGonna give you sweet loving, gonna give myself too\nWanna sing you my love song, when I think about you\nI know she doesn't make it easy\n'Cause you don't please her like you please me\nYou're my life, you're my angel\nYou're my first, you're my last\nWould she care if you lingered\nFor another night\nWant to hold you tight\nWe could make it right\nGonna sing you my love song, gonna bring you some light\nWanna make you feel happy every day of your life\nGonna sing you my love song, gonna make it all right\nI know she doesn't make it easy\nGonna sing you my love song, gonna sing it for you\nGonna give you sweet loving, gonna give myself too\nWanna sing you my love song, when I think about you\nYou're all I ever need, my darling\nAnd I would love to sing my love song\nFor you",
        "Good God man, another pop gem...well done ABBA....LOVE IT!",
        "Timeless!... thank you ",
        "Love the drums! One of the very few songs, where Benny wrote the lyrics.",
        "I love this song so much!",
        "Nostalgic ",
        "this song must have more visibity",
        "Although this song is good  things only got better and better for ABBA through the 70's and beyond  ",
        "A side? Should have been NO1 world over!! Very very special!!!",
        "ABBA is ABBA.,!!!!!!",
        "Benny & Frida met in Malbo, Sweden in 1969 in a restaurant. Both the Hep Stars (Benny) and Charlie Norman Band/Show (Frida) wound up at same restaurant.\nBenny & Frida fell for each other. BUT!!! Benny had a girlfriend. \nFrida thought Benny's gf was not right for him.",
        "Неизгладимое впечатление произвели на меня АББА этой песней в 1978 году!",
        "Congratulation my sweet and beautiful Lady.",
        "Mi hermano consiguió ese álbum, en cassette, y lo gastamos de tanto escucharlo! \nIncreíble canción!!!",
        "I love your song do that and we are together the rest of our lives.",
        "One of their best songs , even if it's a step behind \"Fernando\".",
        "This is Frida's first ever lead vocal on ABBA.\nA bit weird that it took two albums to see it, but then again, the mere concept of Agnetha and Frida being lead vocalists at all wasn't set in stone up until the third album.",
        "Linda, linda.",
        "For my best male friend t.j love you heaps ️",
        "",
        "Time Travelers ",
        "ANNAFRID (Dame)",
        "Can imagine some boyband type group cover this",
        "They are the Swedish (and somehow European) Fleetwood Mac to some extent",
        "IS THAT NAPOLEON????"
    ],
    "Hamlet III by ABBA official": [
        "If ABBA released this, Just Like That, Sang til Goral and Hovas Vittne all together on an EP I could die knowing my ABBA life was complete.",
        "Love the Pics of these beautiful people who gave us Love and Joy with the Best feel good Music ever!!\nVive ABBA  !",
        "the second part always makes me feel better for some reason always. this song is so good ",
        "Yo soy fan de ABBA desde 1979, lo escuchaba en el colegio 3ro de secundaria, recuerdo primero escuché el LP en castellano, y su música la daban en un programa de TV , Disco Club, (único programa de ese estilo en Perú). Tiene en general muchos aires a la música cantada de Mike Oldfield, me encanta, por algo Mike Oldfield grabó en el QE2 un cover de ABBA, Arrival. Lo máximo. Desde ahí comencé a juntar todo lo que podía de ABBA, Gracias por su Música.",
        "Great slide show, wonderful pictures. I love \"Hamlet III\".",
        "Why can't I hear anything?",
        "There are two versions used in the UNDELETED medley. I would like to see if someone can post a video with both played at the same time.",
        "very nice",
        "Very nice!",
        "Абба, същества, от, друго, измерение, добре, че, ви, има",
        "No sound."
    ],
    "Happy Hawaii by ABBA official": [
        "I really don't know what to say about ABBA, every time when I play or hear this song, I'll be speechless and heartbroken...there will never be a group like this  one.... NEVER EVER...",
        "I love ABBA. I wish that they would come back. But if not, then their music will last forever. Thank you for the music, ABBA!",
        "Two songs for the price of one.  Brilliant.",
        "Von herz Ich liebe ABBA für alle ewigkeit !!!\nLang lebe ABBA Pop Musik in der Welt !!!\nVielen Dank Liebe ABBA Für Immer .",
        "This is the first song that I ever heard from ABBA. I didn't know who they were at the time but I absolutely loved it. A timeless joy for me. ",
        "Нема на светот ниту едни други како нивните гласови нивните изведби нивните песни и нај многу нивното скромно однесуване никогаш нема да бидат заборављени . Секогаш си ги слушам.",
        "The incredible greatness and high quality , perfection and magic beauty of the ABBA music .\nThis is a unforgettable experience of life .",
        "\"Why did it have to be me\"-core with additions and alterations.",
        "Listened to thousands of times, played in stages hundreds of times, STILL never get tired of this song...What a character this song has!!!",
        "Beautiful album! I loved whole one. Abba is timeless.",
        "jedna z moich ulubionych",
        "この曲のように、早く美しい島Hawaiiが復活しますように。",
        "J’adore ABBA, cette version est vraiment douce",
        "I was today years old when I found out “Why did it have to be me” and “Happy Hawaii” are basically the same song.",
        "It sounds like \"why did it have to be me\"\nI like it",
        "El grupo de música pop de nivel mundial más fino , elegante , talentoso , inspirado , de más alto estandar , más bello y encantador .\nSiempre muy buenas canciones y las más bellas voces , música , composiciones e interpretaciones .\nMaravillosas melodias , ritmos y armonias magistralmente bellas y fantasticamente muy bien ejecutadas a la perfección .\nMuy alto nivel profesional .",
        "How extraordinary and very good is all the ABBA music true absolutely .\nI love ABBA .\nThank you very much dear ABBA for the greatest timeless classics masterpieces of pop music legacy in the world .   \n🇨🇱️\nPURE GOLD AND MAGIC MUSIC FOREVER !!!\nABSOLUTE WORLDCLASS MASTERS GENIUS POP MUSIC TALENT .\nEXTRAORDINARY GEM AND REAL MAGIC POP MUSIC TREASURE .",
        "Ha, never knew this existed!! Why Did It Have to be Me is of course a much more exciting version of the tune, but this is a fun discovery!",
        "Adoration to AgnetНа and Frida, perfect singers, forever!!!",
        "I can imagine the beach and the sand walking with frida and holding her hand... Gorgeous woman",
        "Nach dem leider noch nicht vollständig veröffentlichten \"Just like that\" ist dies für mich das beste Lied von ABBA! Unbeschreiblich schön! Daß die B-Seite einer Single sogar besser ist als der Riesenhit auf der A-Seite, gibt es auch nur bei ABBA. Das kann sonst keiner.",
        "Love ABBA , I’m happy when I hear the music ",
        "In the United States of America, this selection was the song on Side B of the \"Knowing Me, Knowing You\" 45 rpm single from 1977.",
        "Абба, вие сте едно от проявленията на бог на земята,",
        "Urlaubsstimmung pur. Spitzenmässig.",
        "I love all ABBA songs!!! :D",
        "Lovely ",
        "Najfajniejszy utwór ABBY",
        "Love this.",
        "Omg I would love to be on the beach in Hawaii with Abba every Abba fans dream Ye Ha ",
        "Magnifique chanson",
        "Timeless!... nice 🇳🇿",
        "Super happy song , something to make you feel good even when you're in trouble . Something for dreaming about fine and friendly places",
        "Love ABBA !!!",
        "I like this version more than \"Why did it have to be me\" . Love abba ",
        "I was just there last summer, loved it.",
        "I prefer this to why did have to be. It makes me want to go to Hawaii",
        "ありがとう\n大好き",
        "Listening to this timeless song, a few days before taking off to a sunny far away place :)",
        "Reading thru all the comments I thought as a 11yrold that Abba were only megastars in my country 🇦🇺",
        "True that, I never thought that they had another version of this song quite beautifully my favourite chears",
        "",
        "The Best",
        "WONDER IF THE ABBA FAN CLUB IS STILL GOING",
        "Lyrics:\n\nEarly this morning I drove in the rain \nOut to the airport to get on the plane \nHey Honolulu, we’re going to happy Hawaii \nAlice has been there, she said it was fun \nSwimming and surfing, enjoying the sun \nHey Honolulu, we’re going to happy Hawaii \n\nAfter all I’ve had to go through \nI’m making no plans (making no plans, oh-ooh)\nBut I, but I believe love gives me a second chance \n\nGuess I’ve been working a little too hard \nNeed a vacation, I’ll send you a card \nFrom Honolulu, a greeting from happy Hawaii \n\nIt’s so exciting, why should I pretend \nIn a few hours the plane will descend \nHey Honolulu, we’re going to happy Hawaii \nI can imagine the beach and the sand \nWalking with someone and holding his hand \nHey Honolulu, we’re going to happy Hawaii \n\nAfter all I’ve had to go through \nI’m making no plans (making no plans, oh-ooh)\nBut I, but I believe love gives me a second chance, mmm\n\nI’ve got a feeling the dream will come true \nSomebody’s waiting and I’ll forget you \nHey Honolulu, we’re going to happy Hawaii",
        "",
        "",
        "This is one of my favorite songs from arrival . I actually prefer it to why did it have to be me",
        "The original version of \"Why Did It Have To Be Me?\".",
        "This one was made for the US market.",
        "Hibbie A, reminds me of Underwater Song from Doodle Do",
        "",
        "PLADA,CHANEL",
        "Day 6735. 3 x 5 x 499. Grapes and raw honey and cos lettuce and dried figs and urine all day long. No change.",
        "Not bad for a \"B\" side single, the same tune as \"Why did it have to be me\"",
        "Should have added a line about how her fair skin would be red as a lobster from all of the sun and fun.  A week of pain followed by days of itching and peeling.",
        "",
        "2:26 \"I can imagine the pigeons in sex\" - I used to think as an adolescent boy. ",
        "Defiantly isn’t a happy Hawaii at the moment…",
        "Fantastic!!!"
    ],
    "Happy New Year by ABBA official": [
        "Happy 2024! Abba's songs are always fabulous!",
        "Самая новогодняя из всех новогодних песен! 43 года прошло, а  она остаётся на первом месте! АВВА! Вы наша юность! Только вы звучите - сразу разглаживаются морщины на наших постаревших лицах. Удивительная сила искусства!",
        "For every person in this entire world, there is a song from Abba you will at least like. I love this song, so beautiful and soothing to the limit.",
        "Happy 2023!!!",
        "Chúc mừng năm mới !!!!",
        " Happy new year everyone!! :) ",
        "Happy new year to everyone.",
        "Мне 71. Каждый раз, когда слышу эту композицию АББы улетаю в далекие 70-е! Там моя юность. Там тепло, светло и радостно!",
        "31 декабря 2020 года!!!! С Наступающим, всем Мира и Добра. Пускай 2021 год принесет только радость в каждый Дом.",
        "Today is the last day of 2023 year. I wish all people will be healthy, successful, kind and lovely, inshaalloh",
        "Happy new year 2024 ! ️\nPaz  y amor. Para  mi y para todos ♡\nNo más guerra ,miseria  hambre .no muertes. \nEmpatia en nuestra mente y corazón ♡",
        "Chúc năm mới thật bình an hạnh phúc 22.10.2024 ",
        "С наступающим 2024!!!    Круче этой песни не придумали. Всем  снова шампанского, фруктов, музыки, смеха, радости. Любите друг друга. Будьте здоровы и счастливы!!! ",
        "Whoever is reading this, Happy 2019!!!",
        "It isn't New Years Eve without listening to this. Happy 2019 to everyone.",
        "This song truly captures the feeling of the ending moment of the party, sounds hopeful yet so nostalgic and lost",
        "вот уже и скоро наступающий 2020...а песня на все века....",
        "This song is so good...",
        "Every year a little after 12 my mother plays this song. \n\nNo matter where I go I'll do this. I'm glad I still get to share these songs with her. \n\nHappy new year (at exactly  in 2023) ️ wishing everyone love and light in the new year!!",
        "С Новым годом, Абба, я приехал из Вьетнама и передаю тебе свои наилучшие пожелания в новом году.",
        "Какое чудо! Сколько бы не смотрела, не устаю восхищаться! Классика на все времена!",
        "ВСЕМ СЧАСТЬЯ, ЗДОРОВЬЯ, ЛЮБВИ, УДАЧИ В НАСТУПАЮЩИМ НОВОМ ГОДУ 2019",
        "Уникальная, неповторимая группа, превосходное исполнение! Наверное нет такого уголка на земле где бы не восхищались АВВА! Столько прекрасных воспоминаний под их вечную музыку! Они любимы всеми поколениями, это музыка для всех и на все времена!",
        "Спасибо Вам за все Ваши песни.Сколько доброго в них. Многие поколения выросли на Ваших песнях( и я втом числе). Поклон Вам за Ваше творчество.",
        "С наступающим 2019!",
        "ABBA,one of the best groups of all time,true today,true in 100 years time",
        "Какие воспоминания…Школа, первый медленный танец под Новый Год…красота…вся жизнь под прекрасную АВВА!!! Живите долго, дорогие!!!",
        "Хочется вернутся и чтобы это никогда не кончалось. Люблю  ABBA.",
        "Each year, it's a crucial time to memorize these never falling stars. Thank you Abba  for the music.",
        "Песня, которая навсегда осталась в памяти детства\n\nС Новым Годом! (2024) :)",
        "This song give me so many memories",
        "Таких шедевров сейчас не делают\nТворение ",
        "Всех с наступающим 2019 годом!!!\nHappy new year",
        "Cứ mỗi năm bận bịu đến mức nào đi nữa cũng cố gắng  Vào đây để cmt chúc mừng năm mới cả đất nước đều có sức khoẻ, có nó sẽ có tất cả🇻🇳🇻🇳🇻🇳🇻🇳🇻🇳 happy new year 12/02/2021",
        "0 % nudity .\n0 % violence .\n0 % vulgarity .\n % talent .",
        "Какая замечательная новогодняя песня! Как красиво, по доброму спета. Огромное спасибо вам АВВА!! Эта песня всегда будет согревать сердца тех кто её услышит!",
        "ВЫ ЛУЧШИЕ!!!!! Мы по вам скучаем, нам вас не хватает.",
        "Happy New Year for everyone in the World! Best wishes from Moscow!",
        "Qué hermosas voces! Qué bellas mujeres! ABBA fue un grupo maravilloso que nos acompañó con su música preciosa. Happy 2024 (un poco tarde ) desde Mendoza, Argentina.",
        "\"May we have a vision now and then, a world, where our neighbor is our friend\" a message SO needed now. Happy New Year, Abba forever",
        "Самая лучшая песня!\nСамая лучшая группа!\nС Новым годом всех!\nПусть будет мир на Земле!\nУра!",
        "Это одна из самых добрых и приятных песен из тех что я слышал :) всем добра и счастья!!! до встречи в новом году",
        "72 Days of New Year's Day!",
        "когда слушаю эту песню как-то на душе тоскливо... время летит и всё меняется, к сожалению не к лучшему , а наоборот... теряем близких с годами, увы...",
        "Wishing a Happy New Year to everyone in the world.\nMay we all find Peace & Comfort in 2020.",
        "Happy new year 2023️may your lives be filled with love and happiness! Cheers to all Abba fans! Greetings from Norway!",
        "I get shivers every time the years come, thank you Abba for this wonderful song!",
        "Pretty hard not to feel cheerful when you listen to Abba eh! Happy 2023 everyone, especially people stuck in the middle of wars, or experiencing health issues, have lost loved ones, lonely etc. Hopefully this song has cheered you up:)",
        "Классика бессмертна... Всех с наспупающим!)",
        "Now 2020 this video seems so nostalgic, everyone is together celebrating.",
        "This song speaks to the fleeting nature of dreams and aspirations, which often feel as fragile as the fireworks that have now faded. It captures a sense of loss and disillusionment, as the hopes and visions for a better world seem distant and unattainable. The chorus, with its repeated wish for a “Happy New Year,” feels almost like a plea, a desperate hope that the future might hold something brighter, even as the present feels heavy with the weight of unfulfilled promises.",
        "It's amazing. So many people from all over the world celebrate the new year here with ABBA!!!  \nHAPPY NEW YEAR TO YOU ALL!!! ",
        "Còn vài tháng nữa thôi là hết năm 2019 rồiiiii.Nhanh quá!!!!!!",
        "Всех любителей АББА -- с наступающим 2022 годом , Всем , Всем -- здоровья и никаких вирусов !!!",
        "Мне уже 52 года, но это - песня моего  детства. Светлая, Добрая и пахнет ёлкой и мандаринами!\n\"АВВА\" - спасибо вам за Сказку из Детства!!!",
        "Благодарна вам АВВА за ваши чудные голоса, за то , что возвращаете в юность. Слушали эту песню до самозабвения! Подарок на всю жизнь.БРАВО АВВА!!",
        "Уже наступил 2020... А когда слышишь эту прекрасную песню, то уши релаксируют.",
        "Years go by yet this ABBA song is still the perfect song to capture that New Years mood and the atmosphere on January 1st  Happy New Year everyone!",
        "Боже, как я их обожаю, еще, я была молодой, а маме было за 50,она просто.их обожала, когда слышала.Я уже в возрасте, родителей нет, а мурашки так и бегают по телу, огромное им спасибо, такие не повторяются.",
        "Действительно, одна из лучших песен всех времён!",
        "Слушаю каждый год перед праздниками!!! Подумала-а ведь они нас всех обьединяют!",
        "Песня которую всегда слушаем на новый год. Великая композиция на все времена!)",
        "Happy new year 2024 from Việt Nam ",
        "I never cried so bad to a song that is literally older than myself. I knew the day will come when we will see ABBA's videos in HD or in this case 4K. Looking at such an old music video in great quality brings so much nostalgia. Thank you very much for everyone involved at the UMG for this one.",
        "Какие прекрасные голоса...\nПросто нет слов для восхищения!",
        "Грустно как-то,под эту песню вспоминаются минувшие годы и ощущение того,насколько же хорошо было там,несмотря на проблемы,которые были присущи всем годам какие только не возьми. Но ведь было и хорошее,мы были моложе,было меньше проблем и на душе на самом деле было как то теплее. Не скажу что сейчас все плохо,просто грустно от воспоминаний о прошлом,очень",
        "ABBA(のみなさん何時迄も元気で頑張って下さい応援してます",
        "Какие добрые и милые лица, прекрасные в своей естественной красоте! А вокал просто божественен!!!",
        "To everyone who is reading this, May you and family have a delightful year ahead! ️",
        "И снова,очередной год эта песня согревает меня.2020",
        "100 Millionen für einen Song der nie eine Single war. Gratulation ",
        "Мы ровесники с ними. Спасибо, что они были в нашей юности. С Новым 2021 годом всех. Молодости в душе, любви.\n,",
        "Моя любимая группа !...Восхищению нет предела ! Творчество на все времена!!!...",
        "why doesn't this get huge every year like christmas songs?",
        "Đôi khi thấy lòng trống trải vô cùng, cũng chỉ biết mở nhạc nghe, bật to hết cỡ để nó át đi phần nào mông lung trong đầu ",
        "The best Happy New Year song of all times ️ No one will ever beat this  song! Blessings to everyone all around the world ",
        "It’s two hours and ten minutes until 2024 and I’m listening to this wonder, I love you Abba ",
        "Дай Бог всем благополучия здоровья и мирного неба над головой в новом 2023 году!",
        "Nghe đi nghe  lại . cảm giác khó tả . cảm ơn người sáng tác bài hát",
        "Still my favorite New Years' Song, after all these years.  ABBA will never be replaced nor dethroned!!",
        "Скоро 2020 год, а песня до сих пор живёт!!! Жду вас через год.",
        "а ведь скоро и 2019, украшение ёлки и на фоне в комнате играет Abba - Happy New Year\nв этом есть своя атмосфера, свой праздник!!!...///*",
        "Мне тогда 15 лет! Как же это и далеко и близко! Как будто вчера!",
        "Обожаю аббу, это моя молодость! Даже слезы на глазах. Как все быстро пролетело!",
        "This was my dad’s favourite song from Abba, grew up listening to Abba with him. May his dear soul rest in peace, now my kids and I both listen to their music. Feels so good almost like I am getting a piece of my dad back\nThank you Abba",
        "Самая красивая и волшебная новогодняя мелодия!, Всем добра и удачи в новом году!!!",
        "Привет.\n  Так много новогодних песен, но только когда я слышу песню в исполнении ABBA, я чувствую атмосферу настоящего Нового года. С Новым годом. Мое единственное желание от Бога - чтобы наступающий год был более красивым и запоминающимся, чем предыдущие годы️",
        "ПОЗДРАВЛЯЮ ВЕСЬ МИР С НАСТУПАЮЩИМ НОВЫМ ГОДОМ!!!! ЖЕЛАЮ ВСЕМ ДОБРА, КРЕПКОГО ЗДОРОВЬЯ И УДАЧИ ВО ВСЕХ ДЕЛАХ!!!!!!! Happy New Year!!!!",
        "Their biggest hit in Viet Nam. This song is always played when our Lunar New Year comes. This song recalls me of the old days when I was a child. Love you forever ABBA",
        "The evocative power of this song is like no other ABBA song to me. Just the desperate distance between the sordid real world and the faintest slivers of hope we dream of only when the chorus plays are enough to send torrents of tears. How many times I have cried thinking how, instead of being friends to our neighbours, like we truly would have wanted, we yell and curse at them, and kill and slaughter each other every day.......! WE ARE SO FAR AWAY FROM BEING FRIENDS!",
        "Лучшая новогодняя песня!!! С Новым Годом!!!! Здоровья, радости, любви!!!",
        "Мне 53 слушая этот шедевр возвращаюсь в свое детство 70 ые года.Жаль не вернуть те золотые времена.",
        "2021 is another difficult pandemic year. The lyrics makes me behind the memories of a difficult year and welcome the new year of 2022 are impressive. Happy New Year, every one!!",
        "Danke für die schöne Zeit die ich mit ihrer Musik verbringen durfte Jahrgang 1964",
        "Прелестнейшая новогодняя песня несомненно вошла в пантеон музыкальных шедевров 20-го века , а группа АББА , КАК ОЧАРОВАТЕЛЬНЫЙ БРИЛЛИАНТ осталась в сердцах и памяти  сотен миллионов восторженных поклонников.",
        "Сто лет после детства, а хит по-прежнему самый самый-самый!",
        "2020 was the worst year of my life. I hope 2021 will be better for everyone wherever you are. Happy New Year in every language around the world.",
        "73 Days of New Year's Day!",
        "I don't care if its april.. this music is amazing..\n\nEdit: now August xd",
        "Конец 2019! Даже не представляю Новый год без этой шедевральной песни)"
    ],
    "He Is Your Brother by ABBA official": [
        "First ABBA hit on Swedish radio 1972! The were called \"Björn och Benny Agnetha och Annifrid\"! I was 10 and loved it.",
        "This song is so amazing everybody all over the world will be singing it it is do iconic and unforgetable Thank u Abba ",
        "For my entire life and time listening to music since 70's , I've never seen a talented personnel like these guys...",
        "I love you ABBA.",
        "Released in 1972 as a single - love the first album stuff!",
        "Yo era un luchador que siempre buscaba problemas.\nI was a fighter always looking for trouble\n\nY mi vida estaba tan vacía que no quedaba nada por qué vivir.\nAnd my life was so empty, there was nothing left to live for\n\nPero luego sucedió una noche cuando me peleé.\nBut then it happened one night as I got into a fight\n\nPude escuchar a alguien decir como si estuviera orando.\nI could hear someone saying as though he was praying\n\nTrátalo bien, es tu hermano.\nTreat him well, he is your brother\n\nQuizás necesites su ayuda algún día.\nYou might need his help one day\n\nDependemos unos de otros\nWe depend on one another\n\nÁmalo, esa es la única manera.\nLove him that's the only way\n\nEn el camino, en el camino que vamos\nOn the road, on the road that we're going\n\nTodos necesitamos, todos necesitamos palabras de consuelo y compasión.\nWe all need, we all need words of comfort and compassion\n\nTrátalo bien, es tu hermano.\nTreat him well, he is your brother\n\nÁmalo, esa es la única manera.\nLove him that's the only way\n\nYo era una mujer que nunca pensaba en los demás.\nI was a woman never thinking of others\n\nY mi vida era tan solitaria, no me importaba nadie\nAnd my life was so lonely, didn't care for anybody\n\nPero entonces me encontré con un mendigo en la calle.\nBut then I happened to meet a begging man in the street\n\nCuando rechacé su oración escuché a alguien decir\nAs I turned down his praying I heard someone saying\n\nTrátalo bien, es tu hermano, hermano.\nTreat him well, he is your brother, brother\n\nQuizás necesites su ayuda algún día, él es tu hermano.\nYou might need his help one day, he's your brother\n\nDependemos unos de otros, hermano\nWe depend on one another, brother\n\nÁmalo, esa es la única manera.\nLove him that's the only way\n\nEn el camino, en el camino que vamos, que vamos\nOn the road, on the road that we're going, that we're going\n\nTodos necesitamos, todos necesitamos palabras de consuelo y compasión.\nWe all need, we all need words of comfort and compassion\n\nTrátalo bien, es tu hermano, hermano.\nTreat him well, he is your brother, brother\n\nÁmalo, esa es la única manera.\nLove him that's the only way\n\nTrátalo bien, es tu hermano, hermano.\nTreat him well, he is your brother, brother\n\nQuizás necesites su ayuda algún día, él es tu hermano.\nYou might need his help one day, he's your brother\n\nDependemos unos de otros, hermano\nWe depend on one another, brother\n\nÁmalo, esa es la única manera.\nLove him, that's the only way\n\nTrátalo bien, es tu hermano, hermano.\nTreat him well, he is your brother, brother\n\nQuizás necesites su ayuda algún día, él es tu hermano.\nYou might need his help one day, he's your brother\n\nDependemos unos de otros, hermano\nWe depend on one another, brother\n\nFuente: Musixmatch\n\nCompositores: Benny Andersson / Bjoern K Ulvaeus\n\nLetra de He Is Your Brother  Universal/union Songs Musikforlag Ab",
        "Första ABBA LP:n vi köpte här :) Fin text med fint budskap ännu",
        "Timeless! ",
        "Nice Message of ABBA in a nice Song",
        "Ouço essa música umas mil vezes, e me dá vontade de ouvir mais mil ",
        "Who could ever forget this amazing and awesome song The love is all around the world we depend on everyone A great Karaoke dong p",
        "Lyrics:\n\nI was a fighter always looking for trouble\nAnd my life was so empty, there was nothing left to live for\nBut then it happened one night as I got into a fight\nI could hear someone saying as though he was praying\nAh...\n\n\"Treat him well, he is your brother\nYou might need his help some day\nWe depend on one another\nLove him, that's the only way\nOn the road that we're going\nWe all need words of comfort and compassion\nTreat him well, he is your brother\nLove him, that's the only way\"\n\nI was a woman never thinking of others\nAnd my life was so lonely, didn't care for anybody\nBut then I happened to meet a begging man in the street\nAs I turned down his praying I heard someone saying\nAh...\n\n\"Treat him well, he is your brother (Brother)\nYou might need his help one day (He's your brother)\nWe depend on one another (Brother)\nLove him, that's the only way\nOn the road that we're going\nWe all need words of comfort and compassion\nTreat him well, he is your brother (Brother)\nLove him, that's the only way\"\n\nTreat him well, he is your brother (Brother)\nYou might need his help one day (He's your brother)\nWe depend on one another (Brother)\nLove him, that's the only way\nTreat him well, he is your brother (Brother)\nYou might need his help one day (He's your brother)\nWe depend on one another (Brother)",
        "I love this song",
        "Great song!",
        "Excelente!",
        "Un tema de ellos que no había oído casi nunca y ahora me di cuenta que es muy buena canción y aparte con un buen mensaje",
        "70s",
        "This is so good",
        "Yes.   He's.   my.   Brother.....",
        "Great message wow",
        "THIS SONG IS SO AMAZING WOULD BE GREAT AT A KARAOKE BAR EVERYONE WILL BE ON THE DANCE FLOOR ROCKING AND ROLLING ",
        "2023",
        "Sometimes this song even applies to your own biological brother during times when you think that he's treated you unjustly or unfairly.",
        "I am 21 and for 14 years I have been saying, lover instead of brother.",
        "Hibbie A, which Doodle Do Song samples This song",
        "",
        "Linda letra!",
        "this song goes out to prince william",
        "Florida Georgia Line"
    ],
    "Here We'll Stay by ABBA official": [
        "\"Here We'll Stay\" \n\n      - Frida Lyngstad & Phil Collins\n\n              (Words and Music by Tony Colton and Jean Roussel)  \n\nLove, love is a dream\nWe were like two young strands of driftwood caught up in a stream\n\nWe were destined for each other from our very first hello\nWe came bustin' through that river dam, and made that river flow\n\nWe will sail upon the ocean, till the shoreline meets the sky\nCarried on the first trade wind that favours you and I\n\nWe have, both of us, between us, known misfortune in our days\nBut, darling, this time, we're on our way\n\n'Cause we're here (here we are), and here we'll stay\nWe won't ever throw this love of ours away\nWe are here (here we are), and here we'll stay\nWe won't ever throw this love of ours away\n\n[Break]\n\nLife, oh, life is a chance\nWe were the only two who spun the wheel and never scored romance\n\nAnd if we'd stayed to play for fortune, we'd have broke the banks of gold\nWe'd have taken old Las Vegas for every cent that she could hold\n\nA love like ours was made in heaven, it was blessed by Lord above\nWe will spend our lives together, forever hand in glove\n\nWe have, both of us, between us, known misfortune in our days\nBut, darling, this time, we're on our way\n\n'Cause we're here (here we are), and here we'll stay\nWe won't ever throw this love of ours away\nWe are here (here we are), and here we'll stay\nWe won't ever throw this love of ours away\n\n[Break]\n\n'Cause we're here (here we are), and here we'll stay\nWe will never throw this love of ours away\nWe are here (here we are), and here we'll stay\nWe won't ever throw this love of ours away\n\n[Break]\n\n'Cause we're here (here we are), and here we'll stay\nWe won't ever throw this love of ours away\nSo here we are (here we are), and here we'll stay\nWe are never gonna throw this love away\n\nSo here we are (here we are), and here we'll stay\nAnd we won't ever throw this love of ours away\n'Cause we are here (here we are), and here we'll stay\nAnd we will never ever throw this love away\n\nWe are here (here we are)...",
        "best singer-drummer-producer-composer-lyricist \nwhat else ? actor :)",
        "Adore forever",
        "incredible drum parts in this album",
        "Mega tolle Aufnahmen abgesehen vom Song.  So toll. 40 Jahre und immer noch frisch",
        "April 2024 now",
        "Absolut Dreamteam  ",
        "Aguante los clasicos",
        "Siempre e preferido a Agnetha.. Pero este dueto de frida y Phil es buenicimo",
        "Que grande Phil Collins. Y Frida también.",
        "Legeeend..legacy... what a song..for all the seasons  in my life..since my teenager u till my latest 50th",
        "Super Lied \nZwei grandiose Sänger im Duett klasse ",
        "1:58 or 2:07 The choir sounds ABBA. Frida was the structure of the famous third ABBA voice !!",
        "Tremenda voz la de Frida. Para mi y más allá del éxito fue in desperdicio en ABBA, tenía un potencial para cantar más osadamente y este tema es un claro ejemplo de ello",
        "I would love for you to spew such a video from ABBA's recordings. ",
        "🇮🇩🇮🇩🇮🇩",
        "",
        "Phil obviously had a shave during the making of this video.",
        "Looks like she was made to feel like an outsider.",
        "The solo version sounds funkier, I think. "
    ],
    "Hole In Your Soul by ABBA official": [
        "Una de las más grandes composiciones de ABBA. ABBA pone la innovación y el arte por encima de lo fácil, monótono y comercial. \"Hole In Your Soul\" es de esas canciones explosivas y avasalladoras que te sacuden el alma. Está muy bien construida con quiebres de ritmos, contrapuntos musicales y vocales. Tiene una atmósfera progresiva, vanguardísta, algo que no caracterizó a ABBA  y que solamente lo logró con esta y algunas otras canciones de su álbum más serio \"The Album\"  y con el último track del álbum The Visitors “Like An Angel Passing Through My Room”",
        "this song rocked the arena in Abba voyage.",
        "Agnetha hitting that note  sold it for me.",
        "You feel bad, let me tell you, we all get the blues\nSometimes life is a burden, weighed down in your shoes\nWhen it's bad, worse, worst\n(And when you're feeling so bad)\nAnd you think you're cursed\n(And you've got it sad)\nWell, if there's one thing for the better that can turn you loose\n\nIt's gotta be rock'n roll\nTo fill the hole in your soul\nThere's gotta be rock'n roll\nTo fill the hole in your soul\n\nMy friend Sam is a chauffeur, Annie goes to school\nJerry works at the office, Sue lies by the pool\nBut on all weekends\n(Together again)\nWhen I meet my friends\n(I'm gonna see them now)\nAnd we're lookin' round for the action we sure play it cool\n\nIt's gotta be rock'n roll\nTo fill the hole in your soul\nThere's gotta be rock'n roll\nTo fill the hole in your soul\nAh-haa (ah-haa, ah-haa)\nYou paint your world and use all colours\nAh-haa (ah-haa)\nAnd then you find it all comes out too bright\nYou know it's only a lie\nAh-haa (ah-haa, ah-haa)\nThe songs you sing are too romantic\nAh-haa (ah-haa)\nAnd when you want the truth\nThey only spit in your eye\nOh yeah, they're only telling you lies\nOh yeah, there's gotta be rock'n roll\nTo fill the hole in your soul\n\nYou feel bad, let me tell you, we all get the blues\nSometimes life is a burden, weighed down in your shoes\nWhen it's bad, worse, worst\n(You know you're feeling so bad)\nAnd you think you're cursed\n(And you've got it sad)\nWell, if there's one thing for the better that can turn you loose\n\nIt's gotta be rock'n roll\nTo fill the hole in your soul\nThere's gotta be rock'n roll\nTo fill the hole in your soul\n\nThere's gotta be rock'n roll...\nTo fill the hole in your soul\nThere's gotta be rock'n roll...\nTo fill the hole in your soul\nThere's gotta be rock'n roll...\nTo fill the hole in your soul\nThere's gotta be rock'n roll...\nTo fill the hole in your soul\nThere's gotta be rock'n roll...\nTo fill the hole in your soul",
        "Beer in hand, record on, this song playing. Good times.",
        "This is 1 of my favourite ABBA songs and i screamed with excitement when they sang it in the VOYAGE concert ( which is the most fantastic experience )",
        "So glad this was included in Voyage..... What a banger!",
        "Fantastic.  Agnetha was the first singer to inspire me, and I celebrate her to this day.",
        "Absolute knock out of a song - the live version is even better !",
        "Today is Feb.4.2023 I am listening This Beautiful ABBA SONG*",
        "[Verse 1: Agnetha, Frida & Björn]\nYou feel bad, let me tell you, we all get the blues\nSometimes life is a burden, way down in your shoes\nWhen it's bad, worse, worst (And when you're feeling so bad)\nAnd you think you're cursed (And you've got it sad)\nWell, if there's one thing for the better that can turn you loose\n\n[Chorus: Agnetha & Frida]\nIt's gotta be rock 'n' roll\nTo fill the hole in your soul\nThere's gotta be rock 'n' roll\nTo fill the hole in your soul\n\n[Verse 2: Agnetha, Frida & Björn]\nMy friend Sam is a chauffeur, Annie goes to school\nJerry works at the office, Sue lies by the pool\nBut on all weekends (Together again)\nWhen I meet my friends (I'm gonna see them now)\nAnd we're looking 'round for the action, we sure play it cool\n\n[Chorus: Agnetha & Frida]\nIt's gotta be rock 'n' roll\nTo fill the hole in your soul\nThere's gotta be rock 'n' roll\nTo fill the hole in your soul\n\n[Bridge: Agnetha & Frida]\nAh-ha (ah-ha, ah-aa) You paint your world and use all colours\nAh-ha (ah-ha) And then you find it all comes out too bright\nYou know it's only a lie\nAh-ha (ah-ha, ah-aa) The songs you sing are too romantic\nAh-ha (ah-ha) And when you want the truth\nThey only spit in your eye\nOh yeah, they're only telling you lies\nOh yeah, there's gotta be rock 'n' roll\nTo fill the hole in your soul\n\n[Verse 3: Agnetha, Frida & Björn]\nYou feel bad, let me tell you, we all get the blues\nSometimes life is a burden, way down in your shoes\nWhen it's bad, worse, worst (And when you're feeling so bad)\nAnd you think you're cursed (And you've got it sad)\nWell, if there's one thing for the better that can turn you loose\n\n[Chorus: Agnetha & Frida]\nIt's gotta be rock 'n' roll\nTo fill the hole in your soul\nThere's gotta be rock 'n' roll\nTo fill the hole in your soul\nIt's gotta be rock 'n' roll\nTo fill the hole in your soul\nThere's gotta be rock 'n' roll\nTo fill the hole in your soul\nIt's gotta be rock 'n' roll\nTo fill the hole in your soul\nThere's gotta be rock 'n' roll\nTo fill the hole in your soul\nIt's gotta be rock 'n' roll\nTo fill the hole in your soul\nThere's gotta be rock 'n' roll\nTo fill the hole in your soul",
        "Did you notice, and it's quite fascinating, that the bass sits still exactly the whole time, on the same note. Until it is finally released, at 3:02. The effect is incredible. Brilliant",
        "I was feeling down so the doctor told me to take two ABBA songs every day ️️️",
        "2:22 Agnetha! Wow! What a voice!",
        "OK, it's ABBA, so you know you're in for a treat. But, after the first 18 seconds of listening and loving, 0:19 to 0:26 lets you know you're in for something just that little bit more stupendous.......so stupendous for me that this happens to be my favourite ABBA song....",
        "The world is on fire Love Agnethas high voice near the end of the song ",
        "one of my favorites from this overall exceptional album (\"Thank you for the music\" having the ultimate songlyrics anyway)\nsaw the movie whenit came out, got the album, been a fan ever since.",
        "They are incredable Love AbbA since the 70s",
        "Fav song of the album",
        "Best ever intro to a record, Stunning record.",
        "Love, love, love this song....heavy abba.....also,this has to be the best album cover ever. ......",
        "All of ABBA songs are all my favorite. ALL",
        "Bought the album in '77 , what a tune this is ..",
        "One of my absolute favorites",
        "Giving us courage, this piece of \"Move on\" has helped us to overcome difficulties and has led us to the place in which we can live proudly.",
        "I've always loved abba for many years ever since I was little ",
        "Hole in your souł? Fill it with ABBA ",
        "Love the synth work on the closing stages of the song",
        "Agnetha Faltskog es Treinta y Siete.",
        "Agnetha es Treinta y Siete.",
        "BEST ABBA SONG EVER!",
        "2:22 oh my god shivers",
        "En vivo en el Wembley Arena 1977 es una interpretación espectacular \nDa puro placer verlos entregar tanta calidad potencia y energía",
        "2:22 agnetha hitting that note",
        "2:22 Best part",
        "Tämä koko albumi on taidetta",
        "great, great, great song!",
        "Puro rock and roll ",
        "How does this song only have 600 likes?",
        "... ABBA - The Best Human Thing \n                    From God....",
        "marvelous for ever",
        "ABBA at their best.  Pristine.",
        "Песня супер!Агнета берет самую высокую ноту,фантастика.",
        "long time,  but still fascinating,,,",
        " ABBA\n..... HOW MANY FEELINGS ARE HERE....",
        "Wow! Nice B5 at 2:24 ",
        "Who is it that is actually disliking this. Like how can anyone in their right mind not like this?",
        "1:41 el momento más sublime\nel canto estilo gregoriano de\n Agnetha y Frida\n en el centro del vértigo del rock & roll\n y Agnetha da su nota más alta\n\nABBA demuestra su excelencia y versatilidad \nen esta perla escondida en \"The Album\" que es \n\"Hole in your soul\"",
        "Melodía, armonía y potencia. Excelente!",
        "... God and his son \nSend That.... ABBA....",
        "Abba has more hooks than a fisherman.",
        "THIS SONG IS SO INSANE THANK U ABBA so hip and cool everybody will be having the time of their life Thank u for who u are Love u heaps qwqqq",
        "I had this album on vinyl back then, it disappeared along the way, I think I have to get it again.",
        "Есть песня аба, которые стали очень хорошими рок-н-роллами и в то же время-это классные шедевры.",
        "Está música me eleva a otro universo ",
        "i love it",
        "top !!!!!",
        "Превосходно!!!!",
        "Je me suis réveillé tout émoustillé et pareil a une bonne forme , une impression de bien être jamais encore ressentis ..et puis tout juste sortis de se rêve particulier , un rayon de soleil le entre dans la pièce , et je vous mon visiteur inatendu.",
        "I remember the nay sayers whining about inducting them into hall of fame and my argument back was this song...",
        "Parts of this song really sound like “get on the carousel”. Like “dream World” sounds like “does your mother know” at some point. 1:43-1:52, that’s so “get on the carousel”:) also “why did it have to me” and “happy hawaii” though essentially I know it’s “the same song”",
        "Uma das músicas mais subestimadas da história.",
        "Extraordinario!!!!!",
        "Rock version good",
        "December 12, 1977\nABBA publishes \"The Album\"\nher fifth studio album\n\nABBA demonstrates its excellence and versatility in this surprising pearl hidden in \"The Album\" that is \n\"Hole in your soul\"\n\n the most sublime moment\nthe Gregorian operatic style singing of \nAgnetha and Frida \nat the center of the vertigo of rock & roll\n and Agnetha gives her highest grade\n\nand the live version in Tour 79 is amazing, \ntheir best interpretation",
        "es una joya",
        "Eargasm at 2:24!",
        "02. Hole In Your Soul\n03. SOS\n04. Knowing Me, Knowing You\n05. Chiquitita\n06. Fernando\n07. Mamma Mia\n08. Does Your Mother Know\n09. Eagle\n10. Lay All Your Love On Me\n11. Summer Night City\n12. Gimme! Gimme! Gimme!\n13. Voulez-Vous\n14. When All Is Said And Done\n15. Don't Shut Me Down\n16. I Still Have Faith In You\n17. Waterloo\n18. Thank You For The Music\n19. Dancing Queen\n20. The Winner Takes It All",
        "",
        "Le grand mystère dans ces séries de coïncidences et de fenomenes paranormaux , reste le fait de parler avec des gens , alors que je dors profondément .",
        "Can see the plane landing.....",
        "Magic,,,,,,,,,,,,,,, aha............. Aha..........",
        "Any information ️ about the artist who painted this album front cover and what was the message/narrative?",
        "C est sans doute ce terrible accident de St germain en laye.  Qui m a rendit très bête.    Étant donné que je suis resté depuis très bête.  Et le plus ouf. C est que le monde entier c est que je suis bête !!!",
        "Notre obsession de la mort a quelque peu afollee et contrariée nos voyageurs et visiteurs de l espace et occasionnée une incompréhension totale , ce qui explique une grande difficulté à prendre. Contact avec nous terriens. Et pourtant depuis le temps !!!!.",
        "Big fan but never got into this one",
        "oh Agnetha.....",
        "Et bien , il aurait fallut m inviter à cette gavotte , le résultat aurait été bien meilleure. Et le mystère de comment je donnais l heure exact a la seconde près pendant six mois dans les années catrevint. Tout est vrai , et les mystères du cerveau demeure , ainsi que la Gassin que je pouvais donner l heure exact .",
        "🩵",
        "Finit les visages , désormais les sujet dessinés sont représentés des pieds a ma tête , les yeux sont fermes, décidément , la mort encore , sans doute , je suppose .",
        "Je ne donne plus la météo , et j arrêté plus la pluie. , Mais chacun sait que les poiles poile s expriment toujours assez couramment ..par contre , j en ai marre de ma vie peau de chagrin .",
        "🇸🇪️🇺🇦",
        "BBA\"",
        "L.autre jours en ville , j avais marché dans.du.caca de chien , et comment de nos jours en plein centre ville trouver une touffe d herbe pour enlever correctement cette merde ,.et bien pile poile ,la seule touffe d.herbe.le.bord.d un trotoire existant encore , je suis arrivé dessus , pile poile et j ai put nettoyer ma chaussure , ouf !!!"
    ],
    "I Am The City by ABBA official": [
        "Imagine if Abba had gone a little longer in the 1980s... a 9th album, few tv shows, music videos with that energetic 80s style ",
        "Second day in a row where I have discovered a new ABBA song!!  Woot!! Sverige!! :)",
        "'I Am The City' recorded the 5th May 1982 during sessions for ABBA's 9th album that was never completed, its a really good song very catchy and has hit single potential. 'I Am The City' remained unreleased for 11 years when it was finally included on the 1993 compilation album 'More ABBA Gold', in 2012 the song was included on the Deluxe Edition of 'The Visitors'.",
        "Bursting with complex energy! I never knew ABBA still could write a banger at that time,  with girlie pop vocals.",
        "Fantastic ",
        "Absolut Klasse Song!!! Die gesamte Musik Welt verneigt sich vor euch!! Masterminds Benny und Björn und die phantastisch aufeinander abgestimmten Tonlagen von den Engeln Agnetha und Frida!! Danke für alles was ihr den Menschen geschenkt habt!! Ihr seid die Größten ",
        "It can be the only new wave song  of Abba, the new album in 1982",
        "Bought a collection at the age of 10. I had the chance to listen to many ABBA songs that I didn't know until then. And without internet it was always an adventure to go and buy records/CDs and then listen to them.\n\nI remember seeing an english advertising of ABBA-books in my original homecountry Germany and at that time writing an order on paper in the best english I was able to, went to the bank and exchanged Deutschmarks to Pounds, putting them in an envelope, sending the letter and the money to London and after several weeks I got my fucking stunning ABBA-books!!\n\nThat was life! :)",
        "Une grande chanson faite par un grand groupe..sans nul doute elle aurait eu un énorme succès",
        "Coming through a cloud, you're looking at me from above\nAnd I'm a revelation spreading out before your eyes\nAnd you find me beautiful and irresistible\nA giant creature that forever seems to grow in size\nAnd you feel a strange attraction\nThe air is vibrant and electrified\nWelcome to me, here I am, my arms are open wide\n\nSomewhere in the middle of the never-ending noise\nThere is a pulse, a steady rhythm of a heart that beats\nAnd a million voices blend into a single voice\nAnd you can hear it in the clamour of the crowded streets\nPeople come and take their chances\nSometimes you win, sometimes you lose a lot\nCome, make your own contribution to this melting-pot\n\nI'm the street you walk, the language you talk\nI am the city\nThe skyline is me, and the energy\nI am the city\nThe famous hotels and the cocktail bars\nAnd the funny smells and the turmoil of course\n\nAnd the people, the air that you're breathing is me\nYes, I am the city, you let me be\n\nPeople feed me with their lives, I am a hungry soul\nAnd they all worship me and pay their homage day and night\nEvery day I hear a lot of tired shopping feet\nBut come tonight they will be dancing in the neon lights\nDazzled by the crazy magic\nThey're grabbing pieces of the fatted calf\nAnd in the wind if you listen hard you'll hear me laugh\n\nAnd the people, the parks and the squares that you see\nAll the sounds that you hear and the air that you're breathing is me\nYes, I am the city, you let me be",
        "Мне очень нравится) Это был шаг вперед, который они решили не делать...",
        "Wow, this one will be on my top 10 Abba-songs list",
        "Voyage is good comeback album HOWEVER if feels like a compilation of  new songs in style of the Voulez Vous and Super Trouper album. I am the City shows what could have been the REAL next step in ABBA's sonority with their 1982 9th album. In fact, according to a press release of 1982 this song was saved as a pontential single for the 9th album scheduled at that time to be released in late 1983. This  is prime Björn and Benny as producers/composers and the lyrics are far beyond more complex than anything Björn wrote for Voyage",
        "I love this song. ABBA ist just great. :)",
        "The music video would be crazy",
        "My favorite.. I am the city ",
        "Abba is WONDER :D",
        "ABBA MUSIC FOREVER !!!   \n  🇸🇪\nTHE BETTER'S POP MUSIC IN THE WORLD UNTIL TODAY .\nFABULOUS AND FANTASTIC MUSIC , SONGS , VOICES AND POP GROUP .",
        "Timeless!.. great music",
        "Brilliant group to watch still have their music collection",
        "Einfach nur herrlich ",
        "Just AMAZING",
        "Phil Spector, Glyn Johns, Mutt Lang et al just a few of the many people mentioned when discussing great producers... Benny and Bjorn apart from being among the best songwriters/composers were just as great at producing",
        "HERE YOU CAN SEE HOW THE SINGING IS DONE \n[Verse 1: Frida & Agnetha]\nComing through a cloud you're looking at me from above\nAnd I'm a revelation spreading out before your eyes\nAnd you find me beautiful and irresistible\nA giant creature that forever seems to grow in size\nAnd you feel a strange attraction\nThe air is vibrant and electrified\nWelcome to me, here I am, my arms are open wide\n\n[Verse 2: Frida & Agnetha]\nSomewhere in the middle of the never-ending noise\nThere is a constant steady rhythm of a heart that beats\nAnd a million voices blend into a single voice\nAnd you can hear it in the clamour of the crowded streets\nPeople come and take their chances\nSometimes you win, sometimes you lose a lot\nCome, make your own contribution to this melting pot\n\n[Chorus: Frida & Agnetha]\nI'm the street you walk, the language you talk\nI am the city\nThe skyline is me and the energy\nI am the city\nThe famous hotels and the cocktail bars\nAnd the funny smells and the turmoil of cars\nAnd the people, the air that you're breathing is me\nYes, I am the city, you let me be\n\n[Verse 3: Frida & Agnetha]\nPeople feed me with their lives, I am a hungry soul\nAnd they all worship me and pay their homage day and night\nEvery day I knew a lot of tired shopping feet\nBut come the night they will be dancing in the neon light\nDazzled by the crazy magic\nThey're grabbing pieces of the fatted calf\nAnd in the wind, if you listen hard you'll hear me laugh\n\nChorus: Frida & Agnetha]\nI'm the street you walk, the language you talk\nI am the city\nThe skyline is me and the energy\nI am the city\nThe famous hotels and the cocktail bars\nAnd the funny smells and the turmoil of cars\nAnd the people, the parks and the squares that you see\nAll the sounds that you hear and the air that you're breathing is me\nYes, I am the city, you let me be\n\n[Bridge: Agnetha]\nI am the city\nYou let me be\nI am the city\n\n[Chorus: Frida & Agnetha]\nThe famous hotels and the cocktail bars\nAnd the funny smells and the turmoil of cars\nAnd the people, the air that you're breathing is me",
        "Una de mis favoritas hasta la fecha, You let me be!!!",
        "Brilliant, as everything they did️️️️",
        "very nice, i like skyscrapers too!",
        "Each to their own",
        "i am the city, you let me be\ni am the city\nComing through a cloud you're looking at me from above\nAnd I'm a revelation spreading out before your eyes\nAnd you find me beautiful and irresistible\nA kind of creature that forever seems to grow in size\nAnd you feel a strange attraction\nThe air is vibrant and electrified\nWelcome to me here I am, my arms are open wide\nSomewhere in the middle of the never ending noise\nThere is a constant steady rhythm of a heart that beats\nAnd a million voices blend into a single voice\nAnd you can hear it in the glamor of the crowded streets\nPeople come and take their chances\nSometimes you win sometimes you lose a lot\nCome make your own contribution to this melting pot\nI'm the street you walk\nThe language you talk\nI am the city\nThe skyline is me and the energy\nI am the city\nThe famous hotels and the cocktail bars\nAnd the funny smells\nAnd the turmoil, the cars and the people\nThe air that you're breathing is me\nYes I am the city, you let me be\nPeople feed me with their lives I have a hungry soul\nAnd they all worship me and pay their homage day and night\nEvery day I knew a lot of tired shopping feet\nBut come the night they will be dancing in the neon light\nDazzled by the crazy magic\nThey're grabbing pieces of the fatted calf\nAnd in the wind if you listen hard you'll hear me laugh\nI'm the street you walk\nThe language you talk\nI am the city\nThe skyline is me and the energy\nI am the city\nThe famous hotels and the cocktail bars\nAnd the funny smells\nAnd the turmoil, the cars and the people\nThe parks and the squares that you see\nAll the sounds that you hear\nAnd the air that you're breathing is me\nYes I am the city, you let me be\nI am the city\nYou let me be\nI am the city\nThe famous hotels and the cocktail bars\nAnd the funny smells\nAnd the turmoil the cars and the people\nThe air that you're breathing is me\nComing through a cloud\nYou're looking at me from above\nAnd I'm a revelation spreading out before your eyes\nI'm the street you walk\nThe language you talk\nI am the city\nYes I am the city, you let me be\nAnd you find me beautiful and irresistible\nA kind of creature that forever seems to grow in size\nThe skyline is me and the energy\nI am the city\nYou let me be\nSomewhere in the middle of the never ending noise\nThere is a constant steady rhythm of a heart that beats\nSomewhere in the middle of the never ending noise\nThere is a constant steady rhythm of a heart that beats\nAnd a million voices blend into a single voice\nAnd you can hear it in the glamor of the crowded streets\nThe skyline is me and the energy\nI am the city\nYou let me be\nSomewhere in the middle of the never ending noise\nThere is a constant steady rhythm of a heart that beats\nSomewhere in the middle of the never ending noise\nThere is a constant steady rhythm of a heart that beats",
        "Odio todo el año 2023.",
        "Lyrics:\nComing through a cloud, you're looking at me from above \nAnd I'm a revelation, spreading out before your eyes \nAnd you find me beautiful and irresistible \nA giant creature that forever seems to grow in size, \nAnd you feel a strange attraction,\nOoh, ooh the air is vibrant and electrified, \nWelcome to me, here I am my arms are open wide \n\nSomewhere in the middle of the never ending noise, \nThere is a pulse, a steady rhythm of a heart that beats \nAnd a million voices blend into a single voice, \nAnd you can hear it in the clamour of the crowded streets, \nPeople come and take their chances,\nOoh, ooh, sometimes you win, sometimes you lose a lot \nCome make your own contribution to this melting pot \n\nI'm the street you walk, the language you talk \nI am the city, the skyline is me and the energy \nI am the city, the famous hotels \nAnd the cocktail bars, and the funny smells \nAnd the turmoil of cars, and the people \nThe air that you're breathing is me,\nYes I am the city, you let me be \n\nPeople feed me with their lives, I am a hungry soul \nAnd they all worship me, and pay their homage day and night \nEveryday I hear a lot of tired, shuffling feet \nBut come tonight they will be dancing in the neon light, \nDazzled by the crazy magic, \nOoh, ooh, they're grabbing pieces of the fatted calf \nAnd in the wind if you listen hard, you'll hear me laugh \n\nI'm the street you walk, the language you talk \nI am the city, the skyline is me and the energy \nI am the city, the famous hotels \nAnd the cocktail bars, and the funny smells \nAnd the turmoil of cars, and the people \nThe parks and the squares that you see,\nAll the sounds that you hear, \nAnd the air that you're breathing is me, \nYes I am the city, you let me be \nI am the city, you let me be, I am the city \n\nThe famous hotels and the cocktail bars, \nAnd the funny smells and the turmoil of cars, \nAnd the people, the air that you're breathing is me \nComing through a cloud, you're looking at me from above \nAnd I'm a revelation, spreading out before your eyes \n\nI'm the street you walk, the language you talk \nI am the city yes, I am the city, you let me be \nAnd you find me beautiful and irresistible, \nA giant creature that forever seems to grow in size, \nThe skyline is me and the energy,\nI am the city you let me be\n\nSomewhere in the middle of the never ending noise, \nThere is a pulse, a steady rhythm of a heart that beats \nI'm the street you walk, the language you talk \nI am the city, yes I am the city, you let me be \nAnd a million voices blend into a single voice, \nAnd you can hear it in the clamour of the crowded streets, \nThe skyline is me, and the energy \nI am the city you let me be.",
        "Odio a fines de Febrero del año 2023.",
        "Odio el mes de Febrero del año 2023.",
        "Todo el año 2023 lo odio.",
        "tres de la mañana.",
        "Annie Lennox's \"Little bird\" is not a cover of this but in my opinion its theme is similiar.",
        "La planta de los pies de Agnetha Faltskog olieron a queso amarillo.",
        "Tema do episódio A Traição da quarta temporada das MLP de 1980.",
        "Odio el año 2023.",
        "Hands up who noticed that 4 of the tracks on this album mistakenly have the Left and Right audio channels reversed???",
        "Los pies de Agnetha Faltskog olieron a queso amarillo.",
        "To.jest.taka.sexi.rysiowrobel.zamch.miejscowosc.",
        "Una cancion no tan conocida",
        "Agnetha Faltskog falleció el 25 de Febrero del año 2023.",
        "Agnetha Faltskog murió el 25 de Febrero del año 2023.",
        "As Jesus said to a girl besid Jacobs well :I CAN tell you The time will come when People will pray to God \nIN DIFFRENT PLACES THAN JERUSALEM",
        "I don't like this with out track called.\nJust like that. On Leadvocals by Agnetha.",
        "Wow why wasnt this a single release",
        "Odio el mes de Febrero del año 2023."
    ],
    "I Have A Dream by ABBA official": [
        "Lovely song bringing old sweet memories of 1979 when I got married and had the ABBA tape from Colombo from where my wife was It was played on Tape Recorder My wife is with God and I listen to this wonderful song to rekindle my old memories",
        "My Mother sang this while she was in hospital. So glad I took a video of her singing this because she passed away a week later. Whenever I missed her, I keep watching that video.Miss you and love you Mama",
        "I was a teenager and fan of ABBA in the 1970s. I introduced my mom to ABBA and she loved them \nThis was one of her favorite songs by them 🇺🇲",
        "My grandpa was from Norway and was a huge ABBA fan. I grew up with him playing ABBA all the time. This past summer he had a massive stroke, I played this song for him when he was in the ICU. He squeezed my hand to the beat of this song. He is my angel now and I think of him every time I hear this song. Thank you for the music ABBA.",
        "I wish Abba had not separated  and I wish they would never grow old..Their music still mesmerizes me..",
        "This was music indeed not what todays generation is giving the world I miss those days singers. God bless them we learnt alot from their lyrics.",
        "One of the most beautiful songs ever written. It always makes me feel hope. These visuals fit perfectly",
        "September 2024, still there ! One of the greatest songs of all time.",
        "My mother was from Orebro 🇸🇪 Sweden, I lost her 2020,But She lives in me every minute of my life,I love ABBA FROM LAREDO TEXAS ",
        "ABBA is simply the best. Never outdated, always so fresh and refreshing. I'm so addicted to their music",
        "Abba, the absolute best. There is no group today that can even come close.",
        "Who would have imagined that Abba would write and produce one of the best country songs ever made.",
        "I was born 100 days early in April 1980; I weighed 1lb. 11oz and was only given a 10% chance of surviving. This song got my mother through my 3-month NICU stay. Bless ABBA and their wonderful music.",
        "The world is a better place because of Abba.",
        "Bellissime,indimenticabili le canzoni degli Abba",
        "You lift the spirit of millions of people - This is just such a great memory to me and a new start. Thank you and to everyone who listens I hope good fortune finds you.",
        "So glad that other people love Abba as much as I do I'm turning 50 this year and when things are going shitty I listen to Abba my mother introduced me to the  band they can solve anything as far as I'm concerned",
        "一直很懷念這樣的歌詞，歌詞中蘊藏者著深厚的文學素養，令人百聽不厭。",
        "️️️️ has it all...\nAgnetha & Björn & Benny & FRIDA️\nI LOVE THEM!\n️🇨🇱",
        "Abba is the undisputed champion of heart rendering music globally.",
        "a timeless classic.... so meaningful... touches the Soul",
        "I'm an ABBA fan my entire life. I just came back from Stockholm Sweden & visited the ABBA museum,  seen all their costumes.  my dream come true. AMAZING..I will never get tired listening to their music. THANK YOU FOR THE MUSIC..ABBA",
        "ABBA  best group the world has ever seen or heard,  simply beautiful and the best of all time ",
        "If you still have a mother , cherish her love herit's not simple to live without a mother even you're grown , mother's love is special..... continue resting in peace mother till we meet again ",
        "One of those unique teams which can make You feel the goosebumps with every song!\nGod Bless Forever ABBA ",
        "This song is like a hope for better future for me. ",
        "Beautiful Beautiful Beautiful",
        "몇십년을 들어도 질리지 않는 아름다운 가사와 멜로디 abba의 수많은 명곡 중에서 제일 좋아합니다.",
        "A little bit Greek, a little bit inspirational, full of wonderful melody and one of Abba's best ever songs (even though I think they're all the best!!) Thankyou for the video. I love this!!!!!",
        "One of the most beautiful timeless tunes ever.",
        "I too believe in Angels, Frida and Agnetha.",
        "Estou com 73 anos de idade, sou da geração que muito apreciou ABBA, para mim o melhor dos grupos musicais. Tenho um sonho que é ir visitar Dinamarca, Noruega, Suécia e Finlândia. Naturalmente que estando em Estocolmo quero dedicar um bom tempo visitando o Museu ABBA. Saudoso grupo, lamento que tenham encerrado as atividades após desentendimentos conjugais. EUGÊNIO (BRASIL). 28 FEV.2024",
        "Words are inadequate to describe this. This is what music should sound like. Not the garbage we are exposed to today.",
        "Дякую АББА - одна з Ваших незабутніх пісень!",
        "I love the fact that they sat down and bothered to write such a beautiful song. What a lovely story they tell. ",
        "Sounds fresh on the ears no matter how many times you listen to this.",
        "Abba are the greatest and their music is timeless",
        "It is Very good music",
        "Muzica tineretii mele.A fost,este și va fi superbă.La nivel superior.Muzică dulce care iti mangaie sufletul,iti alină supărarile.\nCei patru ABBA sunt nemuritori!\nMuzica lor este extraordinară!",
        "ABBA you're the best. Imagine hundreds of years from now, people are still hearing you.",
        "This song i dedicate to my late beloved father... Who bought me this disc Album in my childhood days.. When I was, nine yrs old. N I loved this song very much n slowly started all songs of Abba... Today I dedicate this fav song of mine to Abba too my fav album. N grp.. Thank u Abba God Bless still. \nI. Hear songs n my daughter too",
        "Dearest Abba what a lovely song one of my very favourites that really makes you dream and I am dreaming with you alive right now!\nThank you for sharing this lovely video with me!",
        "Very elevating tune and words . Beautiful voice too . Tks and bless you .️",
        "Spent a lot of my  childhood  listening to ABBA. Thank you for the music and the memories that pop back up whenever I hear these songs. God bless you all.",
        "Abba is Always magical",
        " Very nice",
        "Jūs visada buvote nuostabūs fantastiškas ketvertas ir jūsų dainos ačiū ",
        "I used to visit my Gran in hospital when she was passing away slowly and listening to this and other ABBA songs had her smiling and singing along with her eyes closed. It makes me well up in tears thinking of it. At the same time I’m grateful",
        "Since 1979 when I was at High School i have never stopped playing Abba songs. I have a dream is the ringing tone for my cell phone.",
        "After 44 years, this masterpiece finally is being given a video ",
        "The first step in success is believing it is possible.  This song is a very good one as it has hope in its lyrics. After all, if we have faith we can do it, we usually get what we want, but the secret is to persevere to succeed.",
        "Absolutely the most beautiful song  ... Thank You ABBA ️️️",
        "This song has such optimistic lyrics. It one of ABBA'S best songs.",
        "Lord god pls heard my prayers that my wish come true youre my hope lord.",
        "Some songs made for Eternity, never forgotten, always aktuell, always loved and played for decades. Thank you, Abba, for the music.",
        "ABBA THANK YOU ,LOVE FROM POLAND",
        "Thank you ABBA for this angelic song which gave me lots of strength during Covid. I’ve this book called 72 Divine names and I randomly opened a page last week and it was “ABBA”, it means Divine Father in Hebrew and that weekend I was going to see Mamamia for the 4th time. Such a synchronicity!",
        "Diese Band ist eine Legende. Die Musik ist einfach Spitzenklasse. Sowohl die Arrangements als auch die Texte. Einfach qualitativ weit über vielen anderen.\nHunderte Bands werden im Nebel der Zeit verschwinden, ABBA wird man noch in ferner Zukunft hören. Das ist wahre Unsterblichkeit.",
        "One of my favourite songs from voulez vous album and stunning vocals by Frida and I love the way they sang the song with children during their 1979 concerts. Also love this song at the beginning of the mamma Mia musical and film",
        "I'm here in Fiji 🇫🇯 ISLANDS IN THE SOUTH PACIFIC 2024 l love the song",
        "Real music! Real words that made sense! Not the garbage sex talk and cursing of today. 70's and 80's music will always be the best in my opinion",
        "A great song that is needed now more than ever in these dark times.",
        "Gyönyörű szép dal! Ezredik alkalommal is elbűvöli a zeneszerető hallgatót. A dal szerzői, előadói rendkívüli tehetséggel, adottsággal jöttek a világra, hogy millióknak szerezzenek felejthetetlen élményt!",
        "Without ABBA the world would be more sad ... thank you ABBA for over 44 years of fantastic music....",
        "いつまでも素晴らしいです！ありがとう！",
        "Master piece song️️️️️️️️️.Yes I have a dream.I believe in Fairy Tales,Angels,wounders and I am going through all the pain to reach there",
        "Such a beautiful song and voice. One of my favorites. Thank you ABBA ️️",
        "I believe in ABBA.",
        "Magnífico!",
        "ABBA, \" MY FOREVER DREAM \"  !!!!",
        "I had a dream \nSweet music to Our ears .. \nI do believe in  Angels  ...",
        "I use to sing this with My sister Jackie and Maria my cousin , when we’re little.  They both passed away , may they both rest in peace.",
        "ABBA My favorite group. i remember when i in 1973.️️️️",
        "Abba your songs help me through the hard times with my mental health thank you so much x",
        "I mom's from Venezuela, She's a huge ABBA fan, everytime i hear this song I remember her and i get i little nostalgic, I love you mom, this is real music ",
        "Abba is the Best",
        "Simply the best!!! Please believe in Angels THEY DO EXIST I CAN FEEL THEIR PRESENCE IN SOME OCCASIONS,WHEN I NEED THEM THE MOST",
        "Lovely effects of the text on screen!",
        "ABBA's pure feeling love , beauty , talent , inspiration , absolute magic and perfection forever .\nThis is a extraordinary pop group .\nAngels singing voices .\nI believe God inspired the swedish ABBA pop group definitely .",
        "ABBA: genius composer,  genius textwriter,  genius performance.",
        "Abba, my FAVOURITE SONG have a great evening we to everyone",
        "Thank you ABBA for this beautiful song ",
        "Dream ko ung taong mas mahal ko pa sa buhay ko i love you",
        "This song makes me miss my father oh so much…brings me tears to my eyes…he loved listening to ABBA.",
        "The backup singers are so pure.",
        "To jest przepiękna piosenka,  niosąca  niesamowite wartości i emocje,  ona nie ma prawa się nigdy znudzic, jest ponadczasowa,  dziękuje pięknie  ABBA, kocham Was",
        "I lived in Norway for over 40 years listening to ABBA brings back such loving memories of my life there my children and grandchildren are Norske at the age of 75 i still listen to ABBA . Tusen Takk ABBA.",
        "Obrigado Deus por me permitir viver até hoje. Tenho meus 65 anos, prestes a completar 66 e com saúde, trabalhando, curtindo meus 6 filhos e meus três netos. A vida é perfeita quando se ouve uma canção dessa. A cerveja gelada não pode faltar, principalmente quando o pessoal reúne, monta a banda e a farra segue madrugada adentro. É assim que vale a pena viver!   lurdinha Bambui MG",
        "Thank you for ever ABBA love ",
        "Einfach wieder toll .Abba \nWunderbar.So eine Zeit und so eine Musik kommt nie mehr. Danke.",
        "Que saudade desse tempo , hoje não tem músicas como essa. Se eu tivesse o poder de retornar ao  tempo , o faria com maior satisfação. Isso sim que é música e não as porcarias que tocam hoje.",
        "”I have a dream”  A beautiful, pleasant and so deeply touching song! So is gonna be the new video! ",
        "The songs that doesn't have expiry date... forever ",
        "I remember this song first coming out - I would sit between my stereo speakers and take it all in.  Great song, performance, and recording!",
        "Los quiero muchooo Abba son número #1 de las mejores bandas de los 80 ️",
        "This music reminds me of the 70s and early 80 in SA. It was around 76 to 80 the mood was somber because of revolution but ABBA made many people forget the bitterness. Still remember Tembisa 834.",
        "Abba is wonderful . I love “I have a dream “.  From Australia. ",
        "Such a beautiful song love it fabulous performance by Frida and ABBA! ️️️",
        "ABBA is like the best thing that ever happened to music, it's just so uplifting and feel-good that it's impossible not to smile. They have a magical ability to make you feel like you're on top of the world. Their captivating melodies and infectious rhythms speak to our universal human experiences of love, heartbreak, joy, and sorrow. ABBA 🫶",
        "J'adore cette chanson "
    ],
    "I Let The Music Speak by ABBA official": [
        "When Frida was asked what her favourite ABBA song is, this is the song she chose. It really is outstanding.",
        "Before 2021, all I knew of ABBA was their hits. Then I got the \"Voyage\" album and loved it so much, I went out and bought the boxed set of their albums. I listened to them in chronological order (obsessively), to be shocked at how many AMAZING gems are hidden in their repertoire. Just when I thought they couldn't top themselves, I finally got to \"The Visitors\" album, and heard this GORGEOUS song. It brings a lump in my throat every single time. The melody, the arrangements, the lyrics, Frida's outstanding vocals (one of her very best), the harmonies... This song deserves a higher profile. What a jewel.",
        "A word of advice - listen to all ABBA songs through decent headphones as you hear how good the production is that way, so you'll hear much more going on in the background than you ever imagined....",
        "It's not a song, it's a symphony.",
        "this is a different kind of abba that only true fans can understand and love",
        "Frida is a mind-boggling vocalist talk about power she’s just killing it",
        "A symphony for true connoisseurs. And that velvet Frida's voice",
        "One of the best ABBA songs ever with the greatest Frida's lead vocal!  4:47 ",
        "This is ABBA only for peoples of refined and very good taste in pop music .\nEpic Masterpiece Forever .\nI love Frida's voice .\nThe highest worldclass quality pop music level definitely .\nThe biggest iconic living legend of pop music in the world is ABBA until today .\nThank you very much dear ABBA group for all the timeless classics masterpieces and gems of pop music legacy in the world .\nAll my love is for you ABBA forever !!! ",
        "One of Abbas most underrated but nevertheless one of the best songs.",
        "Безумный голос Фриды, которая может все - от джаза до оперы...\nНа самом деле голос пробирает до самых сокровенных уголков души, нет равных",
        "Tremenda voz de Frida ",
        "Hoy en día Frida hubiera sido la Reyna absoluta de los musicales por su increíble registro vocal..",
        "Amaizing the Frida Voice!!!!!",
        "One of their greatest (amongst many) ",
        "Wonderful voice of Frida....it's great! My favorite song by ABBA!",
        "Absolute masterpiece, my fav ABBA song of all time",
        "Альбом the Vlsitors у АВВА получился строгим и в меру серьёзным, но наверное  самым лучшим. Браво АВВА!! Молодцы!!",
        "Underrated. So totally underrated. Why is this underrated? ABBA are underrated.",
        "This cristal voice of  Frida absolutely answered to the aimes and ideas of Benny",
        "The song is guided by the art of it's lyrics, the melody follows, and the outstanding performance finishes it. A classic and evergreen.",
        "Both Frida and Agnetha are master vocalists who could effortlessly glide up and down to create truly thrilling effects - this might be the best example - Frida's vocal is so intimate but so expansive at the same time - breathtaking!",
        "This is not a song, it is more than a song",
        "Это, безусловно, вершина творчества ABBA!! Голос Фриды,  волнующий безумно коасиввц, волшебный и невероятная музыка Бенни...",
        "One of the best Frida's songs. Love Frida, love ABBA! And let the music speak!",
        "Oh, how many times has given this song comfort to me since I heard it the very first time in december 1981, when I was 15!",
        "Imagine listening to songs like Dancing Queen and Waterloo and then stumbling on this. Frida and Agnetha are incredible versatile singers.",
        "Pure poetry. Like a tone poem. The imagery is breathtaking.",
        "Frida !!! Bellísima interpretación",
        "Frida's no.1 lead vocal song!",
        "Was Fuer eine tolle Frau.Diese tolle Frida",
        "I'm hearing images, I'm seeing songs\nNo poet has ever painted\nVoices call out to me, straight to my heart\nSo strange, yet we're so well acquainted\nI let the music speak with no restrains\nI let my feelings take over\nCarry my soul away, into the world\nWhere beauty meets the darkness of the day\n\nWhere my mind is like an open window\nWhere the high and healing winds blow\nFrom my shallow sleep the sounds awake me\nI let them take me\n\nLet it be a joke, let it be a smile\nLet it be a farce, if it makes me laugh for a little while\nLet it be a tear, let it be a sigh\nComing from a heart, speaking to a heart, let it be a cry\n\nSome streets are emptiness, dry leaves of autumn\nRustling down an old alley\nAnd in the dead of night, I find myself a blind man\nIn some ancient valley\nI let the music speak, leading me gently\nUrging me like a lover\nLeading me all the way, into a place\nWhere beauty will defeat the darkest day\n\nWhere I'm one with every grand illusion\nNo disturbance, no intrusion\nWhere I let the wistful sounds seduce me\nI let them use me\n\nLet it be a joke, let it be a smile\nLet it be a farce, if it makes me laugh for a little while\nLet it be a tear, let it be a sigh\nComing from a heart, speaking to a heart, let it be a cry\n\nLet it be a tear, let it be a sigh\nComing from a heart, speaking to a heart, let it be a cry\n\nLet it be the joy of each new sunrise\nOr the moment when a day dies\nI surrender without reservation\nNo explanation, no questions why\nI take it to me and let it flow through me\nYes, I let the music speak\nI let the music speak",
        "unique frida's voice",
        "The best ABBA song ever",
        "wath a wonderful song  and voice of Frida <3",
        "This really sounds like an outtake from a musical. Benny and Bjorn were very much into the idea of writing musicals, and that factored into the decision to put ABBA on hold.",
        "This is one of those ABBA songs that I just love! I think that in this composition we have what we can call the true essence of this great group!",
        "Brano eccezionale, musica bellissima, voci maestose. Grazie Abba ",
        "Oh mein Gott !!! Das ist eine fantastisch musik für immer !!!\nIch liebe ABBA !!!\nVielen dank ABBA für immer von Herz !!!\nI love you ABBA forever !!!\nABBA\nAll the ABBA music's like how one very beautiful , wonderful and divine spiritual experience .",
        "Benny and Bjorn prepping for the masterpiece Musical  Chess",
        "Something about this song is bringing me to my senses. this album I feel all the way.",
        "I was surprised this song DIDN'T make the UK charts. It's really something special to listen to!",
        "This song gives me so much chills",
        "As ABBA matured, and we matured, they went with us deeper into our souls as we went deeper into the stages of life. That's why they will ALWAYS be IMMORTAL! like Mozart and many others. Every generation will go through this process and ABBA will be they to guide them and help give expression to their experiences and feelings. We have been so blessed!",
        "Abba sempre anticipatori, Frida meravigliosa ",
        "Abba are so perfect in their composition and musical arrangements,then there is the pitch perfect harmonies,so smooth,they have a great talent for making a song melodious  and never boring ever .They are so perfect their music will stand the test of time, it's not just good it is the best",
        "one of my most beloved song. full of emotion and memories.",
        "This is Frida's thank you for the music.  It reminds me of Les Miserables.",
        "Any song of ABBA was, still is an' will remain in us as the melody we breathe with, sunlight we live under an' love we live for... ️",
        "what a great song",
        "Masterpiece!️Also, a masterclass in singing!",
        "Jeden z najpieniejszych zarowno muzycznie jak i lirycznie stworzonych przez AbbA utworow",
        "ABBA LA MÚSICA POP MUNDIAL MÁS TOP Y DE MÁS ALTO NIVEL , CALIDAD , ELEGANCIA Y BELLEZA ABSOLUTA .",
        "Frida rocked in this Album.",
        "All the ABBA music is my absolute adiction and obsession ever .\nWhat a very special , extraordinary , exclusive , fine , elegant and beautiful ABBA music .\nI love Frida's voice !!!\nTimeless classic masterpiece God level .\nThe version is pure gold , beauty and perfection forever in the world .\nReal treasure , gem and very best musical legacy .  \nThis is magic music true absolutely .\nGenius songswriters and musicians .\nThe most beautiful angelic voices in the world pop music .",
        "DIE SCHÖNES UND WELTKLASSE QUÄLITAT ABBA POP MUSIK .\nDANKE LIEBE ABBA FÜR IMMER .\n\nI WISH NEVER DISAPEARS THIS MAGIC ABBA MUSIC .\nEVERY ABBA SONG IS A MASTERPIECE ABSOLUTELY .\nTHE ABBA MUSIC IS A DIVINE EXPERIENCE FOR ME EVER .",
        "ABBA is absolute beauty of music in the World forever !!!  Immortal spirit !!!",
        "Fantástica",
        "One of the most romantic songs ever thanks Abba!!!    ",
        "Er hat so eine hammer stimme . Richtig geiler song . Geiles lied .\nDas lied ist einfach nur der Hammer .\nIch liebe dieses lied .\nEiner der besten lieder aller zeiten .\nDANKE ABBA FÜR IMMER !!!\n\nMy ears feel blessed with the Frida's voice .",
        "ABBA for ever",
        "Away from the Hits,,, total Gems like this track,, are totally brilliant,,,,, ABBA will live on for ever more,,,, total enjoyment to my ears",
        "This masterpiece with  Fridas ledvocals is like successor to Thank You For The Music. Love this song.",
        "Inducted into the Modern Classical category since 1981 >>> Bravo! ️",
        "Great magnificent song,  ",
        "I dont know why, but thisis my favourite album..SUPER!!!",
        "One of abba’s best ",
        "Wonderful wonderful wonderful!!!",
        "Abbas best album . Some really good stuff",
        "BEAUTIFUL still beautiful 🫶️",
        "Sublime !! Beautiful !! In my opinion one of ABBA’s best ever albums",
        "Лучшая песня всех времен и народов.",
        "A B B A ...nadčasová,skvělá,milovaná a nádherná musika,texty a jejich nápady mně prostě provází po celý můj život.Miluji ABBA a nyní vydaný jejich nový písničky ...jsem v ůžasu a budu pořád .Děkuji za pěkný pohlazení po duši  Milan Halfar Praha 4. Lhotka 142 00 I LOVE Agnetha,AniFrid ,BENNY a Bjern.(dříve Vřesina u Hlučína)",
        "Just beautiful!",
        "Prekrasna je, njihova najbolja, najpotpunija, najglazbenija, najpoetičnija, najzrelija stvar! A.V.",
        "My favorite ABBA song",
        "Боже мой, что делает эта песня с моим сердцем ...",
        "Absolute masterpiece my favourite ABBA song ever",
        "This song belongs on a West end show",
        "A wonderful song with Frida's wet voice and the alternating 3 and 4 time signatures.",
        "Песня- размышление! Песня-философия! … Очень трогает.",
        "SU MAJESTAD  ABBA    \n️ 🇸🇪\nTHANK YOU ABBA FOR THE VERY BEAUTIFUL MUSIC , SONGS AND THE FABULOUS ANGELIC VOICES .\nI LET THE MUSIC SPEAK .\nTHIS IS A FANTASTIC AND VERY SPECIAL GEM AND TIMELESS MASTERPIECES FOREVER IN THE WORLD POP MUSIC .\nTHE IMMORTAL ABBA MUSIC OF EXTRAORDINARY AND DEEP'S INSPIRATION AND BEAUTY LIKE HOW HER SOUL .",
        "I love ABBA",
        "4 me the greatest \"ABBA-Album\" ever!",
        "Abba always cheers me up",
        "Frida",
        "ABBA 1981 - 2024 ",
        "AMO ABBA POR SIEMPRE LO MEJOR EN MÚSICA POP DE TODOS LOS TIEMPOS A NIVEL MUNDIAL .",
        "Опять повторюсь, но это вершина творчеста этой великой  группы, лучше голосов нет и не будет...",
        "ABBA ist wunderbar und weltklasse pop gruppe immer .\nIn total deep spiritual trance meditation with the very beautiful and wonderful ABBA music .",
        "Wunderbar ",
        "Einzigartig",
        "So soft nd nice to hear your magnificent voice frida.a lullaby ,thank you frida youre the best",
        "Abba ",
        "Que belleza!!!!, no me canso de escucharlo!!!",
        "Timeless!... great music ",
        "Maravillosa!!! ",
        "Chef d'oeuvre",
        "Como puede no gustar esto?\nQué gente más rara.",
        "O wat een song.\nFrida op haar best.\nWat een stem!!!"
    ],
    "Crying Over You by ABBA official": [],
    "I Am Just A Girl by ABBA official": [
        " My late Auntie liked this song  I  can see why. Lovely tune. Miss you Auntie Jean ",
        "Abba, a brilliant band. A legend for all time!♪♪️♪♪",
        "Amazing song 🩷",
        "Literally my fav song ever.",
        "This is what i think of when they say \"i am just a girl\" ",
        "Спасибо за музыку! Лучшая группа всех времён!!!",
        "★ Happy Birthday to Agnetha Fältskog ! ",
        "I have looking for this song so long",
        "ABBA IS SO GOOD GOD I LOVE YOU ABBA",
        "Love this Ray Coniff style ️",
        "Timeless!... nice",
        "Love this song",
        "Another great music! ️ (Used to listen it a loooot)",
        "love youuu",
        "Thanks for this!    #ABBA  #IAmJustAGirl",
        "I  this song very much",
        "...when i am away from you, i am happier then ever .....",
        "Thank ABBAso nice song! 2:43",
        "* AROUND THE WORLD ABBA BEST EVERRR!***",
        "I love this song it has a sound like The Beatles!",
        "",
        "Never heard before....",
        "この曲はかつて「夏の終わりの少女」と言う邦題が付けられていましたが、９２年にCD化の際は「アイム・ジャスト・ガール」と言う原題通りの曲名が記載されていました。\nやはり、過去の邦題のほうがずっと良かったと思います。",
        "Lyrics:\n\nI am just a girl, one among the others, nothing much to say\nPlain and simple girl, not a special type in any way\nJust one look, and you will surely see\nThat the true \"Miss Nobody\" is me\nIt's an evil world that has only made me a girl\n\nI am just a girl, not the kind of woman men would like to meet\nJust another girl no one ever looks at in the street\nBut today, I can't believe it's true\nWhen you smiled and whispered \"I love you\"\nDarling, I could see I was meant to be your girl\n\nIt's a funny feeling when you get to love someone\nAnd thinking that he'll never look your way\nBut then he says he loves you, and life has just begun\nIt's so much more than any words can say\n\nI am just a girl, not the kind of woman men would like to meet\nJust another girl no one ever looks at in the street\nBut today, I can't believe it's true\nWhen you smiled and whispered \"I love you\"\nDarling, I could see I was meant to be your girl\n\nLa, la, la, la, la\nLa, la, la, la, la-la\nLa, la, la, la, la\nLa, la, la, la, la\nLa, la, la, la, la-la, la, la, la\nBut today, I can't believe it's true\nWhen you smiled and whispered \"I love you\"\nDarling, I could see I was meant to be your girl",
        "",
        "untypisch für ABBA, aber gerade deswegen besonders. Geht in Richtung \"easy listening' oder Bert Kämpfert. Mir gefällt es jedenfalls.",
        "No está en Spotify ",
        "Is it just me but this sounds strangely like UNDERNEATH THE ARCHERS especially  the choruses",
        "Hibbie A, which Doodle Do Song samples This song",
        "anna"
    ],
    "I Saw It In The Mirror by ABBA official": [
        "Great song. Another Abba gem discovered.",
        "A classic ",
        "My favorite ABBA song!",
        "Timeless!.. thank you ",
        "Lyrics:\n\nI saw it in the mirror, I saw it in my face\nThat I'm no longer needed, anyone can take my place\nI saw it in the mirror when I look into my eyes\n'Cause something sure is wrong when this boy cries\nThis boy cries\n\nI saw it in the mirror, my head is hanging low\nAnd I ain't too familiar with the feelings that I show\nI know you say you love me, but I'm looking through your lies\nIt doesn't really bother you if this boy cries\nThis boy cries\n\nI never thought I could cry for you\nBut honey, I will miss you till the day I die\nTill the day I die\n\nI saw it in the mirror, I saw it in my face\nThat I'm no longer needed, anyone can take my place\nI saw it in the mirror when I look into my eyes\n'Cause something sure is wrong when this boy cries\nThis boy cries, this boy cries",
        "J'aime beaucoup cette chanson et l'album est magnifique",
        "i love you abba",
        "i love it!",
        "Hibbie A, which Doodle Do Song samples This song",
        "1:22 SHEEESH",
        "Only 3 to 4 Abba-songs are boring. This is one of them."
    ],
    "Kisses Of Fire by ABBA official": [
        "Voulez-Vous might be the most unskippable album of all time",
        "The exultant \"losing you!\" is a touch of genius.",
        "An awesome song. So delicate at the beginning. Then, it changes into a pure dynamite.",
        "Abba are the gift that keeps on giving and giving,  On And On And On. They Let The Music Speak and we say Thank You For The Music ",
        "This song is criminally underrated. My favourite abba song of all time",
        "The only thing wrong with ABBA songs is that they aren’t anywhere near long enough I could listen to them all day and NOT get bored",
        "Yet another masterpiece. ABBA just kept them coming.",
        "This band will never be equalled\nSomething special about their music and vocals\nI have listened to them for 40 years ",
        "I was 12. The first song I ever heard that made me fall in love with music. That ‘Losing you!’ is rapturous. I played ths song over and over again all week long before ever thinking to turn the 45 over to hear the other song (Does your mother know). From then on out, I have been a HUGE ABBA fan. There is none better.",
        "Timeless music..never a band will be like Abba again. So catchy and makes you feel alive and young",
        "в песнях этой группы удивительным образом умещались ; красота , доброта , простота , гармония , счастье , - они подарили нам волшебные мгновенья нашей молодости , золотое время было как я их всех любил ",
        "The most beautiful , adorable , enchanting , lovely , unforgettable and dear pop band of all times in the world .\nPure beauty , talent , inspiration , excellence , elegance , high quality level and pop perfection .\nThe wonderful angelic voices with splendid songs and music .\nVery nice style pop group .",
        "This is the most underrated song of all times, Great masterpiece ",
        "Великая,Легендарная АВВА.",
        "THANK GOD FOR ABBA !!!  THE BETTER , WONDERFUL AND MOST BEAUTIFUL EXPERIENCE IN THE WORLD POP MUSIC OF ALL TIMES , AND FOREVER !!!! \nDIVINE AND VERY BEAUTIFUL MELODIES , HARMONIES , LETTERS , MUSIC , LYRICS AND VERY NICE ANGELS VOICES SINGING !!!\nI LOVE ABBA !!!\nABBA IST WUNDERBAR , ICH LIEBE DIESES LIED !!!  ICH LIEBE ABBA FÜR IMMER !!!  WUNDERSCHÖNES LIED !!!\nBESTE POP GRUPPE UND MUSIK IN DER WELT !!!!",
        "Abba ist das Beste Geschenk für uns Fans. Jeder einzelne Song ist absolute Oberliga.",
        "the first seconds are like a sunshine  ray !!",
        "Esta canción actúa brutalmente sobre el sistema nervioso y elimina la tristeza. Un clásico que no solo no envejece sino que suena más actual que nunca.",
        "Wow so seriously underrated.",
        "Este disco en mí infancia..y lo sigo eligiendo por armonía,sonido adelantado a su tiempo y esas voces de ángelesABBA por siempre ",
        "ABBA they are so angels of music . ",
        "Temazo besos de Fuego para mí voulez vous y The visitors son los mejores en cuanto a sonido y evolución del pop moderno, estos suecos fueron un fenómeno gracias a su calidad cuando el pop era música de mucha calidad exquisita y no tenían nada que envidiarle a ninguna banda de la época Abba está entre las 5 bandas más importantes de su época y hasta la actualidad sin dudas",
        "I wish to everyone a happy 2023 year  !!",
        "love love love agnetha always and forever xxx",
        "It's just mind- boggling, the sheer pleasure and joy that these four human beings brought to literally hundreds of millions of human beings across the world.",
        "ABBA !!!!!!!!!!!!! I LOVE YOU!!!",
        "so beautiful, romantic, sensual.",
        "I didnt like this song 5 years ago but I've changed my mind now",
        "I always tear up when listening to ABBA, only because it's so incredible good.",
        "Jesus christ this still hits like a thousand volts.",
        "LOVE THIS SONG",
        "Most underrated abba song ever i love it sm",
        "YOU GO GIRLS!!! MY DARLING ANGELS!!! FOREVER SETTING THE MUSICAL WORLD ON FIRE!!!",
        "Abba from Sweden",
        "Ohhh great old years where have you gone such memories",
        "Timeless!... thank you",
        "Kisses of fire what a song one of there best love itquick put the fire out",
        "2020r.....️",
        "Estos discos no tienen fecha de vencimiento jamás desde Argentina año 2024 escuchando la calidad de Abba",
        "Absolute gem , masterpiece , beauty , treasure and divine perfection is this song and all the magic ABBA pop music forever in the world . \n🇸🇪 \nThe most beautiful angelic voices , melodies , harmonies , lyrics , compositions , interpretations and magic songs . \nThis is all pure angelic beauty and pop music perfection .",
        "No hubo, no hay y creo que no habrá , nada ni nadie mejor que este grupo de música popular, son  fantásticos ,, insuperables......",
        "Kisses of fire, sweet deVOTIONS.\nGets me every time! ",
        "ВЕЛИЧАЙШЫЕ шведы всех времён!️️️️️️️️️️️️️️️️️️️️️️",
        "Adoro essa música! !!   :  )",
        "Matices excelentes,y la melodía extraordinaria!!!",
        "One of my favorite song of Abba and one of a diffult song to sing I have their cassette tape of this album made in Japan that was 1977 now im 60 yrs old and i still keep the album until now.",
        "This is my new second favorite ABBA song.",
        "Extraordinaria canción!!!",
        "MEINE LIEBLINGS BAND VON MUSIK .",
        "How come this is not famous",
        "Lay your head on my chest\n당신의 머리를 제 가슴에 기대세요\nSo you hear every beat of my heart\n내 심장의 모든 박동을 들을 수 있게요\nNow there's nothing at all\n이제 아무 것도 남지 않았어요\nThat can keep us apart\n우리를 떨어지게 만들어 놓을 것들이요\nTouch my lips\n제 입술을 만져주세요\nClose your eyes and see with your fingertips\n당신의 눈을 감고 당신의 손가락끝을 가지고 보아주세요\nThings that you do\n당신이 하는 것들\nAnd you know I'm crazy about you\n당신에게 미쳐있다는 것을 알죠\n\nKisses of fire burnin' burnin'\n불같은 키스들 버닝 버닝\nI'm at the point of no returnin'\n돌아올 수 없는 순간에 있어요\nKisses of fire, sweet devotions\n불같은 키스들, 달콤한 헌신들\nCaught in a landslide of emotions\n감정의 산사태 안에 사로잡혀버렸어요\nI've had my share of love affairs and they were nothing compared to this\n몇 번 사랑을 해본 적이 있었지만 이것에 비할 바가 못 되네요\nOh, I'm ridin' higher than the sky and there is fire in every kiss\n하늘보다 높이 오르고 있고 모든 키스에는 뜨거운 불이 있어요\n\nWhen you sleep by my side\n당신이 내 곁에 잠들 때\nI feel safe and I know I belong\n안전함을 느끼고 소속감을 알아요\nStill it's making me scared\n여전히 나를 두렵게 해요\nThat my love is so strong\n나의 사랑은 아주 강해요\n\nLosing you is a nightmare fate and to me it's new\n당신을 잃는 것은 악몽이에요 그리고 내게 새로움이에요\nNever before did you see me begging for more",
        "A super pop group very advanced for those past times with her music .\nToday the ABBA music is TOP absolutely .",
        "ALWAYS ABBA IS VERY NICE AND HIGH WORLDCLASS POP MUSIC QUALITY LEVEL .\nPURE TALENT , BEAUTY , INSPIRATION AND PERFECTION .\nTHE BIGGEST POP BAND OF ALL TIMES IN THE WORLD .\nHEAVENLY , ANGELIC AND MAGIC SINGING VOICES SOUNDS .",
        "LOVE MUSIC!!!",
        "Fantastisch . Ist Nach Wie Vor Die Beste Gruppe Der Welt .\nABBA Ist Eine Legende Guter Pop  Musik Und Dieser  Song Ist Einer Meiner Lieblingssongs .\nEinfach Perfekt Und Magik .\nIch liebe ABBA .\nSuper Songs , Fantastisch Musik Und Himmlisch Stimmen .",
        "АВВА  -СУПЕР",
        "Unable  to  see  them  live  in 79 so voyage  is definitely  on my bucket  list  simply  brilliant ",
        "Arrival another good album",
        "It's like being hit by a bolt of lightening. ...what a masterpiece. ...",
        "This is a beautiful song.",
        "ABBA is real greatness in the world pop music until today and forever true absolutely .\nIs absolute extraordinary beauty , high and deep inspiration , very good musicians and songswriters  , the most beautiful angelic voices and melodies ,  very nice songs and style  , fabulous compositions and heavenly interpretations .\nThis swedish pop group is pure talent , total perfection and magic in all aspect .\nI not doubt wha this is the biggest pop band of all times in the world .\nA divine level pop group .\nMy dear angelic , heavenly and magic swedish idols of pop music .",
        "Shaun Peter Radford, you give me all the feels and I'm looking forward to waking up beside you on Christmas morning this year. I hope that I get what I REALLY want this year ",
        "Un grupo de música pop sueco con mucha belleza , talentto , elegancia , alta clase , extraordinario estilo e inspiración .\nFantastica música , magicas canciones y voces celestialmente bellas y angélicales .\nQuizás el nivel más alto de la música pop mundial de todos los tiempos hasta hoy .",
        "love to all xxx",
        "2:37 - 2:46 the long tail of a comet!!!",
        "Ein Traum",
        "Beautiful song better than the crap you hear on Radio Stations today.",
        "Quelle maîtrise de l'art musical..cette chanson est conçue comme une histoire... l'interprétation d'Agnetha est tout simplement incroyable",
        "Notice how they jump on the long-note wagon in this song, just like Donna and Babs.",
        "Super",
        "If I were a doctor, or a shrink.. I'd prescribe ABBA's music( karaoke are mandatory), to my suffering patients.\nDespite the pain and sorrow described in the lyrics, sometimes very deep symptoms of depression( Scandinavians and Northern People  probably know better how to fight against it?) ; \nthe sublime music and the heavenly harmonized voices of Agnetha and Frieda, always manage to turn the blues into a blissful feeling of joy!\nThey are, imho, and it is working on me( I got bpd, cptsd, and was severely depressed for years), one of the best anti-depressant( with sunlight, walks in the wood and....DOGS).\nMay ABBA be blessed for what they have given to Humanity:\nA powerful medecine against the gloom of life.",
        "sunt cei mai buni",
        "Fire  and kiss  touched as many lives",
        "In the United States of America, this selection was the song on Side B of the \"Does Your Mother Know\" 45 rpm single from 1979.",
        "mantengan  esta  musica   en  la  historia  musical  por siempre",
        "0:53 Appreciate the rhyming here\nI've had my SHARE of love AFFAIRS and they were nothing COMPARED to THIS\nI'm riding HIGHER than the SKY and there is FIRE in every KISS",
        "Love it ",
        "I suppose there's the longest note of Agnetha in this song.",
        "An absolute killer tune. To think this was a b/flipside.",
        "George Lucas: What should be ultimate space sword?\nBenny: Bjorn, here hold my Lightsaber",
        "ABBA DE LIS AÑOS DORADOS DE LA MUSICA Y LA JUVENTUD AÑIS 70,80.LA HISTORIA CUENTA GANARON EL CERTAMEN DE EUROVICION CON EL TEMA WATERLOO Y SALTARON ALA FAMA.ADEMAS ESTOS GENIOS SIN DABER CASTELLANO CANTARON EN CASTELKANO.PORQUE SE CREA EL TEMA THE WINNER AGNETTA LE DISE A SU ESPOSO QUE SE VA SEPARAR EL DE DOLOR LA ESCRIBE EM MEDIA HORA Y LE PIDE A ELLA QUE LA CANTE LE SALIO ESPECTACULAR MEJOR SOPRANO PARA MI.TUBO QUE PASAR 40 AÑOS PARA DARNOS CUENTA QUE LA DESOLUCION DEL GRUPO FUE LO MEJOR SE AN REUNIDO PARA DAR CONCIERTOS PERSONALMENTE PREFIERO RECORDARLOS COMO EN LOS COMIENZOS UNO GENIOS   DE LA MUSICA Y LA COMPOSICION.10 AÑOS DE FAMA RIQUEZAS Y ANGUSTIAS PAGARON CON SUS PROPIAS VIDAS DEJARON UN LEGADO MUSICAL PARA LA POSTERIDAD.ABBA GRACIASSSSS,POR LA MUSICAAAAA,Y POR HABERRRRRR,EXCISTIDOOOOO,DE SUECIA AL MUNDO CON MUCHO AMOR🇺🇾",
        "️‍️‍️‍️‍️‍️‍️‍️‍️‍",
        "  #ABBA  #KissesOfFire",
        "The Spy Who Loved Me \nRoger Moore was 1979.\nThese guys should have done the soundtrack!",
        "ABBA VOULEZ VOUS  KONCERT",
        "Wow. 2024",
        "️️",
        "Anyone in 2024 ?!",
        "Hibbie A, which Doodle Do Song samples This song",
        "Tout Uand je suis amener a pense a tel ou tel ou tel chose et qui se realise dans la journee , d ordre extra terestre .comme piur allumer la teke au bon moment ,sur la bonne chaine ,d ordre ici aussi extra terstre ,avec evidemment un sixieme sens qui carbure a cent a l heur .",
        "August 2024 - someone listening ???",
        "Jajajajajajaja estas canciones no pueden faltar en las fiestas\nEn mi fiesta puse musica de ABBA, también los puse el día de mi graduación de secundaria\nYa sabrán, yo con mis 16 años tengo discos de ABBA",
        "Also its june halfway to 2025. Who will listen in 2025?",
        "yass drag race sverige",
        "Il n'y a rien de pire que d être insulte ou agressé en pleine rue surtout quand vous avez un petit handicap ,donc mes fans sont bien là et je les aime autant qu ils m aiment et tempi si je ne sais toujours pas pourquoi je suis connu ,je m entend iper bien avec eux ,c est le principal .",
        "My first kiss from Lapis Lazuli in a nutshell",
        "11 de julio.",
        "",
        "Kane Brown",
        "la canción de Ger Back de The Beatles."
    ],
    "Knowing Me Knowing You by ABBA official": [
        "I thank Sweden for ABBA!",
        "When u start listening to one ABBA song, believe me, it will be followed by a chain of ABBA songs",
        "Part of growing up is admitting and internalizing that no matter how much metal you've headbanged to growing up, ABBA will forever be timeless classics.",
        "No auto-tune...just all natural, wonderful voices & harmony! Fantastic group! It's sad their marriages didn't last, and it is sad the group didn't continue and provide us with more wonderful ABBA songs!",
        "Imperfect teeth, normal skin, beautiful feathered hair, realistic lyrics, natural voices, can anyone not understand why these 4 people were superstars?  I love them.  And always will.",
        "It's 3.30am, UK and listening to Abba. Songs from late 1970s in year 2023. Still love them. Truly timeless classics. I thank them for their music.",
        "Their voices were made for eachother.\nIt's like a musical miracle that can't be repeated.",
        "THANK GOD THAT I WAS A TEENAGE, WHEN THE MUSIC WAS LIKE THIS!\n18.10.2024. БЕОГРАД ,СРБИЈА.",
        "The most mature break up song I've ever heard, and I love it.",
        "Isn't ABBA just brilliant, always? What more can you say?",
        "This is how addiction starts, one ABBA song after another.",
        "I have to say, every ABBA song is my favorite; but if I HAD to choose, it would be ‘Knowing Me, Knowing You’.",
        "A masterpiece. They don't write songs like that anymore. Every sound is perfection. The melody flows like a stream around rocks and pebbles. The voices, the instrumentation, the lyrics. Perfect harmony. And the video is so poignant and moving. Beautiful through and through.",
        "They are addictive..you cannot listen to just one song.",
        "This song was recorded in 1976. It still sounds as fresh as a daisy. My goodness, how far ahead of their time they were. Long lasting melodies, perfect production, strong arrangements and impeccable vocals. Those days are gone. Fortunately we can enjoy the music Abba made back 45 years ago",
        "No singing group of any era can compare to ABBA ",
        "Probably my favorite ABBA song,  but always makes me feel sad",
        "Welcome back, ABBA, your songs are pure magic.",
        "ABBA was definitely ahead of their time. THIS is music.",
        "I will be listening to Abba till I take my last breath!....Much love to all",
        "One of the best pop songs ever.",
        "The Beatles may the most influential band of all time, but no band will ever define pop music the way Abba did.",
        "88 years old here and my wife and I love this group. No other group or singers can measure up to them !",
        "When the beat drops with \"Walking through an empty house\", as that is the exact moment when you know deep down you were & would ALWAYS BE an ABBA fan for LIFE! ",
        "I'm 18 years old and ABBA's songs helped me overcome depression. I am so grateful for that! thanks for the music",
        "The hamonizing voices of these ladies still gives me goosebumps.",
        "They don’t make songs like these anymore. A true gem!",
        "Abba is the best! Still in 2024!",
        "They perfected singing in harmony. No autoune  or lip syncing. This is what real music sounds like.",
        "A song that's a total masterpiece from the first note to the last.",
        "How did they manage to write and perform such wonderful songs when their hearts must have been breaking?",
        "I still can’t get over how brilliant their musical composition was.",
        "They complimented each other, like it was all meant to be. I wish they were still together. Their music will never end, ever.",
        "If loving Abba is wrong, then I don't wanna be right.",
        "The more i listen to todays music,  the more i realize how great music of Abba was, and still is. Total genius. Best vocal group in music history. Nothing compares to them, they are in the same league as the Beatles and Queen.",
        "ABBA Music \nIs a forever TIMELESS \n2024 Anyone ???",
        "My divorce was finalized 20 years ago, and I was SO glad about it, but every time I hear this song it makes me cry.  No one intends to end up divorced, and Agnetha did an interview where she mentioned that both couples tried to make their divorces as painless as possible, but it just isn’t possible. Benny and Bjorn truly are two of the best writers this world has ever known.",
        "I'm listening to this music in 2024 and it's still the greatest.  Abba is such a great group. Never get tired of listening to them.",
        "When you hear ABBA’s songs almost 50 years later they sound as good back then as they do now an ABBA fan forever! ️",
        "Humanity will never again see a musical group as good as ABBA!",
        "Lyrically, as dark as anything you would hear in punk or metal, and they wrap it all up in that honeyed sound. Beautiful, and not a lick of age on it.",
        "The way the light catches their flowing locks, the soft focus, the sadness in their eyes. The girls tear me up, too.",
        "The lush and narcotic effect of Frida and Agnethas voices combined, is unreal.",
        "I'm 72 years old and LOVING this song!",
        "The two Abba girls create the most amazing vocal harmonies! I just love them!",
        "It´s a mystery to me how they could turn a painful experience and existential crisis like a breakup or divorce into a timeless pop song.Those guys and gals are true artists.",
        "It's crazy how personal this song is to the band members, yet we find ourselves feeling their love, their lives, their loss. A quartet of geniuses. Always gives me goosebumps.",
        "That bass line. Those guitars. Those vocals. The production and video. The lyrics. That timeless melody. I love ABBA and this is among my faves...and of those  there are plenty. What a band!!",
        "FRIDA AND AGNETHA VOICES COMBINED IS JUST MAKES ALL THEIR SONGS BEAUTIFUL.",
        "Abba is timeless.",
        "It hurts. This song is so true…",
        "I'm 72 and have been listening to ABBA since the beginning! I am always amazed at how their different songs seem to apply to my life throughout the decades and this song hit home with my divorce. Love ABBA!",
        "ABBA is the highest quality of pop music ever composed.",
        "No crying, no sobbing, no hysterics, just resignation, acceptance that you've done all you can and now living with the bittersweet memories.",
        "Knowing me knowing you theres nothing we can do. What a good breakup song of acceptance",
        "The harmonies between their voices are phenomenal",
        "The way she sings the very first line. “No more care free laughter” is absolutely beautiful singing. It is haunting, yet seductive. This was my go to abba song as kid. Still listening at 48. Welcome back abba.",
        "This song is 40 yrs old people still its so poignant..Love this band so unique!!",
        "One of my fave ABBA songs. The relentless drum beat is so hypnotic.",
        "It’s 2024 and this is as awesome as it ever was!  ABBA are legends.",
        "Voices complete each other. Hard to get today.",
        "How Bjorn's lyrics create the hopelessness of the situation in the first verse is brilliant. 'Walking through an empty house, tears in my eyes' is simple but right to the point and your heart...I get goosebumps every time. This is ABBA & pop music (all genres) at their very very best.",
        "There's just something so pure about abba. It's clean, it's harmonic, it has heart, it just makes you feel happy when you listen to it. How did we get from there to most of the crap we have today?",
        "It's 2023 and this classic track still breaks my heart. Love you forever, ABBA.",
        "Agnetha and Frida had such an amazing \"voice.\"  Perfect harmony, perfectly in synch.",
        "This song is so fucking good. All of ABBA's songs are SO GOOD. WHY IS IT SO PERFECT.",
        "ABBA is the all-time greatest singing group  Timeless",
        "How we loved them in the 1970’s. Most young ppl today have no idea how much fun we had dancing and listening to Abba. We really lived emotionally through their music in a way.",
        "Hot take: this song’s chorus has the best ABBA harmonies. So many unnoticed layers ",
        "Divorce is the death of a marriage and it can hurt like hell. Give yourself a chance to process the grief. This song is perfectly written",
        "Absolutely incredible and Abba only gets greater as the years and decades go by. Knowing me knowing you is certainly one of my favorite ABBA hits.",
        "I listen them since that I was a children and now I'm 21 and still love them so much. And I wish I could live at that time when they were singing. Love Abba Forever. Kisses from Brazil",
        "Love Frida's voice.",
        "Frida sounds incredible in this song. What a gift for Bjorn and Benny having two stunning voices to use in their songs. Takes it to another level.",
        "It’s absolute insane how good this is as a piece of music. Vocalization, harmonies, contrapuntal secondary vocals, instrumentation, arrangement, overdubbing and sound engineering - it’s all off the freaking charts. There’s no pop act or production team that could come close to producing a track this good nowadays.",
        "That 4K restoration is OUTSTANDING.",
        "The simplicity of this video is what makes it so memorable and heart-wrenching. Probably their most famous video out of all of them.",
        "Such a sad song, but it's really respectful how they all got together and made it. Also, I noticed that even though this was mostly Agnetha's song, she has Anni-Frid as the lead vocalist. Finally, the way the two women walk into the sunset. They lost  the loves of their lives, but they gained the deepest friendship of their lives.",
        "That guitar strumming that sounds every time they say \"knowing you\" is a clear example of their level. It may seem something simple but using a counterpoint that way, breaking the rhythmic 4/4 pattern, is something that most bands won't do often, specially today.",
        "I can’t explain but this song just sends shivers down my spine, masterpiece in every form.",
        "This single was released around about the time that I lost my first wife at the age of 28. The lyrics \"Walking through an empty house with tears in my eyes\" still haunt me to this day. A masterpiece of a song, but one that fills me with melancholy.",
        "I am here & I love Abba forever ️",
        "This has to be one of the greatest songs ever recorded in the whole world of music",
        "This is October 2024 &  this classic, timeless  and iconic song by ABBA continues to be exceedingly electrifying, enormously exciting, exceptionally enthralling, excellently elegant, exclusively elating and exquisitely expressive. The music is marvellously melodious, memorably magnificent, magically momentous and mesmerisingly  masterpiece. Their singing is singularly soulful, superlative, spellbinding, sincere, sweet and simply  spectacular. ",
        "ABBA = The greatest Harmonies in Pop history!",
        "Видно на небесах ангелы очень постарались, что за 50 лет нет ничего и близко подобного, несмотря на большое изобилие групп.\nЧто касается этой песни, видимо ребята заглянули внутрь себя. Именно так всё потом и произошло, сначала с одной парой, потом с другой.\nДолгих лет вам и храни вас Бог!\nМы вас просто любим!",
        "Their voices, as wonderful as they are individually, are just pure beauty when blended!",
        "ABBA are without doubt one of the most important pop groups ever to grace the charts. Great melodies, great lyrics and brilliant vocals. Still as fresh in 2023 as they were in the 70... Brilliant, brilliant group ",
        "I am new to ABBA, but this is one of the best songs I have ever heard. Ever. It's completely brilliant.",
        "Even Ozzie Osbourn admitted that this was great music. I am a rocker,but love this.",
        "One of my fondest moments was listening to the abba gold album (This song was track 2) I would always listen to the album with my grandmother. I thank god every day she is still on this earth. I also thank abba for the music, for giving it to me. (Ha! Managed to put a song quote in there!)",
        "Anni-Frid’s vocal performance. Stunning.",
        "ABBA music is timeless! Am I wrong when I say ABBA was ahead of their time? This song is one of ABBA masterpiece. I listen to it almost everyday. I swear! Frida's voice is simply perfect and when she and Agnetha sing together it seems my heart will jump out of my chest. ABBA is simply wonderful.",
        "This band lives on in my heart, ABBA what a great band.",
        "I am a hard rock heavy metal down to the core but I remember loving led zeppelin, deep purple, sabbath but there's always been a special place in my heart for ABBA. The songs, the girls and the feeling I get listening them is just wonderful. Timeless. Growing up in the late '70s and early '80s would not have been the same without their influence in music",
        "I know just about everybody loves Dancing Queen, but i have to say that this is my favorite ABBA song, such harmony and fantastic background vocals",
        "ABBA was here before my time , but they have a song to take you through every phase in life !!  Love love this band !! Timeless music",
        "Abba are the one group i could never get tired of. They are timeless.",
        "It is 2020 and l cant believe how powerful this song still is, the incredible vocals, lyrics and look of all four group members.\nJust stunning.",
        "A=AMAZING\nB=BEAUTIFUL\nB=BRILLIANT\nA=ARTISTS"
    ],
    "Lay All Your Love On Me by ABBA official": [
        "This was a hit 40 years ago and now it is a hit again. Abba forever and ever!",
        "1970's = such a lovely song \n2020's = top 10 deadliest battle in history",
        "My dad shared his kind of music with us when we were small kids, and we are glad that he did because ABBA's songs are timeless... All are worth treasuring and passing on to the next gen.",
        "私は日本人ですが今でもこの曲が大好きですABBAは私にとって太陽です",
        "I can't believe it took me 44 years to discover this gem. Truly a masterpiece.",
        "This is... MADE IN HEAVEN!",
        "Love this song! Despite it's lyrics being about romance and love, all i can think about while listening to this masterpiece is top 5 bloodiest battles of WW2.",
        "When someone can write music that stands the tests of time. Timeless, classic, and powerful.",
        "It just never gets old. ABBA's music will live forever.",
        "I can't believe that after 41 years now, they are coming up with new videos of their songs that still sound spectacular. I will always love them.",
        "ABBA's most effortlessly cool song. An absolute banger, even today.",
        "This is one of ABBA's best songs. It's just incredible. The melody is epic. And the harmonies give me chills.",
        "80’s: greatest masterpiece ever\n2023: top 10 biggest battles of all time",
        "Im so glad Abba is growing more popular again, it’s one of the best bands that I feel every generation can enjoy.",
        "This song is truly a masterpiece even after 43 years, still gets me dancing like crazy!",
        "I feel like a little girl again. My Mum and Dad used to play this on the record player often. RIP, Dad ",
        "ABBA is the definition of great music\nI wasn't born when most of their hits came out, however, they are my favorite band.",
        "Indeed all Abba's songs are timeless...much love from Kenya 🇰🇪",
        "Timeless Masterpiece!!!... Love & respect from Romania to ABBA...",
        "ES QUE YO AMO ESTA CANCIOOOON ",
        "Missing my late Dad  He's a big fan of ABBA",
        "I'm not even old yet, I was born in 1999 but I can't explain how much I love ABBA, every song is so special and meaningful to me, all thanks to my mom who showed me this masterpieces since I was a little girl. I'll love ABBA til' the day I die. Greetings from Mexico for everyone who's reading this ",
        "this song gives me a feeling of anger, sadness, happiness, depression, and just plain nostalgia. Great song, ABBA.",
        "I'm 15 and I grew up with old songs like these and I love seeing people of my generation enjoying them, I love how they get the love they deserve, even after so many years.",
        "This track is worth passing to our next generations. So soothing and calm to listen to.",
        "Now I’m 75 years old but I remember this song so well.\nThose voices from heaven, there never came another band with such music.\nI truly hope they are happy now, because in their private lives they were not so lucky.",
        "This song is so perfect I cant explain it. You could play this for any crowd and no-one will complain.",
        "Masterpiece.",
        "This hymn is immense. Finally a video!",
        "ABBA is flying in another dimension with their music.",
        "Top 10 reason why i love this song\n1.strength\n2.speed\n3.durability\n4.lq /biq\n5.Ap\n6.Dc\n7.experience\n8.ability\n9.overall\n10.winner",
        "They just fit for their own style, thats because i love them ",
        "The feeling that comes to me when I hear this song is inexplicable. It's a strange feeling, but at the same time it's comforting. I thank Abba for this masterpiece, 42 years old and still so bright.",
        "It's a great song, every time you hear the refrain to chorus, it gives you chills.",
        "This gives me goosebombs. My father, died in April 22, was my Guide to ABBA and THIS SONG was OUR SONG! Thank you so much.",
        "De la bombe cette musique 40 ans après !!!! Je me régale toujours !!  Personne ne les détrônera !! ABBA ️️️",
        "1970s: Nice music good beat\n2023: \"TOP BEST ARMY IN THE WORLD\"",
        "1980s- Masterpiece\n2023- Greatest generals ever",
        "Only 1 word for this song: Masterpiece",
        "Man!!!!!! How good is Abba??",
        "Abba+History= Perfection",
        "ABBA is probably the greatest group of all time.",
        "1970's = This is absolutely beautiful \n1980's = Majestic\n1990's = Love it \n2000 = Can't believe this song is 30 years old\n2010 = You probably know this from your parents \n2020 = TOP 10 MOST DEADLIEST COUNTRIES  \n\nRespect for those who knows ABBA from their parents or grandparents 🫡",
        "Great music never dies and this is one of them ",
        "I’m glad they’re finally giving this song a video on their channel.",
        "Only ABBA could flawlessly fit a 6-syllable word in this song without missing a beat: incomprehensible.",
        "The best part of this song 3:52 takes a sharp spike of emotion spectrum like a final finale to the greatest show spectacle ever on Earth.",
        "This song always gets me up dancing. It's a classic",
        "2023. And this is still an amazing tune. Abba will never die.",
        "I'm 30 years old but i really love Abba's music from the 70' and the 80's. This is my favorite song from Abba because everything about this song is perfect.",
        "I thank my parents for raising me with ABBA's music. I've since enjoyed other genres but ABBA's is still something special, meaningful and timeless",
        "This song aged like a fine wine,the older the better",
        "It's not a song ...it's a symphony !!!!",
        "One of the best songs ever",
        "My mother installed a cassette deck stereo in her '77 Plymouth Horizon and the only music she played were Abba's. My brothers and I knew the words to most of their songs. When my mom would pick us up from school, we'd all be singing the song that was currently playing in her stereo and having a great time. I was 7 years old. Thanks mom!",
        "Man, this song is so amazing, honestly it brings such a good vibe.",
        "Another masterpiece that was discovery by the new generation and go viral ",
        "Es increible como esta cancion fue lanzada hace 40 años y sigue siendo como una especie de canción futurista donde sientes que tu cuerpo esta conectado con ondas magneticas definitivamente mi canción favorita 🇵🇾",
        "Not only Abba nailed this SONG But they nailed all of the songs they have created",
        "Magnifique  éternelle ",
        "The heavenly harmony of Agnetha and Frida!  40 years later, I still get goosebumps.",
        "23 when this came out, dancing the night away on the disco floor under the glitter ball,  now at 67 this is  still one of my most favourite  songs. Brings back so many happy memories.  ",
        "I breathe this song!  cannot wait to see the 80s aesthetic of this video. I LIVE for the 80s and ABBA",
        "No one sounds like ABBA, they have a sound that can not be copied. Even artists like The Beatles and The Rolling Stones have artists that sound similar, but no one sounds like Abba. \nI will say tho that Middle Of The Road sounds like early ABBA, not as good as ABBA but songs like Soley Soley and Chirpy Chirpy Cheep Cheep sound like they could be ABBA songs from 1972-1974",
        "Just came from the abba voyage in London  it was amazing !!",
        "This song and \"Me and I\" were the pre cursor to where ABBA were headed on \"The Visitors\" album and the new songs on \"Singles: The First Ten Years\" ...that new wave synth sound!!! Amazing!",
        "This song still gives me goosebumps, even to this day.",
        "I'm middle Eastern and have just recently discovered ABBA, they have  great music honestly",
        "ABBA IS MUSIC FOR ALL THE TIMES DEFINITELY .\nWELL DONE ABBA GENIUS !!!  ",
        "I'm 42.  Apparently this song has been around my entire life.  I've never heard it.  It's going to be on my playlist for the next 42 years.  amazing.",
        "Este hit es maravilloso digno para las discos aún en esta época porque no envejece gracias ABBA!!! QUEREMOS MÁS VIDEOS POR FAVOR!! I HAVE A DREAM PLEASE!!! ️🇵🇾",
        "\"Dont go wasting your emotion, lay all your love on me\" is one of the hardest lines ever written ",
        "This is one of the most beautiful songs I've ever heard",
        "This is truly Made in Heaven!",
        "Never heard the vocal version. The instrumental pulls all the strings together in one, firm streak, that I've never thought about the vocals. But now, experiencing the vocals, I find them to be a spectacle I adore.\n\nAnd how did I not quote the melancholy embedded in the texture of this indescribably fervent song? Purely admire this.",
        "My all time favourite song ! Both ABBA & I are 50 this year ! ABBA won Eurovision on April 6 1974 & I was born exactly 4 months later on August 6 1974 , in fact my late mum said that myself & ABBA were the best things that came out of 1974 ! ",
        "Bluds cooked so good that... idk no words on how good this is.",
        "I am not normally one for lyric videos. But I love how this is created.",
        "Très belle chanson , j'adore , avec les paroles c'est bien . J'adore le groupe ABBA depuis 1974 . Merci pour votre musique ️",
        "A very full blooded song in all components: melody, lyrics, rhyt. Good music never gets old.",
        "Timeless quality",
        "I'm a metalhead since i was a teenager, but this group is my little forbidden pleasure. Great lyrics, cool sound, gorgeous voices... The whole package.",
        "The new generations discovered the ABBA music , and they are like new fans .\nThe time's not effect over the ABBA music , this never die .\nThe absolute beauty and perfection made pop music . \nThank you forever ABBA !!!\n🇸🇪\nThis is real pop music of highest level and quality forever in the world .\nSublime , divine , extraordinary , angelic and magic music , songs , melodies , harmonies , sounds and singing voices .\nSimply this is definitely all perfect true absolutely like how inspired for angels is this pop group .\nThis is a pop group and music God level forever .\nThe singing voices is like how angels choirs .\nThe most heavenly beauty and perfection pop music .\nThe highest worldclass quality level .\nMy ears feel blessed with the ABBA pop music .\nABBA's the definition of absolute world greatness .\nDefinitely this is music made in Heaven for angels .",
        "自分の国の音楽じゃないけど、この曲まじで好き",
        "Top ten strongest stands in history ",
        "ABBA's out-of-this-world sense of melody and killer rhythms created wonders like this one!",
        "2000: Beautiful song!\n2010: I've never seen a better Mamma Mia song!\n2020: Top deadliest wars in history",
        "Remember when i was about 6/7 years old listening ABBA in Kazakhstan now i’m 34, living in Sweden and still listening ABBA\nBest music band, best Country️ Bästa",
        "I'm so grateful to have been born, to be able to experience music and really feel it... and continue listening to it years and years later and discover old and new emotions ",
        "This song feels like a magical incantation, I love it so much!",
        "Abba is great for everyone’s mental health I swear!",
        "I'm so glad that ABBA's song gets more popular again day by day.",
        "I can listen to it all the time",
        "A message to future generations: \n\nDon’t let this song die",
        "My God!! This song reminds me of my mom! She died in 2007. But I renember late 70s/early 80s listening to her Abba cassettes in the car.",
        "I can't believe I'll be at voyage tomorrow and Sun night ...43 years ago I saw them in Dublin.....I've loved them forever ",
        "Abba was the best option in my life as a 15 year old",
        "My Most favorite Abba Song ",
        "A band that can not be forgotten, songs that we have heard and enjoyed for many years,  I feel so happy that there are so many who love ABBA",
        "The song everyone have heard but dont know the name:\n\nI truly enjoy ABBA's songs"
    ],
    "Thank You For The Music by ABBA official": [
        "Agneta is angel",
        "Who is with me thanking abba for the music?",
        "What a supergroup of all time xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        "世界中の人が大好きなメロディ\nそしてABBAの優しさの象徴が、ずっと子供達の前で語りかけるような、フリーダの姿が素敵だ。",
        "To us Swedes, ABBA is probably our greatest contribution to the world.",
        "Who's with me listening to the incredible Abba in 2024  ?",
        "ABBA...Sweden's greatest gift to humanity.",
        "Agnetha's voice is so amazing and clear.  What range she has, wow.  Her voice is a gift from God.",
        "It is now 26 March 2024, and I'm still coming back to hear this again! Oh I do love Abba's songs!",
        "Abba, greatest band of all time!!!!",
        "And English is not their first language! Thank you for the music indeed.",
        "Thank you for the music. It's everlasting!",
        "No, Abba! Thank YOU for the music! ",
        "I'd never really realised what a personal song this is. To be able to stand there and sing to the world, about how lucky you are, to be able to stand there, and sing to the world. It's really beautiful in fact.",
        "This song shall be played at my mum's funeral on Monday 29.04.19. It breaks my heart completely but you loved it. In memory of you my beautiful mum Valerìe Green 21.04.46 - 02.04.19",
        "There will NEVER be another ABBA",
        "ABBA songs has a special place in people’s hearts",
        "I'm 18 years old and ABBA's songs helped me overcome depression. I am so grateful for that! thanks for the music",
        "I believe the whole world is thanking Abba for their music.",
        "Beautiful Agnetta and Co . You are super for ever!",
        "How can one band make so many beautiful, timeless, magical songs️️️️️️",
        "No, ABBA.....THANK YOU for Decades of fine music, it will last far longer than we will!",
        "Aren’t we older people so lucky to have lived through this era.",
        "I was 13 when they won Eurovision 1974 .  I'm 62 years and i still love them",
        "Who is now listening to a boatload of ABBA songs now that they've come back? ",
        "A = AMAZING\nB = BRILLIANT\nB = BEAUTIFUL\nA = ARTISTS",
        "What's amazing about ABBA is that every single song that they ever recorded was either written or co-written by Andersson and Ulvaeus. That makes Benny and Bjorn one of the greatest ever songwriting teams in the history of music. And they weren't just composers; they also produced many of their recordings. And they wrote most of their lyrics in English, which is a foreign language to them. And the ladies helped with arrangments too on top of being incredible singers and performers. Such an incredible collection of talent in four people. ABBA forever.",
        "Thanks to you Agnetha and thanks the Group ABBA ",
        "It's hard not to want to cry tears of joy when you hear it because it's one of the ultimate examples of gratitude, and humility put to music.",
        "I'm 17, I recently discovered ABBA around a year ago and I can say, truly, this song is one of the most beautiful songs that I've heard and this band will forever be, my favourite artist",
        "This is my Grandmother's favorite ABBA song. My family just had a celebration of her life and sang this song, as she recently passed away. Thank you for the music, Grandma.",
        "Our Beautiful Agnatha!",
        "This might be one of the sweetest, most heartfelt most catchy anthems ever created. This may be a perfect song in so many ways, and I wish everyone could hear it as many times as I have. An absolute masterpiece. Thanks ABBA for the music, now and always.",
        "No ABBA! Thank YOU for the music! All of your songs are so timeless, and magical!",
        "My mom loved Abba...she died a day ago. Rest in peace mom️\n\n\n\n\nEdit: Its been a year now... Thanks to all of you for your love and support ️ Yes i am doing mostly fine now a days and i have gotten over my moms death to some degree. I do however suffer from bi polar depression like my mom did and my mental health varies alot :( I just pray that it doesnt get a hold of me like it did with my mom... Again thanks to you all i will try to stay strong!",
        "YES, Abba thank you for the Music !!!!!!!!!!!!!!!!!!!!!!!!",
        "Abba yesterday \nAbba today \nAbba tomorrow \n\nABBA is endless ",
        "For me, personally, this will always be Abba's finest song.",
        "I'm 57 years old, and when I hear all the Abba's songs, I remember my best days of my life. They   have make my days full of fun and happyness. I love Abba and I thank for the wonderful music.",
        "Abba put out the best happy fun music ever!!! And omg they rocked the world ",
        "WE Should Be Thanking YOU ABBA.",
        "Im leaving this comment here so after a day, a week, a month or a year when someone likes it, I get reminded of this song , so i can play it again and again. thank you for the music",
        "Ladys and gentleman THIS IS MUSIC",
        "ABBA is the most beautiful thing that has ever happened to humanity",
        "This song is a love letter to music. They're grateful that they get to bring so much joy to other people with their music, and we're grateful for them and all the wonderful artists that blesses us with beautiful music. I couldn't imagine life without music, I don't think I would be able to cope without it.",
        "some times I feel like ABBA is from another planet",
        "2024 anyone? Yes thank you for the music Abba ",
        "This song is music to my ears",
        "I remember my girlfriend and I were driving, and she played this song, and as the chorus played I just started sobbing. I just got this overwhelming emotion of euphoria, and the realization that we take things like music for granted, it’s such a crucial part of lives, it’s what’s brings people together, and creates so many memories. This beautiful song just got that realization right out of me, in the best way.",
        "Abba ist so großartig, das die Menschen sich die Lieder in 50 Jahren immer noch anhören.Sie sind für mich genauso unsterblich Wie Bach,Wagner, Beethoven!",
        "This line is one of the best lines ever written:\n\"And I've often wondered, how did it all start?\nWho found out that nothing can capture a heart like a melody can?\nWell, whoever it was, I'm a fan.\"",
        "Music is life ",
        "Now that ABBA has returned, we all have a chance to thank them for the music. The world should stop everything for a moment and sing this in gratitude to ABBA",
        "This song makes me cry... I guess it triggers memories of those golden years when ABBA ruled and I was young and I had not yet understood that the only thing that truly matters is passionately love those whom you love and care for.... Time flies... Today, like Agnetha here, I feel gratitude. Thanks to ABBA for these gifted songs they gave us, enlightening our nights and lives.",
        "I love this song. Agnatha is so pretty and what a singing voice. No falsetto. Just pure clear voice. \n\nThe little girl sitting in the audience is so happy to be there singing along it brings a tear to my eye.",
        "One word, beautiful.",
        "Thank you ABBA for the joy you gave us all !",
        "I was 6 years old when I heard the song the first time. I am from Germany, so I didn’t understand anything. But I fell in love with this song when the chorus at 0:48 came on. Now I am 14 years old and every time I’m listening to this song, I’m having flashbacks to that moment, sitting in the car with my dad, being completely happy.",
        "I'm nothing special, in fact I'm a bit of a bore\nIf I tell a joke, you've probably heard it before\nBut I have a talent, a wonderful thing\n'Cause everyone listens when I start to sing\nI'm so grateful and proud\nAll I want is to sing it out loud\n\nSo I say\nThank you for the music, the songs I'm singing\nThanks for all the joy they're bringing\nWho can live without it? I ask in all honesty\nWhat would life be?\nWithout a song or a dance, what are we?\nSo I say thank you for the music\nFor giving it to me\n\nMother says I was a dancer before I could walk\nShe says I began to sing long before I could talk\nAnd I've often wondered, how did it all start?\nWho found out that nothing can capture a heart\nLike a melody can?\nWell, whoever it was, I'm a fan\n\nSo I say\nThank you for the music, the songs I'm singing\nThanks for all the joy they're bringing\nWho can live without it? I ask in all honesty\nWhat would life be?\nWithout a song or a dance what are we?\nSo I say thank you for the music\nFor giving it to me\n\nI've been so lucky, I am the girl with golden hair\nI wanna sing it out to everybody\nWhat a joy, what a life, what a chance\n\nThank you for the music, the songs I'm singing\nThanks for all the joy they're bringing\nWho can live without it, I ask in all honesty\nWhat would life be?\nWithout a song or a dance what are we?\nSo I say thank you for the music\nFor giving it to me\n\nSo I say\nThank you for the music, for giving it to me",
        "STILL LOVE THE MUSIC AT 84",
        "What a lovely and wonderful song.Abba is really genius team.",
        "Abba is a group of a planetary scale. There was no one else and never will be. What can I compare the sip of fresh air, sunlight, spring? We wish them health and long-life life. We remember you and love you. ABBA... greatest gift to humanity.",
        "I cannot describe how beautiful this song is. Since the times of my childhood, ABBA have always comforted me and made me smile... thank you so much for this brilliant music!",
        " Thank you for the music   ABBA ",
        "Wow. What a great song, Agnetha deserves credit for this one. All her performances of this song are just magnificient. I mean: how easily could this sound cheesy? She makes it sound pure and honest.",
        "This song is probably my favorite ABBA song of all time. Very sentimental and grateful. Not many songs like this anymore...",
        "I moved to Norway two months ago, its becoming difficult about the language, but this gem shines on the radio often. Listening this in snowy roads make everything bit easier.",
        "Abba reminds me of my dear late dad . Thankyou",
        "I genuinely get chills when I hear this song, it’s such a beautifully composed piece. I envy being able to hear this on the radio at the height of ABBA’s fame, yet I’m thankful I can listen to it over and over without owning a vinyl. A beautiful song <3",
        "We thank you for your music. Even after 40 years ABBA songs are making us happy.",
        "Agnetha is the queen of pop. Eternal talent and class. Thank you for the music. Hugs from Malmö 🇸🇪️",
        "One of the most beautiful pop songs ever",
        "ABBA has been, is and will be one of the best music bands in the world. Their music will never die. They have one of the most beautiful melodic lines in the world ..... ABBA will always remain in our souls. God bless you for your music ....",
        "I listen to ABBA's music when I need to be reminded of my childhood. Their music nearly brings tears to my eyes each time I listen because there's a sentimental value to their music that even THEY can't understand. Thank you for the music ABBA!",
        "Thank You For The Music by ABBA\nLYRICS\n\nI'm nothing special, in fact I'm a bit of a bore\nIf I tell a joke, you've probably heard it before\nBut I have a talent, a wonderful thing\n'Cause everyone listens when I start to sing\nI'm so grateful and proud\nAll I want is to sing it out loud\nSo I say\nThank you for the music, the songs I'm singing\nThanks for all the joy they're bringing\nWho can live without it? I ask in all honesty\nWhat would life be?\nWithout a song or a dance, what are we?\nSo I say thank you for the music\nFor giving it to me\nMother says I was a dancer before I could walk\nShe says I began to sing long before I could talk\nAnd I've often wondered, how did it all start?\nWho found out that nothing can capture a heart\nLike a melody can?\nWell, whoever it was, I'm a fan\nSo I say\nThank you for the music, the songs I'm singing\nThanks for all the joy they're bringing\nWho can live without it? I ask in all honesty\nWhat would life be?\nWithout a song or a dance what are we?\nSo I say thank you for the music\nFor giving it to me\nI've been so lucky, I am the girl with golden hair\nI wanna sing it out to everybody\nWhat a joy, what a life, what a chance\nThank you for the music, the songs I'm singing\nThanks for all the joy they're bringing\nWho can live without it, I ask in all honesty\nWhat would life be?\nWithout a song or a dance what are we?\nSo I say thank you for the music\nFor giving it to me\nSo I say\nThank you for the music, for giving it to me",
        "AGNETHA WHAT A MAGNIFICENT VOICE  HER BEAUTIFUL  FACE MIRRORS HER SENSITIVE SOULSHE FEELS EVERY WORD OF THE SONG!!!!",
        "Her voice is so sweet!!! What a dream!!!",
        "Especially in this poem, \"What would life be? Without a song or a dance, what are we? So I say thank you for the music\" touched my heart. Thank You For The Music of ABBA.",
        "ABBA makes the whole world a better place to live. ️️️",
        "Back when pop songs make sense and inspire people. Such a classic  I'm 26 and old soul proud of it.",
        "Who can live without ABBA?  They are just part of us.",
        "Classic banger",
        "one of my favorites. Im 19 and I will continue to share this music with generations to come. Thank you ABBA.",
        "This song is so fresh that it’s hard to believe that it was created about 40 years ago, and the vocals in particular are beautiful and still touch my heart. I think it’s warm music no matter what time you listen to it.",
        "Thank you, Abba, for your wonderful, uplifting music.",
        "Their compositions are really something else. Such original, beautiful and absolutely addictive melodies that is like an itch you can't scratch until you hear it again.",
        "Tomorrow I’m singing this in front of my theatre troupe as a Senior Spotlight performance, a way to thank everyone there for the love they gave me. Thank you for the music, guys!!!",
        "I am teaching middle school and high school music students in north central Alabama who are asking for more ABBA … fascinating!! ️",
        "ABBA是西方樂團最棒的團體........前無古人, 後無來者.........可惜這樣的曲風, 現今已少見 !!!\nI am from Asia. I think ABBA is the best music group ever. Nobody in the world can take their place.",
        "This song is just incredible I could hear it all day. Why not write such nice songs anymore?",
        "Her voice is amazing, she is a very talented artist and this song is more complicated to sing than what we are suppose to expect from a pop song.",
        "What a wonderful voice. I love it.",
        "The BEST tribute to music. NEVER has music sounded this good",
        "What a beautiful music and it brought so much happiness to my life. I used to listen to this song with my grandma while she was cooking me food after school. She said the best way to learn English is by listening to ABBA. I listened to ABBA with my grandmother and we used to sing together all the time. Now every time when i think of my Grandma I listen to ABBA music and especially to this song. My god what a beautiful memories.",
        "Спасибо, Великая АББА, за Музыку! Слушая Вас более 40 лет, плачу от счастья и восхищения! В голосе Агнеты звучать хрустальные колокольчики, а голос Фриды обволакивает и ласкает душу, как прекрасный выдержанный коньяк! Для меня Вы всегда прекрасные юные девушки, которые показали высший пилотаж вокального искусства и своей красотой покорили весь мир! Мы навсегда у ваших ног!",
        "ABBA greetings from coastal Mississippi.  April 4,2024....ABBA 50 year anniversary. One of my favourite songs. ...Yes ,thank you for being the greatest group ever ",
        "Thank you so much, Agnetha, Ann-Fryd, Benny and Björn, for your amazing music, resisting gloriously to the test of time, and giving us such great songs that will surely linger on as one of the best mankind has ever produced! Thank you!",
        "Эта группа ,до настоящего времени делает меня счастливой, мне 56. Дай бог им здоровья.",
        "My 6 yr old grand daughter loves their music, sings their lyrics out loud and dances like no one is watching in 2022. I did the same in the 70's and 80's. They are timeless!!! Thank you for the music!",
        "Anni Frid sitting with the children is so nice! Great memories for them. Shows what a nice person she is"
    ],
    "Voulez Vous by ABBA official": [
        "Can you just imagine being on the disco floor in the 70’s dancing to this? Oh wait, I was! And it was AMAZING!!!",
        "I've listened to this song 63 times in one week. No lie.",
        "Take it now or leave it, this is one of their best! I'm glad it's an album title.",
        "I'm 78 yrs old. listening to ABBA is like a spiritual experience. I am free from the pains of life.",
        "I'm 18 years old and ABBA's songs helped me overcome depression. I am so grateful for that! thanks for the music",
        "There is no better music to remove depressions than ABBA, Bee Gees, Boney M, The Jackson Five, Villages People and Earth, Wind & Fire. The 70s music is the best! (I mean about disco music).",
        "Therapy- expensive \n\nAbba songs- free",
        "That final Voulez-Vous switching to the Major and then transposing up 2 semi-tones  into the main riff (from 1:15) is an absolute stroke of musical genius you simply don't get from music today. \n\nAmazing.",
        "Musically, this song is absolutely phenomenal. It has so much energy, the bass is ridiculous!! Pure joy!! Thank you ABBA for such a legendary arrangement! Even to this day, if a DJ drops it , the dancefloor will boogie away!!",
        "There's two types of people, those who love ABBA and those who love ABBA and won't admit it",
        "Best group EVER this song is phenomenal",
        "I remember in the 70’s when Abba hit Australia. We went mad! Everyone was up on the dance floor at the disco dancing and singing to them. I’m 70 now..Still love them . They are a legend!",
        "This is not song .\nThis is timeless masterpiece .",
        "My French teacher played this yesterday in class. Best lesson ever",
        "French teacher: Voulez-Vous\n\nMe half asleep in class: ah HA",
        "What would life have been like without ABBA! Happy 50th! 6/4/74 - 6/4/24. Go to ABBA Voyage concert as soon as you can! I remember vividly watching the 1974 Eurovision Song Contest as a 6 year old and watching ABBA performing “Waterloo”, and being mesmerised. I’ve been a fan ever since, even being bullied for it, especially when entering secondary school in 1978. ABBA have a combined wealth of nearly £1.5billion. Oddly enough, 6 April 1974 to 6 April 2024 is 1,577,912,463 seconds. So ABBA have earned £1 per second over the last 50 years! Thank you Anni-Frid, Bjorn, Benny, Agnetha.",
        "I think abba is one of those bands where you can't not like at least one song",
        "I can dedicate the whole of the day just listening to Abba ",
        "Its like everything they touched turned to gold. So many catchy songs even death metal fans would turn up in the car",
        "“ Voulez - Vous  …. Aha!  Take it now or leave it Aha! “\n\nI live for the good vibes of this song ",
        "me: has 5 assignments to complete before monday\nalso me: ",
        "Anywhere in the world, across cultures and generations, ABBA music is always the common ground. Love it.",
        "Nothing compares to ABBA.",
        "この歌を聴きながら通勤していて朝からテンション上げて、運転していました。懐かしい曲です。",
        "Fun fact: This is the only ABBA song not recorded in London  or Stockholm. Recorded at Criteria Studios, Miami, Florida USA.",
        "I love Benny's face when they're playing music.  I've never seen anyone enjoy his craft more.",
        "The good old days when I wasn't even born!",
        "Released on 23 April 1979, making this song 46 years old - and it a song that still works: put this on at any party, disco, funeral, bar mizvah or wedding and people will storm the dance floor, still! I defy you to pick a current song or band who'll pull this off for even the next decade...\nThank you for the music ABBA ",
        "The older I get , the more I like ABBA",
        "Two of the greatest songwriters, musicians, and two of the greatest lead singers in the history of humanity. What a blessing to be alive when ABBA performed.",
        "*me pretending to sleep\n\nMom: voulez vous \nMe:ah-Ha!!!",
        "🇹🇷🇹🇷🇹🇷 I'm 58 years old keep listening ABBA. 🇹🇷🇹🇷🇹🇷",
        "1:15 is my favourite part. That Voulez VouuuuuuuuuuuuuuaaaaaaaaAAAAAHHHHHHH is going directly to outer space and beyond. These ladies really had IT!!!!!",
        "Thank you,  Agnetha, Anni-Frid, Björn and Benny, for your beautiful music. I love them.",
        "Down the ABBA rabbit hole I go. Harmonies, happiness and disco vibes. ",
        "0:53 遠藤チャント(マネもこの曲)\nHe Wat-ar-Ooooh\nEndo!\nHe is Japanese\nEndo!\nHe wears no.3\nEndo!\nAnd he's gonna win The league.\n(そして彼は優勝するだろう)",
        "53 years old and this song still gets me dancing",
        "LYRICS\n\nPeople everywhere\nA sense of expectation hangin' in the air\nGivin' out a spark\nAcross the room your eyes are glowin' in the dark\nAnd here we go again, we know the start, we know the end\nMasters of the scene\nWe've done it all before and now we're back to get some more\nYou know what I mean\nVoulez-vous\nTake it now or leave it\nNow is all we get\nNothing promised, no regrets\nVoulez-vous\nAin't no big decision\nYou know what to do\nLa question c'est voulez-vous\nVoulez-vous\nI know what you think\nThe girl means business, so I'll offer her a drink\nLookin' mighty proud\nI see you'll leave your table, pushin' through the crowd\nI'm really glad you came, you know the rules, you know the game\nMaster of the scene\nWe've done it all before and now we're back to get some more\nYou know…",
        "I used to use this track for demonstrating high end car audio systems, as it's ideal. Aside from being a great song it's got an articulate mid range, and a really tight snappy bass line. On a poorly set up system ( about 90% of all chav wagons ) it sounds odd, but on a professionally set up system it's tight, punchy snappy and infectious. Abba were a fantastic band, if only pop were as good now. We should be so lucky.",
        "my disco nights in the 70's dancing to ABBA, Now 67 & still enjoy listening & dancing to their  music...great song",
        "How do their voices blend so perfectly  \nIt's just soooo magical",
        "Anyone else on an ABBA binge?",
        "ABBA are my medicine against depression. I always feel happy when I listen to their songs. So thank you, ABBA for putting a smile on my face ️",
        "I am 79 and I love ABBA.",
        "This song and video is so 70’s! The lights, the bright funky outfits, the beat, the music…So goooooood!!!",
        "I have been a fan for 42 years. Not only are their songs complex in their musicality, the beats, melodies, harmonies and hooks unforgettably catchy, their chorus'  rival any ever recorded, their musicianship and vocals and production flawless, their style and image outrageously squeaky clean and cutting edge, their characters adorable but on top of ALL that, each song tells a story with lyrics that are both personal and fantastic. The lyrics to this song alone are so freaking interesting I wanna know more! Gimme gimme gimme  more! They never get old. God they're good.",
        "My gym teacher put this song on our workout class today! He has good musical taste!",
        "ABBA CAN TOUCH YOUR SOUL WITH THE BALLADS AND YOUR FEET WITH THEIR RYTHMICAL SONGS!!!SIMPLY MAGNIFICENT IN BOTH!!!",
        "ABBA is the 2nd most successful band after THE BEATLES. THEY provided extraordinary TUNES which are difficult to erase from our memory.",
        "This band is on another level when it comes to melody. The chorus is so ahead of it's time with those unforgettable background vocals!",
        "The extraordinary band with the most hit songs of all time.",
        "Exelente",
        "ABBA are like the Bee Gees, unforgettable bands from yesterday and sounds that are still amazing today.",
        "The biggest and most successful band in the world ever ",
        "No \"Auto Tune\" - simply pure talent and a true love for the craft!",
        "Боже, моя молодость пролетела под песни АББА, ностальгия",
        "what is the secret of abba ? their secret is that they have 2 phantastic singers and 2 phantastic arrangers/songwriters.",
        "АВВА, ВЫ - ЛУЧШИЕ ПЕВЦЫ И МУЗЫКАНТЫ, ОБОЖАЮ СЛУШАТЬ ВАС В ВАШЕМ ИСПОЛНЕНИИ  ️️️!!!  Ваши песни неповторимы и оригинальны ️!!!",
        "One of Abba's masterpieces that deserves to be remastered in 4k...",
        "I am in my late 60s, a funk and r&b woman. But ABBA are beloved by all music lovers. Superb musicians. Benny and Bjorn were masters at crafting perfect pop songs. Fabulous! ",
        "One of my favourites from Abba. I mean, who doesn't like this stuff?!",
        "I cant put my finger on what makes their music so epic... Voices are great, sure, but the tunes, the beat.. Its just musical genius!",
        "One of the greatest and most successful bands in the music history.  Was not that popular in the States but that doesn’t matter.  The world is much bigger place than us.  It was our loss I suppose.  I love this band ️",
        "Wow, what a great composition!",
        "I was in a bad mood and this tune cheered me up",
        "This is the vibe the world needs right now ",
        "this should have at least 500 million views !!!!!!!!!!!!!!!!!!!1",
        "ABBA was such a great band and everybody loved them. i  saw aTV special featuring them as a kid and was completely awestruck. They will be missed but never forgotten.while their music lives on! ",
        "This is the music  that will never die or ever be beaten.",
        "I don't know them, but I want to hug them. I love them. Thank you, Abba.",
        "¡¡¡Qué canción recontra bailable!!! ¡¡¡Esto si es música!!! No como ahora donde la mayoría de las canciones de sitios para divertirse son en mi opinión de mal gusto. Esto es otra cosa. ",
        "Was never a fan of ABBA, but man, could they nail a hook.",
        "I must say that Angnetta is in my opinion one of the finest most visually appealing designs for a woman that the DNA code yet has come up with .",
        "Abba is a perfect pop group with two outstanding songwriters and two amazing singers... \nWarning! Abba is so addictive, once you played one song youl be  wanting their whole catalog",
        "Today is 10 September 2023....and I can't stop listening to this masterpiece since 80s.... Evergreen song of the great band \"ABBA\"",
        "April 17, 2024 and I'm listening to Abba songs with my children ",
        "Absolutely the greatest band ever!!!",
        "i found this gem yesterday. glad to announce that i'm dropping out of school to focus fully on listening to abba️",
        "This is October 2024 & this song by ABBA continues to be exceedingly electrifying, enormously exciting, exceptionally enthralling, excellently entertaining & exquisitely  eloquent even today. The singing is singularly spellbinding, soulful, simmering, scintillating, sensational, sensual, superb, sincere, sweet and simply spectacular. The music is marvellously melodious, magnificently memorable, magically  momentous and mesmerisingly masterpiece. ",
        "So awesome even the disco flavor does not alter the fact that this is a timeless classic!!",
        "ABBA best pop group ever ",
        "I think ABBA is a great way to relax!",
        "2:44 This is probably my favorite part of the video, she holds the camera to convey a more intimate feel with the viewer, and honestly I love it. Moments like this are what I think more music videos need, some spur of the moment thing that makes it feel more organic, even if we know it's scripted for the most part, but still works with the overall composition of the video and visuals... \n\nI will add I am slightly drunk so dun mind the rambling lol",
        "Everything about this song is crazy incredible.  One of the best songs I've ever heard in my life.  I heard it at the gym and was like who is this?  And was like damn  this abba and shook my head like damn how this slide pass me. This is their best song for so many reasons.  Take it now or leave it. Cold Lyrics and incredible music",
        "Abba una de las agrupaciones más  extraordinarias de todos los tiempos, con  esas voces tan aterciopelada le daban ese toque, MARAVILLOSO, orgullosa de esos tiempos, JAMAS los cambiaría por los de ahora.",
        "Мне сейчас 56 , вспоминаю свои 13 лет, на душе  радостно и грустно.Прошло столько лет, а песни 70-80 до сих пор популярны.Вот что значит живая музыка и живой голос!",
        "I'm 22 years old and ABBA is my whole childhood, my puberty and my life ",
        "すげえ！ちゃんと元ネタだ\n遠藤チャントから。リスペクト",
        "My Abba addiction has kicked in, no sleep tonight",
        "My favourite Abba song",
        "1:20 to 1:35 was a mood definitely nice seeing them vibe to their own song\n\nIt’s a shame I wasn’t a part of such a great era of music",
        "I literally just discovered this song the other day. Immediately added it to my Spotify playlist. This song another reason why ABBA is just one of the GOATs.",
        "Abba's greatest hits compilation Gold has become the first record to spend 1,000 weeks in the UK's album chart.\n\n\n 19 years and 12 weeks in the top 100. \n\n\nand is currently at number 17.",
        "Such a brillant composition, every great pop trick is in it, it will never get better than this. Pure genius!",
        "Once a classic, always a classic.",
        "This song gives so much energy!  Such a classic! And this french chorus…  Awesome!",
        "Seeing teenagers on TikTok rediscovering this music is what keeps me hopeful for the future of music. They're coming back at the perfect time.",
        "I was born in 2004 and ABBA is still my favorite band!! Thank you for the music Agnetha , Björn , Benny and Frida!!",
        "Don't be ashamed of liking ABBA, there is no better sounding music group in history.",
        "I'm old but I feel young listening to Abba. Huge fan"
    ],
    "Never Gonna Say I'm Sorry by Ace Of Base official": [
        "This song has a very special atmosphere;\nit has a kind of strange bitter-sweet tone.",
        "I'm Korean and I'm still listening in 2024! I like Ace of Base much better than Korean singers or Korean songs. As a Korean, I've listened to a lot of Korean music, but no matter how good Korean music is, I get sick of it after listening to it 3-4 times and can't listen to it anymore. Ace of Base music is calm yet exciting, and has a strangely addictive feeling whenever you listen to it. This is the charm of Ace of Base music that is not found in Korean music",
        "Their best track, simply!",
        "\"I'm never going to say sorry for the essence of my soul\". Real deep lyrics for such an up tempo song.",
        "My childhood i always listen this group. In Kazakhstan 🇰🇿",
        "This film clip has nothing to do with the lyrics, is an absolute mind f***, and I’m 100% here for it.",
        "그 시절과 지금 세상이 많이 변했습\n니다...그때는 이상이 너무 높았나\n봅니다...오랜 시간이 지나 님들 모\n습을 보게 됩니다...사랑해요~",
        "1998 was the best days of my life...",
        "Ace of base was visinary in many ways. Their groove, melodies, video clips, everything. Really underrated group in an underrated decade.",
        "У каждого человека есть время для взлёта и падений, самое главное держаться за возможности. Так вот они просто кайфовали от своих песен",
        "Major memories. So nostalgic. Brings back my younger years . Ace of Base will forever hold a place on my heart\nStill blasting Ace of Base in 2022",
        "This is not song ....\nThis is timeless masterpiece",
        "Only 18 million views!!!!! Weird for such a Wonderful Melody.... Why don't you release beautiful songs....Big kisses from Romania!!!!",
        "Всё таки сколько же шведы выдали миру поп  музыки качественной, пожалуй боль ше чем кто, хотя всё дело вкуса. И тем не менее.",
        "I love Linn so much. Ugh she's so beautiful and talented.",
        "Linn looks so relaxed and cheerful here! She always looked so confident, which makes it so sad that she grew to resent the spotlight to the extent of choosing to stay away from it so much. I hope that she's doing well and living a fulfilling life on her own terms these days",
        "This song will always cheer me up when I am feeling down - thank you Ace of Base.",
        "\"I'm not normal, I know it, I don’t care.\"\n\nThe fact Ace of Base has these lyrics in their song just catapulted them into my top 15 bands ever.",
        "Школа разрывалась на ваших хитах!!! Спасибо вам за ваше творчество!!!!",
        "This song is among their top 4 best songs. It got some laid back coolness to it.",
        "70's : ABBA\n80's : Roxette\n90's : Ace of Base\n\nSwedish ruled the golden era of music :)",
        "они мне нравятся и их песни тоже, отлично!!!!!!",
        "Вечно молодые ,вечно красивые!!!",
        "Timeless Masterpiece!!!.....Love & respect from Romania to Ace of Base!!!!....",
        "Какие же красивые эти сестрички, каждый раз получаешь удовольствие от просмотра и прослушивания!",
        "si hubiese  existido  youtube en esos años ACE OF BASE  hubiese tenido récord en visitas y descargas porque son lo mejor de lo mejor  no hay ningún  grupo que logre superarlo hasta el día de hoy",
        "IDK why but I find this video the best. I wish Lynn and crew would make more songs..they were so one-of-a-kind!",
        "Legendary",
        "This is the first CD I ever bought. Funny how now, 25 years later, I’m still finding myself returning to this album. And even more interesting is how it’s resonated and defined me over my entire life. Especially this song and “edge of heaven”. \n\nThis album is just a celebration of all the ups and downs in life.",
        "This song will never get old ! ",
        "Очень красивая и талантливая семья - взрыв мозга! Супер!",
        "I miss you Linn berggren. ️️",
        "I was a big fan of them in the early 90s  where did all the great times go????? ️",
        "I already loved the song when it was new in 95/96. Great childhood memories ",
        "This song just gets better with time.. One of their best, imho",
        "Linn is blindingly beautiful",
        "The best 90's Pop  Band Ever ️️️️ God Bless You All",
        "We'll never get this wonderful sound back, unluckily",
        "Thank you for everything Linn, you'll  always be loved beautiful nordic gem.",
        "What an amazing pop band from the 90's, still own the CD set that my late dad kindly got for me a few years ago. Just wish I could buy the follow-up album to the band's debut album on CD because I was given it on cassette (shows how time has moved on) \n\nAce of Base is a Swedish pop group, formed in 1990, originally consisting of siblings Jonas, Linn, and Jenny Berggren, with Ulf Ekberg.\n\nThey continued to score hit singles throughout the 1990s, with songs such as \"Beautiful Life\", \"Lucky Love\", \"Cruel Summer\" and \"Life Is a Flower\". The group has sold 50 million copies of their first four studio albums, making them the third most successful Swedish group of all time, behind ABBA and Roxette.",
        "When life was simple & fun...miss the 90's",
        "My childhood crush : Ace of Base...",
        "Record company should have promoted this song way harder. This should have been a big hit.",
        "Группа просто Супер!!!И песни такие же.Слушала в молодсти и сейчас так же не могу оторваться.",
        "Siempre me gusto su estilo y las chicas triunfaron por su voz no por enseñar como hoy. Se ganaron a pulso su lugar en los fabulosos 90s",
        "Auch nach Jahrzehnten immer noch ein tolles Lied 🇸🇪",
        "Linn's voice is like magic.",
        "I cant get enough of this song! I listen to it t least once a week, what a great melody",
        "God bless you and your family",
        "Love this!!.   Wish songs were like this today.",
        "О..эта песня звучит свежо даже в 2020 году!",
        "I have never seen Linn or well Malin smile so much before. Its very nice to see",
        "Iconic! Wish they would come back.",
        "Ouvir ace of base, é uma terapia para a mente.",
        "Linn is so beautiful! ",
        "Это то чем я жил.",
        "Ouvindo hoje, ouvindo sempre... Alguém amis em 2024????/\nDe Jundiaí, SP Brasil...",
        "This is arguably their most underrated song.",
        "Is everyone in Sweden this beautiful?",
        "All their songs were so melodic",
        "one of the best dance bands in the 90s for my",
        "Excelente música que nunca en mis 37 años dejé de escuchar. Son una banda increíble",
        "Todos los temas de ace of base están buenísimos con la agrupación original cuando cantaba Malin..de chiquito no paro de escucharlos",
        "\"I'm not normal. I know it. I don't care.\" These lyrics are the story of my life lol..",
        "They have a unique music. They started in early 90's but their music still blend in this days. I still love thier music. To me.. thier music never fade. i luv u Ace to Base 4ever.️",
        "Listening in. 2020. I grow up with their music",
        "Synths at the beginning are insane",
        "Linn was my first crush, my mom bought me this album the year it came out, one of the first records I owned. I still love her.",
        "Клипы простенькие, но как же здорово!!! Никаких жоп и .... Просто музыка, просто кайф!",
        "В 90 х вы были самые красивые девушки ",
        "Essa banda é um hino. Isso sim é música. O tempo não volta q penaaaa",
        "La mejor Banda de música  POP de los 90 lejos el grupo ACE OF BASE",
        "Fueron de lo mejor en la época de los 90  !",
        "Шведки  -- супер!",
        "Ce groupe était vraiment au top",
        "Amazing Amazing music...never back...",
        "2021 and forever crazy about this song and the excellent video, thank you Ace of Base!",
        "Por fin pude ver una sonrisa de Lynn. Definitivamente que mujer tan hermosa. es una lástima que no sepa nada mas de ella. :(\n\nQue buen buen grupo este.... Saludos desde Colombia",
        "Como me encanta escuchar esta musica inspira ese sonido esa voz  si te inspiras te sientas en la cima del cerro y vez el atardecer como se asoma el sol",
        "Обожаю ))))))  И слушаю с удовольствием ))))    Воспоминания..............",
        "This song is more than music! This song is magic! I love this song so much and my first tattoo on my left arm says \"Never Gonna Say I'm Sorry\"! Jenny and Malinn thank you for being such wonderful profesionals and women! :) I hope I see Ace Of Base live again, because last year wasn't enough and I believe we'll meet again!",
        "Un video avanzado en su estilo para los 90. Una  melodía única e irrepetible. Un gran talento. Ace of Base rules",
        "Ace of base nice album. Nice group I wish they come with nice song.",
        "So sad thinking it was so many years ago we loved Ace Of Base as a current band, forever and always will love Ace Of Base.",
        "Childhood memories. Just starting to be a teenager when all these songs were released. Wonderful feeling listening to this song. Where is Ace of Base now-a-days??",
        "Fantastic Song , Amazing Honeys",
        "Hermoso tema ",
        "Darn that bass line, so good! !",
        "Eu amo essa banda , parabéns",
        "Очень талантливая команда, очень и очень. Нынешние бездари и близко не стоят. ABBA 90х",
        "Beauty and talent: What  a combination! Greetings from Brazil.",
        "AMAZING beat and vocals  ,90s music forever .",
        "2021 Обожаю эту группу  лучшие мои годы первая  любовь, встречи.",
        "they dont have to be naked to be a legend in music",
        "Супер девушки!!!!!",
        "Masterpiece",
        "Que temazo por diosss.  Saludos desde Argentina",
        "Ace of base were such a fantastic band. Got bullied at school for been an acer but still love them 20+ years later. ",
        "Suecia tiene las mejores artistas y cantores de todos los tiempos me encantan cuando hablan el español",
        "Ace of base 4 ever!!!! Happy music!!!!"
    ],
    "Crazy For You by Adele official": [
        "So much talent put into her FIRST album and she just kept growing and growing, now she's one of the biggest artists in the decade",
        "Happy 16th Anniversary Album 19 With Love from Saturn's Rings\n27/1/2024",
        "i miss this kind of genre of hers",
        "I love and miss this side of Adele.",
        "Found myself today singing out your name\nYou said I'm crazy\nIf I am I'm crazy for you\nSometimes sitting in the dark wishing you were here\nTurns me crazy\nBut it's you who makes me lose my head\nAnd every time I'm meant to be acting sensible\nYou drift into my head\nAnd turn me into a crumbling fool\nTell me to run and I'll race\nIf you want me to stop I'll freeze\nAnd if you want me gone, I'll leave, just hold me closer, baby\nAnd make me crazy for you\nCrazy for you\nLately with this state I'm in I can't help myself but spin\nI wish you'd come over\nSend me spinning closer to you\nMy oh my, how my blood boils, it's sweet taste for you\nStrips me down bare\nAnd gets me into my favorite mood\nI keep on trying, fighting these feelings away\nBut the more I do\nThe crazier I turn into\nPacing floors and opening doors\nHoping you'll walk through\nAnd save me boy\nBecause I'm too crazy for you\nCrazy for you",
        "My favorite song by adele. I saw this on jools Holland years and years ago and it just stuck in my heart.  She has a great country album in her, I think.",
        "Adele is one of my favorite artists, i know many songs of her except this \"crazy for you\". One day, someone named Eric told me it's his favorite song (maybe one of his favorites), and now here I am keep listening to this song.",
        "One of my favourite Adele songs ️",
        "One of my favorite songs.",
        "her voice are very unique and rare 'my opinion'",
        "Favourite Adele album",
        "It's good that we are few in the section. We have our own little circle of music lovers here.",
        "2023   and  I'm   still  here",
        "The fact that it’s just the five of us who’s here in the comment section",
        "I feel like I must comment under all of these unknown videos",
        "Still amazing",
        "2024 just adele",
        "Here in 2024.. and still amazed",
        "... the voice easy full power adorable... ",
        "I love it",
        "WE human love our humans",
        "my fav song",
        "Let me get in",
        "Hi Adele",
        "This is what I feel for my love who is disappointed with me ..",
        "One unquie voice love it",
        "",
        "",
        "      ",
        "adele guapaa",
        "Oct 2024?",
        "Uh why is there only like 30-40 comments?",
        "Why so many dislikes?",
        "<3",
        ".",
        "One of the worst songs i've ever heard.",
        "",
        "Uh why is there only like 30-40 comments?"
    ],
    "Daydreamer by Adele official": [
        "Ive been searching for this song its been in my memory but i couldn't remember the name of it or the lyrics. My big brother had it on his playlist and i heard it and couldn't stop listening to it. He passed away in 2021. I just exploded in tears after finding it. I miss him so much.",
        "im 15 and I've never listened to adele before. this is absolutely amazing and I can't believe it only has 1000 likes?? that's crazy. this is really good.",
        "Adele's soulful voice in Daydreamer is simply mesmerizing.",
        "Underrated song in Adele's career, overlooked slightly",
        "That's the way to start a successful career!",
        "Daydreamer\nSitting on the sea\nSoaking up the sun\nHe is a real lover\nAnd making up the past\nFeeling up his girl\nLike he's never felt a figure before\n\nA jaw dropper\nLooks good when he walks\nIs the subject of their talk\nHe would be hard to chase\nBut good to catch\nAnd he could change the world\nWith his hands behind his back, oh\n\nYou can find him sittin' on your doorstep\nWaiting for a surprise\nAnd he will feel like he's been there for hours\nAnd you can tell that he'll be there for life\n\nDaydreamer\nWith eyes that make you melt\nHe lends his coat for shelter\nPlus he's there for you\nWhen he shouldn't be\nBut he stays all the same\nWaits for you\nThen sees you through\n\nThere's no way I\nCould describe him\nWhat I'll say is\nJust what I'm hoping for\n\nBut I will find him sittin' on my doorstep\nWaiting for a surprise\nAnd he will feel like he's been there for hours\nAnd I can tell that he'll be there for life\nAnd I can tell that he'll be there for life",
        "Please come back Adele, I have been missing you. Are you truly back? You're my favorite singer.",
        "Happy 16th Anniversary Album 19 With Love from Saturn's Rings\n27/1/2024",
        "you know that there are songs you just don't wish to end and wish it would just go on for as long as it soothes you? This is one of those songs",
        "Why Adele's fans are called Daydreamers?\n\nAdele's fans are referred to as \"Daydreamers\" because of her song \"Daydreamer\" from her debut album \"19.\" The term has since become a way for her fans to identify themselves and connect with her music. The name reflects the emotional and introspective nature of Adele's songs, which often evoke deep feelings and reflections, akin to the act of daydreaming.\n\nIn her song \"Daydreamer\" she described her first crush on this perfect boy from her childhood. In an open interview she once said that \"Daydreamer\" is basically her dream man, her ideal perfect man. Although she can never have such a person in her life (as claimed by her), her fans adopted the name \"Daydreamers\" to commemorate that even though she may not have that perfect man, she will always have us. The fans will become her Daydreamers.",
        "I think she’s gonna drop her new album very soon",
        "Merveilleuse Adèle...Un rêve...",
        "I found this album reading a chinese webnovel lol. Cool song Mrs Adele. Have a wonderful day.",
        "This song is simply beautiful ",
        "why no one told me that Adele be giving CHILLS  like this?????............................I HAVE BEEN LIVING IN THE DARK ALL THIS TIME :(",
        "There is so much influence of Amy's Franke on this and I love it ",
        "You are my heart you are love please come back",
        "So many great songs from her over the years but I think this is the best. From 1 minute went it lifts off- just beautiful",
        "been gatekeeping this song when i was at 5th grade. brings back a lot of memories.",
        "My fav song ..whenever i listen this song , it takes me into my old memories. .so Beautiful soulful voice ",
        "It's like I've been to a psychologist",
        "Llevo 15 años escuchando esta canción  y quiero dejar constancia  de que adele es un icono  mundial, su voz es mágica y melodiosa. La amo",
        "Happy 15 Birthday!!!",
        "One of best albums",
        "Who’s here from Joe Locke?",
        "Hungover,,, LOUD IN DA BROWNSTONE… LOVE, BBQ, my dog, records, my child, happy, happy, happy, my loves",
        "... That voice very adorable... ",
        "Takes me back to a lost love xxx she knows who she is, just think of Hastings xxx",
        "Wow i love a lot your voice ",
        "I preferred Adele’s 2008 music, personally. There was something raw about it.",
        "Hey i love you adle",
        "I tell you she’s gonna drop the album on jan. 2021",
        "Damn, massively under appreciated Adele track! Only 29 comments and 8k likes and 1M views on an official upload. People are missing out on the gem. Not really a fan of much post 19, tbh. 19 is just splendid though - she wasn’t trying to sell records or be a popstar, she was just a young girl singing from her soul with some instruments. 21 was actually not bad, but 25 and 30 completely lost me, by those albums she is a popstar, she knows it and sounds like it.  all forms of media to me are at their best when they are slightly unrefined, unrestrained, and not blatantly just trying to appeal and sell to a mass audience.",
        "dear first love from church,\n\nhey i hope you're doing well, i'm sure you've accomplished things during the times we're apart and i'm very happy for you, like really. i know we're no longer in communication, no more birthday or christmas greetings but i'd still greet you if i really wanted to. i'm glad we chose to protect our own peace because this is for the best. however, on some nights, you're all i think about even though that feels uncomfortable to admit since it's been 2+ years. i remember when you dedicated this song to me when we were talking, and i really can't believe how much time has flown. it feels like we were fourteen yesterday and now we're turning 18 next year. meanwhile, i'll be keeping my promise, rooting for you from far away. maybe you'll read this? well i don't know and i don't think so haha. i'm happy i met you because thanks to you, i've learnt how to love myself and maybe someone else in the future, at the right time? other than that, you were the first boy who made me feel like this, i'm serious. but i'm thankful for that. i'll always remember the cheesy pickup lines and the good mornings and have you eaten's, and the songs we shared with each other, like this one. i'll really really really treasure you even though we've closed this chapter for a very long time. always take care  :) \n\n- grace (praying u don't read this very risky public message)",
        "This song called daydreamer could be about a dream thing like putting all the adverts that were on YouTube before that are taking away back on YouTube.",
        "Y is this the first time hearing this ",
        "It must have been so painful not to lose one but two people that you loved and trusted. And she lost her boyfriend over her gay best friend.",
        "I love u Adele!",
        "my love",
        "Daydreamer️",
        "real killer",
        "HELLO REVBREVER BRO oo than that haves thy blue solo all laffs moments.",
        "Wauuuuuuuuuuuuuuuuuiiiiiw",
        "I die for u Babe",
        "바닷가에 앉아\n\nSitting on the sea\n\n태양을 올려다보며\n\nSoaking up the sun\n\n꿈을 꾸는 몽상가여\n\nHe is a real lover\n\n그는 과거 따윈 잊고\n\nOf making up the past\n\n처음 느껴보는 듯\n\nAnd feeling up his girl\n\n애인의 몸을 어루만지는\n\nLike he's never felt her figure before\n\n진정한 사랑꾼이네\n\nA jaw dropper\n\n걸음걸이만 봐도 멋진\n\nLooks good when he walks\n\n아주 매력적인 남자\n\nIs the subject of their talk\n\n그들의 화제거리지\n\nHe would be hard to chase\n\n쫓아가긴 어렵지만\n\nBut good to catch\n\n잡을 가치가 충분해\n\nAnd he could change the world\n\n어쩌면 등 뒤의 그 두 손으로\n\nWith his hands behind his back, oh\n\n세상을 바꿔놓을지도 모르지\n\n\nYou can find him sitting on your doorstep\n\n바로 그 남자가 널 깜짝 놀래켜주려고\n\nWaiting for a surprise\n\n너의 집 현관에 앉아 기다리고 있어\n\nAnd he will feel like he's been there for hours\n\n아마 몇 시간은 기다린 것만 같을 텐데\n\nAnd you can tell that he'll be there for life\n\n그 남자는 거기서 평생을 기다려줄 남자야\n\nDaydreamer\n\n몽상가여\n\nWith eyes that make you melt\n\n그는 널 녹아버리게 할 눈빛으로\n\nHe lends his coat for shelter\n\n자기 코트를 벗어 널 따뜻하게 해줘\n\nPlus he's there for you\n\n거기다가 언제든\n\nWhen he shouldn't be\n\n널 위해 곁에 있어주지\n\nBut he stays all the same\n\n언제나 변함없이\n\nWaits for you\n\n너를 기다리고\n\nThen sees you through\n\n너의 모든 걸 알아줘\n\nThere's no way I could describe him\n\n어떻게 해도 그 남자를 형용할 수 없어\n\nWhat I've said is just what I'm hoping for\n\n내가 했던 말들은 단지 나의 희망에 불과하기에\n\nBut I will find him sitting on my doorstep\n\n하지만 난 날 깜짝 놀래주려고\n\nWaiting for a surprise\n\n나의 집 현관에 앉아있는 그를 찾고 말 거야\n\nAnd he will feel like he's been there for hours\n\n아마 몇 시간은 기다린 것만 같을 텐데\n\nAnd I can tell that he'll be there for life\n\n그 남자는 거기서 평생을 기다려주겠지\n\nAnd I can tell that he'll be there for life\n\n그 남자는 거기서 평생을 기다려주겠지",
        "احبك فيرفول",
        "Hi There Again, my real name is Mr Cannadine T. Boxill-Harris, how have you been Keeping up Lately, I just needed to know are you and your band are still Remixing and Re-Extending the Original Background song’s and still Reusing you’re own Extended word Lyrics but sing it differently and Reusing those original Extended Background Versions for those Particular song’s By Andrew Gold and The Korgis, Never Let her Slip Away and Everybody got to learn Sometime, why don’t they just Replace the Synthesizer Strings Sound to a Two Musette Accordion's and make those Two Musette sounds for those Two Accordion’s 3 to 8 and a Half times more Deeper then the Original Synthesizer Strings Sound so they can still have this Particular song called Everybody’s got to Learn sometime by the Korgis, also Replace the Xylophone Sound to a 68 and a half Times More Lower Chime Bells and Even a 75 and a half Times More Lower Still Drums Sound, Because it is Still one of my Very Very Very Very Very Very Very Very Very Very Favorite Song’s Ever Since I was about 10 Years of Age Thank You and I Love you’re singing Adele and make you’re singing voice 3 and a half times more Deeper Please Thank You Very Very Very Very Very Very Very Very Very Very Very Very Very Very Very Very much for your help, kindness and Support X X X X X",
        "",
        "",
        "lindaaaa",
        "Aa lottt",
        "2024년?",
        "Bro",
        "",
        "Daydreamer\nSitting on the sea\nSoaking up the sun\nHe is a real lover\nAnd making up the past and\nFeeling up his girl\nLike he's never felt a figure before\nA jaw dropper\nLooks good when he walks\nIs the subject of their talk\nHe would be hard to chase\nBut good to catch\nAnd he could change the world\nWith his hands behind his back, oh\nYou can find him sittin' on your doorstep\nWaiting for a surprise\nAnd he will feel like he's been there for hours\nAnd you can tell that he'll be there for life\nDaydreamer\nWith eyes that make you melt\nHe lends his coat for shelter\nPlus he's there for you\nWhen he shouldn't be\nBut he stays all the same\nWaits for you\nThen sees you through\nThere's no way I\nCould describe him\nWhat I've said is\nJust what I'm hoping for\nBut I will find him sittin' on my doorstep\nWaiting for a surprise\nAnd he will feel like he's been there for hours\nAnd I can tell that he'll be there for life\nAnd I can tell that he'll be there for life"
    ],
    "Hello by Adele official": [
        "1 BILLION HITS IN 2 MONTHS!!!???\n\n\nEdit: it hit 1 billion a couple of weeks ago, before mid-Jan, so yes, 2 months. Yall need to calm the fudgemuffins down.",
        "In about 10 minutes this will have 700 million views.",
        "Adele has that kind of music that makes you miss someone you made eye contact with on public transport 7 years ago",
        "A song is amazing when it makes you feel so much and so deeply. This and \"Caring Ghost\" by Mysteriousic both songs are musical masterpieces, Adele cannot be replaced she is the queen of music",
        "I never thought this song would get to 1B Views Wow",
        "1,000,000,000 views HELLLO  .. give me a hell yeah :)))",
        "When Adele admits to calling her ex a thousand times, she gets rewarded. But when I do, I get arrested.",
        "Let's see how many people are watching in 2024 ",
        "Hello, someone like you set fire to the rain, rolling in the deep. \n\nAdele's secret message",
        "Once, Adele was asked 'how much do you weigh?' On a show. She answered: 'I don't sing for the eyes, I sing for the ears.'",
        "This better break the Bad Blood record..... Adele makes music worthy of breaking records.",
        "1:11 is when the music start.",
        "Adele: Hello, its me... and i'm here to sweep away all the awards this year",
        "How can 95,000 people dislike this video? The song is good and the video actually isn't some creepy music video that ruins your perception of a song, like most others do nowadays.",
        "Adele Be Carrying The Whole Industry On Her Back.",
        "i remember the day this came out being shocked how quickly it reached 25 million views, now it has 3 billion lmfao",
        "COME ON ADELE'S COMEBACK DESERVES THE VEVO RECORD OVER BAD BLOOD",
        "Hello, it's me, I was wondering if you are listening to Adele's new song on repeat all day like I am?",
        "When she first said \"Hello\" it was exactly like \"...is it me you're looking for?\"",
        "Какое счастье, что есть такие люди, как Адель!!!!",
        "When I seen this I was like, \"There is no way she can out do 21 \" then I listened to this and I was like \"She outdid 21.\"",
        "The makeup salyage. Hello to those eyebrows and contour ",
        "Within a month, gangnam style had 420 million views. In a month, 'Hello' has 464 million views. Technically, this video has the potential to become to most viewed video on youtube. Let's make it happen people!",
        "She is so beautiful",
        "woow 21 million  views in 23h",
        "7 million in 14 hours wow ",
        "Is today the big Billion View day?",
        "Psh.. only 3.1 billion views? We can do better ",
        "10 MILLION !!!!! IN JUST ONE DAY !!!!!!! WTF",
        "Ah, Adele is back.",
        "I've watched this an unhealthy amount of times...",
        "This is one of the most beautiful songs that I've ever heard, it's melody and it's lyrics are amazing, and that voice is spectacular ",
        "I really cannot understand how can  anyone dislike this song",
        "This has to have broken records for the highest viewed in this amount of time ",
        "Everytime she says hello i expect her saying is it me you're looking for",
        "best of best",
        "50 years from now people will still be listening to Adele.",
        "I don't mind the ads,\nI don't mind the buffer\nBut when the ads buffer, I suffer",
        "Can you even imagine a song with ADELE AND SIA?",
        "2:22 This part🫠",
        "Holy shit 114 million views in less than a week!",
        "BOOM BOOM POW BITCHES! Is that a grammy i see?",
        "Adele: Hello, its me\nWorld: Take your Grammy",
        "\"Adele’s voice isn’t just heard; it’s felt. Her powerful vocals leave an indelible mark on everyone who listens!\"",
        "Her like/dislike ratio is insane. The world literally loves her.",
        "Vevo should disable comments because seeing 100+ comments asking who's watching is pretty annoying. but then again, I'm here for the music.",
        "Adele: \"Hello. It's me\"\nTaylor Swift: \"It was fun while it lasted.\" cries under a rock",
        "This song is so powerful, it hits right in the core of my spine. It reminds me of childhood love. True love.",
        "RIP to the artists dropping their album in November",
        "This song made me think about the break up I never had wtf help",
        "0:35 She know when that hotline bling",
        "The fact that she wrote this song for her younger self and now it makes more sense....",
        "I got a vevo ad for hello... on hello....",
        "Wow 1.8B views nice job adelle!",
        "What did Adele say when she crossed the road?\n\"Hello from the other side!\"",
        "Why do I keep falling harder when I listen to Adele's hello",
        "Adele: Hello From The Other Side\nMe: Starts throwing out Grammys",
        "Her music makes you miss the person you made aye contact with at the grocery 5 year ago.",
        "I honestly thought she was gonna go \"Hello? Is it me you're looking for?\"",
        "Who watching in 2024",
        "I remember when this video got 10 million views in 1 hour!",
        "omfg, 152 million views in 8 days..",
        "So sad about People killed in paris last night #PrayforParis",
        "Yall 3.1b views is crazy she is loved world wide",
        "Wow... first normal song in 2015",
        "THE STARE SHE DOES WHEN THE PIANO STARTS MY FUCKING WEAVE EVAPORATED",
        "3 hours left to break the vevo record and dethrone that rat!",
        "En esta Canción  ADELE es  majestuosa e Increible con esta Interpretación  nos muestra ese talento y su capacidad  para hacerlo tan maravillosa mente que no encuentro palabras para decir lo que me hace sentir....Amo esta mujer y amo su música......",
        "Why YouTube they show me an ad about this song what is the point if I'm about to listen to it",
        "Adele got me missing someone I don't know",
        "Adele makes the type of music that makes you miss someone you made eye contact with on public transportation 7 years ago .",
        "Music starts here 1:15",
        "If anyone was going to break Britney's record I'd want it to be Adele. She totally deserve it, I just don't want some flop like Taylor. Xo.",
        "When you listen really carefully you can hear Ariana crying in the background because Adele is gonna block her from #1",
        "1billion views in 2 months",
        "the best singer in the world, we love you adele.",
        "anyone else coming back to old songs at night",
        "40 million in 2 days?!?!",
        "She came out after 2 years and made a song better than all of the shitty artists  could ever do combined.",
        "Dang, took me 14 years to find peace about a break up but this song can touch that spot.",
        "2 days, 42 million views.... holy shit.",
        "ONE YEAR OF HELLO!!!!!!!!!!! :')",
        "0:17 - 0:30 you used to call me on your flip phone",
        "The Whole World. LOVE Her Music, Music is Universal.",
        "I love watching pom\nYou that read wrong\nYou read that wrong too\nYou read that twice to make sure you didnt read that wrong",
        "imagine thiss...\n1. adele ft. lana del rey\n2. adele ft. the weeknd\n3. adele ft. sam smith\n4. adele ft ed sheeran\n5. idk any suggestions? :P",
        "R.I.P Taylor Swift",
        "She's Really Awesome, ",
        "why did adele cross the road?\nTo say hello from the other side",
        "I think she broke the vevo record right??!",
        "57 million views in 2 days!? Who is watching this October 26th?",
        "I always interpret something deep into this song...Like that she's calling from the other side, meaning she's deceased. It's always breaking my heart. This song is one of the \"top ten\" played at funerals here in Germany. I was literally devastated to hear that it is just about a simple broken relationship....So we as Germans have another deep meaning to this song.",
        "Extremely rare to none how someone doesnt use twerking , nudity , overpriced crap and cheap dances , just her voice",
        "This song gat me missing people I don't even know... ",
        "Her music makes you miss the person you made eye contact with at the grocery 5 year ago.",
        "Love this song!",
        "every time she sings `hello` at the beginning  i wan't to sing `is it me you're looking for` :D",
        "Lionel: Hello! Is it me you 're looking for?\nAdele: Hello, can you hear me?\nLionel: Are you somewhere feeling lonely?\nAdele: I'm in California dreaming about who we used to be\nGaga: Hello, hello, baby, you called? I can't hear a thing\nStevie: I just called to say I love you\nBeyonce: Tonight I'm not takin' no calls 'cause I'll be dancin'\nAdele: At least I can say that I've tried\nMadonna: Waiting for your call baby night and day I'm fed up I'm tired of waiting on you",
        "Of course!!! She's AMAZING!! I am blessed to have a voice!! I sing her music all the time!!!",
        "Her Music makes you miss the person you made eye contact with at the #GROCERY 5 #YEARS ago......!"
    ],
    "You'll Never See Me Again by Adele official": [
        "She always owns her covers. This brings tears to my eyes (as do most of her songs).",
        "I love this lady! Thanks for your generous contribution to the happiness in the world today Adele!!!",
        "God, I love Adele. With Cheryl's original version, as good as it is, it comes across as this upbeat pop-ish love song - but here, the lyrics, and the emotion, come across so much better.",
        "Never heard of it, but I love her version of the song I love Adele who else loves Adele? :)",
        "I can't ever put in word how much perfection is in her music ",
        "I think cheryl and adele's are both beautiful in their own way. well done ladies!! :)",
        "So grateful to be alive @ a time when a Supernova, a Vocal Titan, an Enigma, & nothing short of a Phenomena aka Adele was pouring her heart & soul out & using her 1 of a kind gift that's unlike any other by sharing it with us.",
        "How come I am just hearing this song for the first time where have I been?   This is a very lovely song, I love it.  I had to listen to it more than twice.",
        "Still listening in 2020! Loveeeee this song.",
        "so beautiful and so much passion in her voice\nWhat a gifted human being!",
        "In fact when she's in the studio she's her own backup singer for those who didn't know. It's her singing in diferentes tones. Of course live she needs them, she cannot do it all at the same time",
        "Adele never fails to amaze me",
        "wow.i never heard this song...as a younger woman facing notbeing here for long....and leaving my loved ones,,,,,i finally cried all the tears ive been choking back. love this woman 4 making me finally feel....and god bless her.",
        "The way she sings this gives me goosebumps especially at  2.32 nto the song.  Amazing and so effortless",
        "Stop it!!!!! This is epic! Two of my favourite artists in one!! Needs releasing when she comes back!",
        "If I die before I wake up, promise to play this at my funeral. ",
        "Just a word: amazing!!! \nMakes me cry. \nHer voice is beautiful. ",
        "Both Cheryl Cole's and Adele's version are great! Love it!!!",
        "Wow this is a beautiful song.   we have all losted someone we love.  Remember to never leave someone in an argument.  I losted my twin brother  a day before our 43rd Birthday and we where not speaking first time ever i think he knew.  love you adel",
        "Gets me every time. Love this song so much. Just so touching.",
        "I'm so in love with this version of this song! Such an amaizing song, plus, Adele's voice! What else could you ask for!? She's simply the best! :) <3",
        "Adele covers of every other artist song make it seems real.......she knows how to make u feel the song.",
        "Adele has got a voice like an angel just like Rip Whitney Houston did when she was a life, you got to have the stomach to have a voice like Adele and Whitney Houston, Adele is amazing singer I'm no screaming fan, I know a good singer when I noticed one with an incredible voice, ",
        "Adele is so beautiful. i don't kno why she always covers up so much. big is beautiful! (:",
        "Thank you so much for sharing this beautiful song!",
        "This is wayyyyyyy better than the original her voice is more unique and not like the rest and she sets off a mood or emotion and I believe the tempo should be like it is in this ",
        "Love this version, so beautiful.",
        "This is absolutely beautiful. Love this soooo much. ",
        "Cheryl and Adele’s are both beautiful. No hate for either artist. They both are amazing and deserve nothing but love",
        "I don't really like covers, but I love Adele and she slayed. Once more she proved that she is the best singer alive. This version is far beyond beautiful.. it's just perfect.. and undoubtedly much better than the original one. Sorry Cheryl.",
        "Adele another of my favorite artist!",
        "Adele OMG, your voice it's from the angels!",
        "Adele proved from the thousandth time no singer can beat her and I am her fan number 1",
        "She sings it beautifully",
        "Adele has a beautiful voice.",
        "Awesome, and so beautiful",
        "Beautiful. My new fav",
        "I prefer this version over the original. So soulfull.",
        "Again, (Adele) is the one best artist of our generation.\n\nAdele!",
        "No matter what song is, Adele is gonna always be the singer who makes me cry.. <333",
        "Absolutely stunning!",
        "Thanks for sharing.  I haven't heard this song until now.  ",
        "Love both the versions!!",
        "2017 and this is my first time hearing this!  Love both versions! ",
        "I just love this song! It's sooo amazing! ♡",
        "3:13 omg love when the piano plays and Adele sings the final chorus ",
        "I LOVE this song!!!!!!! Adele is AMAZING!!!!!!!",
        "This will always be the best song!!!",
        "Her voice is so magic!! <3 <3",
        "Already she's blessed my ear",
        "the only person that saves a relationship ever so beautifully.",
        "Still listening in 2023. \nThis is music ",
        "I like all of her songs but this is by far my favorite I think",
        "Completely Obsessed!!!",
        "Amazing voices alive",
        "i love this song. its so soft but deep",
        "I ️️️ this song!",
        "Wisdom has no price. There is only wisdom in seeking it.",
        "Wonderful!",
        "beautiful one word beautiful",
        "Adele I love your songs... you are wonderful and fantastic :D",
        "amazing cover from Adele",
        "I love this song especially with adele sing8ng it",
        "When adele covers your song, its over for you.",
        "BEAUTIFUL!!",
        "I never heard this version but also beautiful like the original Cheryl Cole",
        "I thought I'd heard all of her songs. Never heard her do this one till just now!",
        "she is the vocal legend !!!",
        "the  best singer ever and ever. thanks god to brought her to us",
        "Promise this to be the last to kiss my lips... amazing",
        "that is sooooooo... I LOVE IT!!!",
        "Alouette is a bird (skylarks) and ''Dployer l'aile'' which is supposed to be written ''Déployer l'aile'' means something like ''Opening your wing'' or ''open your wing'' ",
        "An incredible voice.",
        "CAN’T BELIEVE SHE COVERED THIS!!!!",
        "This is my new favourite. It's beautiful. No more doubts.",
        "I am back here again to listen to this master piece",
        "Loving this!!",
        "I love your voice. when I listen to you. I always feel a little better",
        "I love Adele",
        "I can't wait for her new album ",
        "crazy for you adele ",
        "I love your voice Adele ️",
        "Never heard Adele sing in French before :)",
        "I love this song",
        "oh how exciting !!!! you are amazing ",
        "Queen Adele pls cover in the next album",
        "Beautiful song",
        "''Déployer l'aile'' translates to \"Deploy the wing\", but in the context of the song,﻿ it probably means something along the lines of \"Spread your wings\" \n\"Démèler l'aile\" translates to \"Untangling the wing\"\n\"plumerai les ailes\" translates to \"pluck the wings\"\n\nalthough not all of these are in this video, they are all in the song. ",
        "Excellent!!",
        "What a great voice!",
        "fantastic!!!!!!!",
        "The only person who makes an astonishing cover is Adele.",
        "I love her so much she is my inspiration for singing",
        "Nice song. ️",
        "I AM DYING the french in this sounds like some sort of conjuring spell hhhhhhh if i didn't have the lyrics on my screen i wouldn't even have identified it hhhhh love it though <3",
        "好听哭qwq不过之前没听过啊，终于把墙翻出来了",
        "Favourite version ",
        "2022 and i still love this song <3",
        "Love this song xoxo",
        "Better than the original omg"
    ],
    "All Your Love by Aerosmith official": [
        "One of my favorite songs is such a delightful blues, melody, lyrics and wonderful performance of this song by Steven, which only makes it listen to it again and again .. Thank you, you are the best band, I love you ..",
        "Uma das melhores... Riff maravilhoso. Voz perfeita.",
        "",
        "tank you",
        "My Home Town !!! MASSACHUSETTS GREATEST LOCAL BAND !!!!! AMERICAS GREATEST ROCK N ROLL BAND",
        "ℚ𝕦𝕖 𝕓𝕖𝕝𝕝𝕒 𝕔𝕒𝕟𝕔𝕚𝕠  𝕠𝕫𝕚𝕚𝕚𝕚",
        "I love my Aerosmith",
        "song would’ve been killer on draw the line",
        "This is a Cool Sound. Love It. The Voice Of Fun And True Music. Hi From A Fan In Lebanon Missouri.",
        "Thank you Steven Tyler",
        ""
    ],
    "Love Me Like A Bird Dog by Aerosmith official": [
        "Super demo love Aerosmith grand groupe",
        "I love Steven's voice on this song",
        "They need to release this on a download",
        "A tasty cut, flew under my radar. Sounds like maybe PUMP era or perhaps right after they got back together during the Done with Mirrors sessions.",
        "Ive heard that this song and a few others were the result of working with rick rubin in 1985 or 86,but why they didnt keep this song for a  record along with hollywood and take it easy,that record being perminent vacation,i dont know,but my guess is john kalodner steered them into basically songs that dont sound like aerosmith,hearts done time magic touch angel etc..songs that sounded like mtv rock bands the hair metal bands that were going around. They did in the end get a hit record but were never producing the full on aerosmith sound anymore except pump but thats it.",
        "Well if anyone sees Sammy Hagar/VH era release coming soon with unreleased music let's hope its someone from Aerosmith. \nIts what the fans want ",
        "Much better than some of the stuff that wound up on the albums of that era. Wish they'd kept rockin' like this longer.",
        "This song is on the wall of all the tracks to work and not work on for The Making Of Pump is that correct?",
        "We want a full release of this!!!",
        "It sounds like this is around 1984, it sounds like it would be in Done With Mirrors",
        "essa e uma otima musica q tem a kara do rocknroll espero q gravem no  novo cd!!!!!!",
        "It's got a \"Lightning Strikes\" feel to it. but, BETTER....EXTRA turn around...too bad a Teen Movie didn't pick this tune up for back ground during a montage' shot.  Needs to be out there to do that though.  Cool Phrase..\"Love me Like a Bird Dog\"....",
        "@62boneyard No... in DWM, most...if not, all of the guitar licks had the tones rolled down to 0.\nalso you can hear the difference in the drums used in DWM and PV",
        "️",
        "Thanks!"
    ],
    "Oasis In The Night by Aerosmith official": [
        "A beautiful gem, only for those that truly appreciate it. I will say, this album could have been a lot bigger with a bit more promotion.",
        "Killer Track !!! Many Thanks to Joe fuckin' Perry For nailing this Song perfectly ️",
        "Such Johnny Cash vibes from this. Well done, Mr. Perry. Although Aerosmith is apparently no more, I hope you are able to rock on.",
        "Great track Joe",
        "Love it very relaxing as well.",
        "Deluxe Edition bonus track CD 2 Track 17, from the 'Music from Another Dimension' album.  A"
    ],
    "The Hop by Aerosmith official": [
        "Overlooked lp but still great\n... especially cranked with a good subwoofer",
        "One of my all-time favorite!",
        "The material is there for hours of rocking.  24 hour rocking around the clock. Word.",
        "Raw, Unpolished and my fav album by Aerosmith !",
        "Ted T produced. No wonder it SOUNDS great",
        "Great song. Great album. IMO. A lot of haters disagree and say it sucks. To them I say. Opions are like assholes everybody's got one but mostof them stink. Lol",
        "Satch Boogie",
        "Best Aerosmith' s album that's my opinion",
        "They were sorting out the addiction bullshit at the time , and this album is t as focused , but it IS “Aerosmith” - a bit more raw/off the cuff . \nThe next album, Permanent Vacation, you can tell they really had their shit together and were chomping at the bit to prove it.",
        "Great LP, but was not crazy about newer stuff. This track kicks some serious ass.",
        "Has a 50s rockabilly tinge, probably how Little Richard and Elvis would have sounded doing hard rock/metal",
        "I Got This  In The 90s",
        "Too raw, but live like",
        "@andymelendez9757: As Myself as an Artist-Writer, Record Collector and a Music Fan, Because I Only Live for White People Music that is All About Contemporary and Contemporary Style Categoric Rock and Metal, then '50s and '60s Acoustic Jazz, and Of Course, I Basically Prefer that Much of the Performing Art Influencial/Inspired and Related Children's/Kids, Teen Pop, Novelty and then there's both Motion Picture and Television Soundtracks, which is all becoming in Part Of the North American/Canadian/International Musical Art Form Called #FreeForm and #Mainstream. So I Really Want to Say to you Is: The Massachusettes Based Everchanged Lineup So-Called \"Blues\"/Hard Rock and the North America Heavy Metal Group Of all time: Sgt. Raymond Tubano's AEROSMITH (1970-1989) May Have Been the So-called \"Bad Boys\" Of Boston, which they were are, and As Also They Become the So-Called \"America's (Brian Jones Hopkins's) Rolling Stones\" (1962-1989) and They were NOT The So-Called \"America's (James Patrick Page's Led) Zeppelin\" (1968-1979/1988), But I Must Tell You This, Because of \"The Hop\" from the David Geffen's 2nd. Record Company/Label GEFFEN Records's 1985 Release of the Now Most Historic and Unprecedented Original Underrated Albums Of All Time, DONE WITH MIRRORS, Has Becoming the North America, Canada and then International Critically Acclaimed (Ritchie Blackmore's) REAL STONE COLD Classic that Could've Selling Over 3 Million Copies (On all the Vinyl, CD and then Cassette Formats as all Started with the Original Print Issue Pressings). DONE WITH MIRRORS is Becoming the Most Best Selling Collectors Item Albums that Really Makes the Major Biggest Hit for All the Every and Over A Few Many and Million People who Have All the Record Collectors.",
        "@nicolagasperi2597: As Myself as an Artist-Writer, Record Collector and a Music fan, Because I Only Live for White People Music that is All about Adult Contemporary and Contemporary Style Categoric Rock and Metal, then '50s and '60s Acoustic Jazz, and Of Course, I Basically Prefer that Much Of the Performing Art Influencial/Inspired and Related Children's/Kids, Teen Pop, Novelty and then there's both Motion Picture and Television Soundtracks, which is all becoming in Part Of The North American/Canadian/International Musical Art Form Called #FreeForm and #Mainstream. So I Really Want to Say To You Is: The Massachusettes Based Everchanged Lineup So-Called \"Blues\"/Hard Rock and the North America Heavy Metal Group Of all time: Sgt. Raymond  Tubano's AEROSMITH (1970-1989) May Have Been the So-called \"Bad Boys Of Boston\", which they were are, and As Also they Become the So-Called \"America's (British Brian Jones Hopkins's) Rolling Stones\" (1962-1989) and They were NOT The So-Called \"America's (James Patrick Page's Led) Zeppelin\" (1968-1979/1988), But I Must Tell You This, Because of \"The Hop\" from the David Geffen's 2nd. Record Company/Label GEFFEN Records's 1985 Release of the Now Most Historic and then Unprecedented Original Underrated Albums Of All Time: DONE WITH MIRRORS, Has Becoming the North America, Canada and then International Critically Acclaimed (Ritchie Blackmore's) REAL STONE COLD Classic that Could've Selling Over 3 Million Copies (On all the Vinyl, CD and then Cassette Formats as all Started with the Original Print Issue Pressings). I Understand that DONE WITH MIRRORSIs the Best AEROSMITH's Album, But It's Becoming the Most Best Selling Collectors' Item Albums that Really Makes the Major Biggest Hit for All The Every and Over A Few Many and Million People who have All the Record Collectors In all Of North America, Canada and the World."
    ],
    "Ain't It A Shame by Air Supply official": [
        "Yeah! beautiful!",
        "beautiful song",
        "Kool as always",
        "Very 10CC-ish)) cool!"
    ],
    "Crazy Love by Air Supply official": [
        "Hermosa cancion, no la habia escuchado antes, muchas gracias por compartir, los australian boys son la mejor banda en el mundo entero.",
        "This is one of the best songs from the 1985 era. I cannot understand why this didn't make the album...it is fantastic, one of their best. Better than Sandy. One of the best b side non album tracks out there.",
        "The best track on the album that was not on the album! B-Side To Just As I AM. Way more interesting than Just As I Am. I have bout this vinyl 5 times because I am so fascinated with this song.",
        "Two of Air Supply's Best Songs were B sides...Crazy Love and Late Again",
        "Yeah my favourite air supply!",
        "first time i heard this one. nice song. as expected for an air supply song.",
        "this  is  not  an  unreleased  song..  they  edited  it   in  1985  as  b- side  of  just  as  iam  single..  personally   i  consider  this  song  magical..  with  amazing  arrangements  and  vocals..  its  one  of  my  all  time  favs  of   air  supply... should have  been  a  big  hit  for  them  in  80' ...  they  dont  play  it  live..  in  fact ... i  think  they  never  have  played   it",
        "it comes and it goes...leaving you...with a feeling you never knew",
        "omg....I haven't heard this song in ages! For some reason, I woke up this morning thinking of it. Love, love, love this song! Anyone know how I can get a copy?",
        "The best of the best!",
        "Its very beautiful music by air supply but it is better to have a karaoke of this please produce and make it for karaoke or videoke",
        "even me ive just heard this song right now, lot of air supply song still never heard",
        "thanx for uploading ^^",
        "I would LOVE LOVE LOVE to have this song!! Is there any way you could send me the MP3?  I would be forever grateful. I have been an Airhead since I was 9 years old, 31 1/2 years ago... Thanks!",
        "Good song....but not better than \" When time is right\"."
    ],
    "Dancing With The Mountain by Air Supply official": [
        "Great song with a mystic undertone...not sure what I just wrote or if it makes sense...but it seemed like something needed to be written on this space..."
    ],
    "Don't Be Afraid by Air Supply official": [
        "Este clásico Long Play, porque por medio de él fue que reconocimos el sobresaliente trabajo de esta banda musical en donde Graham Russell y Russell Hithcock y el resto de la agrupación se imponen en el ambiente, contiene todas sus canciones, además de exitosas, de una gran calidad interpretativa y musical. Cuestión aparte, lo impresionante, tanto para la época y aún en la actualidad ,de la caratula o cubierta del disco. Quienes tenemos esta reliquia, no dejamos de admirar  la calidad de esta toma, que la hace un monumento a la obra musical contenida en su interior. Aír Supply es parte indivisible de nuestro crecimiento personal. Sigamos adelante...",
        "Air supply is still best australian band through the years.",
        "One I remember after all these years.  I loved it then, I love it now.  My daughter had some friends over, and I was coming downstairs.  They were playing Don’t Be Afraid on stereo.  It was so beautiful, it stopped me in my tracks, I had to sit down on the stairs and listen.  Love Air Supply.",
        "My cousins favorite song before he passed. It huts and lifts so many years later. I miss him dearly.",
        "The vocal harmonies are just perfect.",
        "through the years goes by AIR SUPPLY IS STILL THE BEST AUSTRALIAN BAND IN TRHE WORLD.",
        "The vocals really Good",
        "I love it,so simple but very emotional",
        "Love This Very Emontional",
        "I remember this from",
        "LYRICS:\nWhen winter calls and the wind won't wait\nLook through the rain see the leaves start to break\nOnce so alone like a prayer on the sea\nNothing to hide, so much there to see\nDon't be afraid\nDon't be afraid\nThe thoughts you wear like a long lost friend\nAre buried so deep that you can't see them end\nYou know spring will come just as quick as you need\nAnd run straight to you when the dark nights are freed\nDon't be afraid\nDon't be afraid\nDon't be afraid\nDon't be afraid",
        "Composer, Lyricist: Frank Esler-Smith",
        "quen esta canción  y el efecto de las voces muy similares\nhttps://www.youtube.com/watch?v=BQeMxWjpr-Y"
    ]
}